Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/*_Pulse.po
Languages: ru

source: Pulse Plugin
ru: Плагин Pulse

source: Overview
ru: Общая информация

source: The Pulse plugin is designed for visualization of virtual machines performance statistics. Currently, this CloudStack-UI extension is only compatible with ACS clusters that use the KVM hypervisor. With help of sensors that collect virtual machines' performance statistics via the Libvirt API and store them to an InfluxDB datastore and RESTful statistics server, CloudStack-UI is able to display CPU, RAM, disk IO and network traffic utilization in the form of convenient visual charts.
ru: Плагин Pulse создан для визуализации статистики работы виртуальной машины. В текущей реализации данное расширение CloudStack-UI совместимо только с кластерами ACS, использующими гипервизор KVM. С помощью сенсоров, которые собирают статистику работы виртуальной машины посредством Libvirt API и сохраняют ее в хранилище InfluxDB и на сервер статистики с сетевой архитектурой REST, CloudStack-UI может отобразить объемы используемых ресурсов - CPU, RAM, диски для ввода/вывода данных и сетевой трафик - в форме наглядных графиков.

source: Pulse allows users of Apache CloudStack to monitor current and previous operational states of virtual machines. The plugin supports various view scales like minutes, hours, days and enables data overlays to monitor peak and average values.
ru: Pulse дает возможность пользователям Apache CloudStack контролировать текущее и предшествующие рабочие состояния виртуальных машин. Плагин поддерживает различную группировку данных по времени - поминутная, почасовая, посуточная, а также позволяет производить наложение данных для отслеживания средних и пиковых значений.

source: We consider this plugin very important for the CloudStack ecosystem as currently there is no built-in functionality to track VM operational states, although it is vital for system administrators to successfully operate virtual servers.
ru: На наш взгляд, данный плагин важен в экосистеме CloudStack, т.к. сейчас в CloudStack не существует встроенной системы для отслеживания рабочих состояний виртуальных машин, в то время, как это необходимо системным администраторам для отслеживания работы виртуальных серверов.

source: Plugin deployment and configuration Instructions can be found below.
ru: Инструкции по установке и настройке плагина представлены ниже.

source: Deployment Instructions
ru: Установка плагина Pulse

source: The Pulse plugin works only for KVM hypervisor right now.
ru: На данный момент плагин Pulse работает только для гипервизора KVM.

source: Please, make sure that you have `cs-pulse-server <https://github.com/bwsw/cs-pulse-server>`_ and `cs-pulse-sensor <https://github.com/bwsw/cs-pulse-sensor>`_ to be able to work with the Pulse plugin.
ru: Для работы с плагином Pulse убедитесь, что у вас есть `cs-pulse-server <https://github.com/bwsw/cs-pulse-server>`_ и `cs-pulse-sensor <https://github.com/bwsw/cs-pulse-sensor>`_.

source: To enable the Pulse plugin you need:
ru: Для подключения плагина Pulse необходимо:

source: Configure plugin in ``config.json``.
ru: Задать настройки для Pulse в ``config.json``.

source: Run docker container with a correctly specified ``cs-pulse-server`` endpoint.
ru: Запустить docker-контейнер, в котором указан корректный адрес ``cs-pulse-server``.

source: Pulse Configuration
ru: Настройка Pulse

source: Please, enable ``pulse`` in the extensions section of the ``config.json``::
ru: Включите ``pulse`` в блоке ``extentions`` в файле конфигураций ``config.json``::

source: Running Cloudstack-UI Docker Container
ru: Запуск ``cloudstack-ui`` из контейнера

source: View VM Performance Statistics via UI
ru: Просмотр статистики работы виртуальной машины через интерфейс

source: After the plugin is activated in the configuration file, you will see the "Pulse" option in the Action box.
ru: После активации плагина через файл конфигурации в контекстном меню виртуальной машины появится опция "Pulse".

source: The option is only available for machines in the Running status.
ru: Данная опция доступна только для запущенных машин.

source: By selecting this option you open a modal window that shows the virtual machine performance statistics in graphs. In separate tabs, you can view statistics for the following metrics:
ru: Выберите данную опцию. Откроется модальное окно, в котором отображается статистика работы машины в виде графиков. В отдельных вкладках можно видеть отчеты по следующим метрикам:

source: CPU/Memory
ru: ЦП / Память

source: Network
ru: Сеть

source: Disk
ru: Диск

source: Reports are presented in a graphic form. The building of charts is based on the defined settings. By default, the first option in the list is selected for each setting. You can adjust settings to get statistics for the period you wish. Read more about the settings below.
ru: Статистические отчеты представлены в формате графиков. Графики строятся на основе заданных настроек. По умолчанию, для каждой настройки выбирается первая опция в списке. Можно задать необходимые настройки, чтобы получить данные за нужный период времени. Ниже представлена более подробная информация о настройках.

source: General Settings
ru: Общие настройки

source: To get statistics for a virtual machine set up general settings:
ru: Чтобы получить статистику по работе виртуальной машины, задайте общие настройки:

source: **Range** - Select the time interval to show the statistics for. The following options are currently available: 15m, 30m, 1h, 2h, 4h, 12h, 1d, 1w, 30d.
ru: **Диапазон** - Выберите временной интервал, за который вы хотите получить данные. Сейчас доступны следующие опции: 15 минут, 30 минут, 1 час, 2 часа, 4 часа, 12 часа, 1 день, 1 неделя, 30 дней.

source: **Aggregation** - Select the interval(s) for data aggregation. Available options here depend on the selected range. This can be defined in the `configuration file <https://github.com/bwsw/cs-pulse-server/blob/master/config.md>`_. Aggregation value is always less than the range value. When several options are selected, graphs are marked with different colors and displayed as overlaid.
ru: **Агрегация** - Выберите интервал(ы), по которым данные будут агрегироваться. Список доступных опций зависят от выбранного диапазона. Опции для каждого диапазона определяются в `конфигурационном файле <https://github.com/bwsw/cs-pulse-server/blob/master/config.md>`_. Значение агрегации всегда меньше значения диапазона. При выборе нескольких опций графики по каждой опции отмечаются разными цветами и накладываются друг на друга.

source: **Shift** - Define a numeric value and select a measurement unit for the graph shift. You can shift the graphs manually by clicking at arrows </> to the right or left from the graph.
ru: **Сдвиг** - Задайте числовое значение и выберите единицы измерения для сдвига графика. Также, график можно двигать вручную кликом на стрелки справа и слева от графика.

source: All settings are required.
ru: Все настройки обязательны.

source: Options for all the settings should be defined in the `configuration file <https://github.com/bwsw/cs-pulse-server/blob/master/config.md>`_ on backend.
ru: Доступные опции для всех настроек определяется в `конфигурационном файле <https://github.com/bwsw/cs-pulse-server/blob/master/config.md>`_ на стороне бэкенда.

source: At the screenshot below, you can see statistics for the last day with 30-minute and 1-hour aggregation with the 2-hour shift.
ru: На изображении ниже представлена статистика за последний день с агрегацией 30 минут и 1 час и сдвигом 2 часа.

source: The system saves defined settings. They are used in all other tabs, that means if you set CPU/memory report settings and then move to other tabs, you will see graphs for NIC and disks built with the same settings.
ru: Система сохраняет заданные настройки. Они используются в остальных вкладках. Это значит, что если вы задали настройки для получения отчета по использованию ЦП/памяти, то при перемещении между вкладками вы увидите, что графики по сети и дискам будут автоматически построены с заданными настройками.

source: If you change settings, the graphs change immediately. You can refresh the graph reports as often as you wish by clicking at |refresh icon|.
ru: При изменении настроек графики сразу перестраиваются. Также, графики можно обновлять вручную так часто, как это нужно, нажатием на |refresh icon|.

source: When hovering on the graph, you can see details corresponding to this point: a date, a parameter and its value.
ru: При наведении мыши на график можно просмотреть детали, соответствующие данной точке: дата, параметр, значение параметра.

source: Statistic Metrics
ru: Метрики статистики

source: **CPU/Memory**
ru: **ЦП / Память**

source: This is the first tab that opens by default. In the CPU/Memory tab, you can view the statistics of CPU/Memory usage by the machine.
ru: Это первая вкладка, которая открывается по умолчанию при выборе опции "Pulse" в контекстном меню машины. Здесь можно просмотреть статистику использования ЦП / памяти виртуальной машины.

source: CPU and Memory usage statistics is presented in different graphs. To build graphs it is enough to define general settings.
ru: Статистика использования ЦП и памяти представлена на отдельных графиках. Чтобы построить графики достаточно задать общие настройки.

source: **Network**
ru: **Сеть**

source: In this tab, you can view the statistics for network traffic usage. To build the graphs you should define general settings and select a NIC for which you want to get the report.
ru: В данной вкладке можно просматривать статистику использования сетевого трафика. Чтобы построить графики, необходимо задать общие настройки и выбрать сеть, для которой нужно получить отчет.

source: Network statistics displays in four graphs by the following metrics:
ru: Статистика сети отображается на четырех графиках по следующим метрикам:

source: Network read/Network write
ru: Прочитано по сети/Отправлено по сети

source: Network read packets/Network write packets
ru: Прочитано по сети (пакетов)/Отправлено по сети (пакетов)

source: Network write drops/Network read drops
ru: Потери при записи/Потери при чтении

source: Network write errors/Network read errors
ru: Ошибки при чтении/Ошибки при записи

source: **Disk**
ru: **Диск**

source: In this tab, you can view the statistics for disk space usage. To build the graphs you should define general settings and select a disk for which you want to get the report.
ru: В данной вкладке можно просматривать статистику использования дискового пространства. Чтобы построить графики, нужно задать общие настройки и выбрать диск, для которого необходимо получить отчет.

source: Disk statistics displays in three graphs by the following metrics:
ru: Статистика диска отображается на трех графиках по следующим метрикам:

source: Disk read/Disk write
ru: Запись на/Чтение с диска

source: Disk read/Disk write (IOPS)
ru: Запись на/Чтение с диска (IOPS)

source: Disk IO errors
ru: Ошибки IO
