Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/*_Resources.po
Languages: ru

source: Resource Limits Management Plugin
ru: Плагин управления лимитами ресурсов

source: Overview
ru: Общая информация

source: We introduced a new plugin - *Resource Limits Management* - that allows Domain Administrators to manage resource quotas, and users to change resource limits. The extension helps to avoid such situations when a user has extra resources that are not used but accounted in billing. Or when a user has utilized all the available resources and now needs more. In either of these cases, a user would have to request Administrator to change the resource limits. With the new plugin a user gets access to resource limits, and Administrator can manage resoure quotas via UI.
ru: Мы представили новый плагин, который позоволяет администраторам домена управлять квотами ресурсов, доступных пользователю, а пользавателю в свою очередь - изменять ограничения доступных для него ресурсов в рамках тех квот, которые установил администратор. Плагин позволяет разумно расходовать ресурсы и избегать ситуаций, когда лишние ресурсы простаивают, но за них приходится платить. Или когда пользователь использовал все доступные ресурсы, и ему приходится обращаться к Администратору, чтобы тот выделил ему дополнительные ресурсы. C новым плагином пользователь может сам изменить лимиты ресурсов. А Администратор получает доступ к управлению квотами ресурсов.

source: The extension uses two backend plugins:
ru: Расширение работает на основе двух бэкенд-плагинов:

source: the `µAPI Gateway plugin <https://bitworks.software/en/products/cloudstack-micro-api-gateway/>`_ developed by us to help developers to create extensions for CloudStack using any programming language.
ru: `µAPI Gateway <https://bitworks.software/en/products/cloudstack-micro-api-gateway/>`_, с помощью которого разработчики могут создавать и подключать расширения для CloudStack, созданные на любом языке программирования.

source: the *Resource Limits Management* backend plugin that extends CloudStack API with additional endpoints.
ru: бэкенд-плагин *Resource Limits Management*, который расширяет API CloudStack дополнительными вызовами.

source: After the backend plugins are deployed and configured the Resource Limits Management UI-plugin can be activated and configured via the configuration file (see the `configuration guide <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#resource-limits-plugin>`_). Once it is activated, users and administrators get access to resource limits and quotas management via UI.
ru: После установки, подключения и настройки бэкенд-плагинов можно активировать и настроить UI-плагин Resource Limits Management в файле конфигурации config.json (см. подробнее `руководство по конфигурациям <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#resource-limits-plugin>`_). После этого пользователям и Администраторам становится доступно управление ресурсами в UI.

source: Plugin Deployment
ru: Установка плагина

source: The instructions on plugin deployment are presented at the `project wiki-page <https://github.com/bwsw/cloudstack-ui/wiki/Resource-Limits-Management-Plugin>`_.
ru: Подробная инструкция по установке плагина представлена на `странице wiki проекта <https://github.com/bwsw/cloudstack-ui/wiki/Resource-Limits-Management-Plugin>`_.

source: To enable the Resource Limits Management UI-plugin you will need to:
ru: Чтобы подключить UI-плагин Resource Limits Management нужно:

source: Install and configure the *µAPI Gateway* backend plugin in CloudStack.
ru: Установить и настроить бэкенд-плагин µAPI Gateway в CloudStack.

source: Deploy the *Resource Limits Management* backend plugin.
ru: Установить бэкенд-плагин Resource Limits Management.

source: Enable and configure the *Resource Limits Management* UI extension via the `config.json` file.
ru: Настроить и подключить UI-плагин Resource Limits Management через конфигурационный файл.

source: Managing Resource Limits via UI
ru: Управление лимитами ресурсов через UI

source: Resource limits management by Domain Administrators
ru: Управление квотами ресурсов для Администраторов домена

source: After the plugin is enabled, Domain Administrator can open "Resource quotas" under the "Accounts" menu. In this section, Administrator can view and set resource quotas. To edit resource quotas Administrator enters desired minimum and maximum values for a resource parameter.
ru: После активации плагина в меню "Аккаунты" Администратору становится доступен раздел "Квоты ресурсов". В нем можно просматривать и редактировать ограничения ресурсов. Для этого достаточно ввести желаемые минимальные и максимальные значения для того параметра ресурсов, квоты которого нужно изменить.

source: [-1] stands for any value, that means a resource parameter with [-1] is unlimited. Such parameters are not available for users to change resource limits.
ru: Значение [-1] означает, что параметр ресурса неограничен. Лимиты такого параметра недоступны для изменения пользователем.

source: Administrator sets resource quotas for all accounts in the domain.
ru: Ограничения задаются для всех аккаунтов в домене.

source: Changing resources by users
ru: Изменения лимитов ресурсов пользователями

source: After the plugin is enabled, a user can change resource limits in case of the lack of resources or, alternatively, nonuse of extra resources. To send a request a user goes to the Resource usage panel under the *Virtual Machine* section and clicks «Request resources».
ru: После активации плагина у пользователя появляется возможность изменить лимиты доступных ресурсов. Чтобы изменить лимиты ресурсов, пользователю достаточно нажать на кнопку "Запросить ресурсы", которая расположена в панели ресурсов в разделе *Виртуальные машины*.

source: In the appeared modal window, a user can see resource parameters and a slider for each parameter. The scales are limited in accordance with the quotas set by Administrator. A user can move a slider within the quotas to change a resource parameter value. Then click «Request» to change the resource limits.
ru: При нажатии на кнопку открывается модальное окно, в котором пользователь видит параметры ресурсов и "бегунок" для изменения ограничений каждого ресурса. На шкале для каждого ресурса пользователь видит ограничения, заданные Администратором - двигать бегунок можно только в рамках этих ограничений. После установки нужных значений, пользователь нажимает "Запросить". Лимиты ресурсов изменяются в соответствии с заданными значениями.

source: Unlimited resources (set by Administrator as [-1]) are not listed among the resource parameters. That means they are not available for changing.
ru: В списке нет тех параметров ресурсов, у которых ограничения не заданы (квота имеет значение [-1]), то есть для них нельзя запросить изменения.
