Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/*_Webshell.po
Languages: ru

source: WebShell Plugin
ru: Плагин WebShell

source: In clouds the most commonly used operating systems nowadays are Unix or Linux based operating systems. To control Linux system administrators use standard SSH interface. Most system administrators or cloud users have SSH client installed on their machines.
ru: В облачной среде наиболее часто используемой операционной системой на сегодня является Unix или операционные системы на базе Linux. Для управления ими администраторы используют стандартный интерфейс SSH. Многие системные администраторы или пользователи облачной среды устанавливают на свои машины SSH-клиент.

source: First of all, it is more interactive, because it allows performing copy&paste operations. It is more performant if you need to work with text.
ru: Прежде всего, он более интерактивен, т.к. он позволяет выполнять операции copy&paste. При работе с текстом он наиболее эффективен.

source: In addition to the UI inactivity interval, SSH plugin supports its own inactivity timeout so you should not worry leaving SSH opened when you go out for a cup of coffee. In comparison to a VNC console, if you open it in your browser, it will be opened forever.
ru: В добавок к лимиту времени ожидания активности самого UI, плагин SSH также поддерживает лимит времени ожидания активности. Это позволяет спокойно отлучиться на чашечку кофе, оставив SSH открытым, в отличии от консоли VNC, которая всегда остается открытой.

source: This plugin is not required, but it is very helpful and easy to install and configure it. There is a docker webshell container that should be deployed. This container is a standalone shell proxy and can be used outside of the CloudStack UI, but there is an option to integrate them, Just specify the WebShell endpoint when you run the UI container. You can also disable the plugin in the UI configuration anytime you want.
ru: Данный плагин не является обязательным, но зачастую он очень полезен, прост в установке и конфигурировании. Для его подключения необходимо развернуть docker-контейнер, который является автономным shell proxy контейнером и может использоваться и помимо CloudStack-UI, но может быть и интегрирован с ним. В этом случае просто укажите адрес WebShell при запуске контейнера UI. В любой момент плагин может быть выключен посредством изменения конфигураций UI.

source: Read more about it below.
ru: Более подробно об установке и настройке плагина см. ниже.

source: Overview
ru: Общая информация

source: WebShell is a CloudStack-UI extension designed to perform a clientless SSH connection to a virtual machine. The extension is activated in the CloudStack-UI configuration file and is supported by an additional Docker container. As for the way of WebShell usage, the plugin is similar to NoVNC interface provided by CloudStack. However, WebShell uses the SSH protocol and does not allow VM emergency management.
ru: WebShell - это расширение CloudStack-UI, созданное для выполнения безклиентного SSH подсоединения к виртуальной машине. Данное расширение подключается через настройки CloudStack-UI и поддерживается дополнительным docker-контейнером. В части использования WebShell схож с интерфейсом NoVNC от CloudStack. Однако, плагин использует протокол SSH, что делает невозможным аварийное управление ВМ.

source: The need for this extension is determined by the shortcomings of the NoVNC interface, that obstructs its usage for everyday administrative purposes:
ru: Потребность в данном плагине обусловлена недостатками интерфейса NoVNC, которые ограничивают его использование для решения каждодневных администраторских задач:

source: Low interactivity and slow throughput of the terminal interface;
ru: низкая интерактивность и медленная скорость работы терминального интерфейса;

source: Lack of possibility to copy/paste text from the user's local machine;
ru: невозможность скопировать и вставить текст с локальной машины пользователя;

source: Missing feature to complete the session by timeout;
ru: отсутствие функциональности завершения сессии по таймауту;

source: Access to the virtual machine in out-of-band mode, which allows performing a number of insecure operations.
ru: доступ к виртуальной машине во внеполосном режиме, что позволяет производить небезопасные операции.

source: WebShell plugin solves these problems:
ru: Плагин WebShell позволяет решить эти проблемы:

source: Provides high interactivity, which is especially useful when working with information that contains large amounts of text;
ru: он предоставляет высокую интерактивность, что особенно важно при работе с большим количеством текста;

source: Allows copying and pasting text from the workstation;
ru: позволяет скопировать и вставить текст из терминала;

source: Enables configuration of the session completion timeout, thereby improving the security of the system;
ru: позволяет задать период времени окончания сессии, что повышает безопасность системы;

source: Does not provide an access to the VM in out-of-band mode.
ru: блокирует доступ к ВМ при работе во внеполосном режиме.

source: In future releases, this plugin will be extended with additional features such as integration with the VM access key store and dashboard for efficient work with many open SSH sessions.
ru: В будующих релизах к плагину будет добавлена такая функциональность, как интеграция с хранилищем ключей доступа ВМ и панель управления для эффективной работы со множеством открытых SSH-сессий.

source: This feature is not available in basic CloudStack UI and API.
ru: В оригинальном CloudStack UI и API данная функциональность недоступна.

source: Plugin deployment and configuration instructions can be found below.
ru: Ниже представлены инструкции по установке и настройке плагина.

source: Deployment Instructions
ru: Инструкции по установке

source: To enable `WebShell <https://github.com/bwsw/webshell>`_ CloudStack-UI Plugin it is required to:
ru: Для запуска плагина `WebShell <https://github.com/bwsw/webshell>`_ CloudStack-UI необходимо:

source: Run WebShell container in the backend.
ru: Запустить контейнер WebShell на backend'е.

source: Enable and configure WebShell plugin in ``config.json``.
ru: Подключить и настроить плагин WebShell в ``config.json``.

source: Starting WebShell Backend
ru: Запуск WebShell Backend

source: Please check `Usage <https://github.com/bwsw/webshell#usage>`_ section in the `WebShell <https://github.com/bwsw/webshell>`_ repository.
ru: Пожалуйста, изучите `раздел <https://github.com/bwsw/webshell#usage>`_ в репозитории `WebShell <https://github.com/bwsw/webshell>`_.

source: WebShell configuration
ru: Настройка WebShell

source: Please configure ``webShell`` in the ``extensions`` section of the ``config.json``::
ru: Включите ``webShell`` в блоке ``extentions`` в файле конфигураций ``config.json``:

source: ``webShell.address`` is the address of a WebShell backend. WebShell will not be available unless an address is specified.
ru: ``webShell.address`` - адрес backend'a WebShell, необходим для доступа к WebShell.

source: Running ``cloudstack-ui`` docker container with WebShell
ru: Запуск ``cloudstack-ui`` c WebShell из контейнера
