Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-Events.po
Languages: ru

source: Activity Log
ru: Журнал событий

source: In the *Accounts* -> *Activity log* section you can see user activity in the account. Event search by main parameters - date and keywords - is supported to make it easier to find a necessary event for a specific date or type.
ru: В разделе *Аккаунты* -> *Журнал событий* отображаются действия пользователя в аккаунте. В списке можно быстро найти события по основным параметрам - дате и ключевым словам.

source: Events List
ru: Список событий

source: Events in the Activity log are listed in a chronological order from the latest till the earliest. It represents the full list of events for a selected day.
ru: События в *Журнале событий* отображаются в хронологическом порядке от наиболее позднего до наиболее раннего. В списке содержатся все события за выбранный день.

source: A user can view activities for his/her user only. An Administrator can see events for all accounts in the domain.
ru: Пользователь видит в журнале только свои действия. Администратор видит события всех пользователей во всех аккаунтах домена.

source: The following information for each event is presented in the list:
ru: В списке представлена следующая информация для каждого события:

source: Event description.
ru: Описание события.

source: Level - A kind of a category the event belongs to. It can show:
ru: Уровень - категория, которой принадлежит событие. Возможные уровни:

source: INFO - For regular activities, for example, logging in, creating a VM, attaching a disk.
ru: INFO - для простых действий пользователя, например, вход в систему, создание машины, присоединение диска к ВМ.

source: WARN - For any warnings occurred.
ru: WARN - для предупреждений.

source: ERROR - For any errors occurred, for example, an error while registering an SSH key pair.
ru: ERROR - для ошибок, например, ошибка при создании SSH ключа.

source: Type - Displays in what aspect of the system the event has taken place, for example: ``USER.LOGIN`` - for events happened at user authentication to the system; ``VOLUME.RESIZE`` - for events at disk size change.
ru: Тип - показывает, в какой части системы произошло данное событие, например: ``USER.LOGIN`` - для событий, произошедших при авторизации пользователя в системе; ``VOLUME.RESIZE`` - для событий изменения размера диска.

source: Time of the event.
ru: Время события.

source: Filtering of Events
ru: Фильтрация событий

source: To easily find an event in the list use the filtering tool above.
ru: Фильтрация позволяет быстрее найти в списке нужное событие. Инструмент фильтрации расположен над списком.

source: Any user can filter events by:
ru: Фильтровать список можно по следующим параметрам:

source: Date - Allows selecting events for a specific date. By default, the today's date is selected. Click |date icon| and in the appeared calendar change the date for the day you wish to see activities for.
ru: Дата - позволяет выбрать события за определенный день. По умолчанию события отображаются за сегодняшний день. Для выбора даты нажмите |date icon| и в появившемся календаре выберите нужную дату.

source: Click "OK" to filter the list. The events will be selected in accordance with the chosen date.
ru: Нажмите "OK" для применения параметров фильтрации. События в списке будут отобраны в соответствии с выбранной датой.

source: Click "CANCEL" to drop the selection.
ru: Чтобы сбросить настройки фильтрации, нажмите "ОТМЕНИТЬ".

source: Levels - Allows selecting events by levels. Choose the level/levels you with from the drop-down list.
ru: Уровни - позволяет фильтровать события по уровню/уровням. Выберите уровень/уровни из списка.

source: Types - Allows selecting events by types. Choose the type/types from the drop-down list.
ru: Типы - позволяет отобрать события по типу/типам. Выберите тип/типы из списка.

source: An Administrator has an additional filtering parameter - accounts.
ru: Администратору доступен дополнительный параметр фильтрации - аккаунты.

source: Use the search tool to find an event by keywords or a part of a word.
ru: Воспользуйтесь поиском, чтобы быстро найти событие в списке по ключевому слову или части слова.
