Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-Images.po
Languages: ru

source: Images
ru: Образы

source: In the *Virtual Machines* -> *Images* section, you can manage Templates and ISO files that are used as installation sources for VMs.
ru: В разделе *Виртуальные машины* -> *Образы* можно управлять шаблонами и файлами ISO, используемыми с качестве источников установки виртуальных машин.

source: A template is a reusable configuration for virtual machines. When users create a VM, they can choose from a list of templates. Administrators and users can create new templates and add them to CloudStack.
ru: Шаблон представляет собой повторно используемую конфигурацию для виртуальных машин. При создании машины шаблон выбирается из списка доступных шаблонов в качестве источника установки. Новые шаблоны могут быть созданы и добавлены в список Администраторами или пользователями CloudStack.

source: ISO files are another installation source for virtual machines.
ru: Еще одним типом источника установки являются файлы ISO.

source: You can switch from Templates to ISOs by selecting a corresponding option above:
ru: Список можно переключить с шаблонов на ISO, выбрав соответствующую опцию вверху:

source: Images List
ru: Список образов

source: Existing templates/ISOs are presented in the list in the "Images" section. A user can see the templates/ISOs belonging to his/her user only. Domain Administrator can see templates/ISOs of all users in the domain but cannot perform actions on other users' templates.
ru: Шаблоны/ISO, существующие в системе, представлены в виде списка в разделе *Образы*. Пользователь видит только те шаборны/ISO, которые принадлежат его/ее пользователю. Доменный Администратор может видеть шаблоны/ISO всех пользователей в домене, но не может выполнять действия над шаблонами/ISO других пользователей.

source: You can switch the list view of templates/ISOs to the box view using the view button |view box icon| in the upper-right corner.
ru: Шаблоны/ISO могут отображаться в виде списка или карточек. Переключить отображение можно нажатием на |view box icon| в правом верхнем углу.

source: For each template/ISO in the list, you can see its name, OS family, description. The Actions button |actions icon| expands the list of actions. Actions are available to those templates/ISOs that belong to your user only (corresponding to "My" type). Administrators can see templates/ISOs of all users in the domain, but cannot manage them.
ru: Для каждого шаблона/ISO в списке отображается его название, семейство ОС, описание. С помощью кнопки |actions icon| можно раскрыть список действий. Список действий доступен только для тех шаблонов/ISO, которые принадлежат пользователю (соответствующие типу "Мои").

source: Filtering of Images
ru: Фильтрация образов

source: The list of templates/ISOs can be filtered using the filtering tool. The filtering parameters are as follows:
ru: Список шаблонов/ISO можно фильтровать по следующим параметрам:

source: Accounts (for Domain Administrators);
ru: Аккаунты (для Администраторов);

source: OS families;
ru: ОС;

source: Types of templates/ISO:
ru: Типы:

source: My - for user's templates or ISOs (Private),
ru: Мои - для сортировки шаблонов/ISO пользователя;

source: Featured - for templates marked by an Administrator as most prominent for users to select,
ru: Рекомендуемые - для шаблонов/ISO, отмеченных как наиболее рекомендованные для использования;

source: Community - for templates accessible to all users of this CloudStack installation (Public);
ru: Сообщество - для шаблонов/ISO, доступных для всех пользователей установки CloudStack.

source: Zones.
ru: Зоны.

source: Besides, you can adjust the list view using the grouping tool. Templates/ISOs can be grouped by zones or/and groups. Administrators can group the list by accounts.
ru: Кроме этого, можно группировать список по зонам и/или группам. Администраторы могут группировать список по аккаунтам.

source: Use the search tool to easily find a template/ISO by its name or by a part of the name.
ru: Используйте инструмент поиска для быстрого поиска нужного шаблона/ISO в списке по его названию или части названия.

source: Create Template
ru: Создание шаблона

source: There is a variety of ways to add more templates to the system. In the :ref:`VM_Info` section, we have described one way of template creation from a VM volume snapshot in the "Storage" tab of the VM information sidebar (see :ref:`Actions_on_Snapshots`). From the :ref:`Storage_Info` of the "Storage" section, you also can create a template on the base of the volume snapshot (see :ref:`Actions_on_Snapshot_Volume`).
ru: Шаблоны можно добавить в систему несколькими способами. В разделе :ref:`VM_Info` упоминался способ создания шаблона из снимка диска виртуальной машины во вкладке "Диски" информационной панели (см. :ref:`Actions_on_Snapshots`). Также, создать шаблон можно на основе снимка диска из информационной панели диска (см. :ref:`Storage_Info`).

source: One more way to create a new template is filling in the form in the *Images* section by clicking "Create" |create icon| in the bottom-right corner.
ru: Еще одним способом создания нового шаблона является заполнение формы создания шаблона в разделе *Образы*. Открыть форму можно, нажав "Создать" |create icon| в правом нижнем углу.

source: It will open a creation form where you should specify the following information:
ru: В форме следует заполнить следующие поля:

source: Required fields are marked with an asterisk (*).
ru: Обязательные поля отмечены "звездочкой" (*).

source: Name * - Enter a name for the new template.
ru: Название * - введите название нового шаблона.

source: Description * - Provide a short description to have a general idea about the template.
ru: Описание * - дайте краткое описание, чтобы иметь общее представление о шаблоне.

source: URL * - Specify a valid URL of the template file.
ru: URL * - введите URL файла шаблона.

source: OS type * - This helps CloudStack and the hypervisor perform certain operations and make assumptions that improve the VM performance. Select from the drop-down list the necessary option, or select "Other" if there is no needed option in the list.
ru: Тип ОС * - выберите из ниспадающего списка нужную опцию, или выберите "Другое", если в списке нет нужной опции.

source: Zone * - Choose the zone where you want the template to be available.
ru: Зона * - выберите зону, в которой шаблон будет доступен.

source: Group - Select a group from the drop-down list. The list of groups is managed by Administrator in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#image-groups>`_. The group assigned to a template is saved to template tags with the ``csui.template.group`` tag. The group can be edited or deleted from the :ref:`Image_Details` from the "Template" tab or by editing or deleting the corresponding tag in the "Tags" tab.
ru: Группа - выберите группу из ниспадающего списка. Список групп управляется Администратором через `конфигурационный файл <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#image-groups>`_. Группа, указанная для шаблона, сохраняется в теги шаблона с тегом ``csui.template.group``. Группу можно редактировать или удалить из вкладки "Шаблон" информационной панели (см. :ref:`Image_Details`) или путем редактирования или удаления тега во вкладке "Теги".

source: Password enabled checkbox - Tick this option if your template has the CloudStack password change script installed. That means the VM created on the base of this template will be accessed by a password, and this password can be reset.
ru: Пароль включен - активируйте данную опцию, если для шаблона установлен скрипт изменения пароля CloudStack. Это значит, что доступ к машине, созданной на основе данного шаблона, будет ограничен паролем. Пароль можно будет изменять.

source: Dynamically scalable checkbox - Tick this option if the template contains XS/VM Ware tools to support dynamic scaling of VM CPU/memory.
ru: Динамическое масштабирование - активируйте данную опцию, если шаблон содержит инструмент XS/VM Ware для поддержки динамического масштабирования CPU/памяти машины.

source: "Show additional fields" allows expanding the form and set more settings:
ru: "Показать дополнительные параметры" позволяет развернуть форму и задать следующие настройки:

source: Hypervisor - Select a hypervisor from the drop-down list.
ru: Гипервизор - выберите гипервизор из ниспадающего списка.

source: Format - The format of the template upload file, e.g. VHD or RAW or VMDK.
ru: Формат - формат файла шаблона, например VHD или RAW или VMDK.

source: Extractable - Tick this option if the template is available for extraction. If this option is selected, end-users can download a full image of a template.
ru: Извлекаемый - активируйте данную опцию, если шаблон доступен для извлечения. При активации данной опции конечный пользователь может загрузить полный образ шаблона.

source: Requires HVM - Tick this option for creating a template that requires HVM.
ru: HVM - активируйте данную опцию для создания шаблона, который требует HVM.

source: Once all fields are filled in, click "Create" to create the template with these settings. The created template will appear in the list.
ru: Заполнив все поля, нажмите "СОЗДАТЬ" для сохранения шаблона с заданными настройками. Созданный шаблон появится в списке.

source: Click "Cancel" to close the form without template creation. All fields will be cleared.
ru: Или нажмите "ОТМЕНИТЬ", чтобы закрыть форму без сохранения нового шаблона. Поля формы будут очищены.

source: Create ISO
ru: Создание ISO

source: You can create a new ISO file in the *Images* section by clicking "Create" |create icon| in the bottom-right corner.
ru: Вы можете создать новый файл ISO в разделе *Образы*, нажав "Создать" |create icon| в правом нижнем углу. Откроется форма создания ISO, в которой следует заполнить поля:

source: Name * - Enter a name for the new ISO file.
ru: Название * - введите имя нового файла ISO.

source: Description * - Provide a short description to have a general idea about the ISO file.
ru: Описание * - введите краткое описание, чтобы иметь в дальнейшем общее представление о данном файле ISO.

source: URL * - Specify a valid URL of the ISO file.
ru: URL * - укажите URL файла ISO. Тип ОС * - выберите из ниспадающего списка нужную опцию, или выберите "Другое", если в списке нет нужной опции.

source: Zone * - Choose the zone where you want the ISO file to be available.
ru: Зона * - Выберите зону, в которой будет доступен данный файл ISO.

source: Group - Select a group from the drop-down list. The list of groups is managed by Administrator in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#image-groups>`_. The group assigned to ISO is saved to ISO tags with the ``csui.template.group`` tag. The group can be edited or deleted from the :ref:`Image_Details` from the "Template" tab or by editing or deleting the corresponding tag in the "Tags" tab.
ru: Группа - Выберите группу из ниспадающего списка. Список групп управляется Администратором через `конфигурационный файл <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#image-groups>`_. Группа, указанная для шаблона, сохраняется в теги шаблона с тегом ``csui.template.group``. Группу можно редактировать или удалить из вкладки "Шаблон" информационной панели (см. :ref:`Image_Details`) или путем редактирования или удаления тега во вкладке "Теги". "Показать дополнительные параметры" позволяет развернуть форму и задать следующие настройки:

source: Extractable - Tick this option if the ISO file is available for extraction. If this option is selected, end-users can download a full image of an ISO file.
ru: Извлекаемый - активируйте данную опцию, если файл ISO доступен для извлечения. При выборе данной опции конечный пользователь может загрузить полный образ файла ISO.

source: Bootable - Tick this option to indicate whether the machine can be booted using this ISO.
ru: Загружаемый - активируйте данную опцию, чтобы обозначить, что машину, использующую данный ISO, можно загрузить.

source: Once all fields are filled in, click "CREATE" to create the ISO file with these settings. The created ISO file will appear in the list.
ru: Заполнив все поля, нажмите "СОЗДАТЬ" для сохранения файла ISO с заданными настройками.

source: Click "CANCEL" to close the form without ISO creation. All fields will be cleared.
ru: Или нажмите "ОТМЕНИТЬ", чтобы закрыть форму без сохранения нового ISO. Поля формы будут очищены.

source: The created ISO will appear in the list.
ru: Созданный ISO появится в списке.

source: Template/ISO Details Sidebar
ru: Информационная панель шаблона/ISO

source: The information on each template/ISO is presented in the sidebar to the right. It is opened by clicking the template/ISO card or line in the list. The information is presented here in 3 tabs. Above the tabs you can see the template/ISO general information:
ru: Информация по каждому шаблону/ISO представлена в информационной панели справа. Она открывается кликом на шаблон/ISO в списке. Информация представлена в трех вкладках: Шаблон, Зоны, Теги. Вверху над вкладками представлена общая информация о шаблоне/ISO:

source: Name - Template/ISO name and symbol,
ru: Название - название шаблона/ISO и иконка,

source: Actions button - Actions list allowing the Delete action.
ru: Список действий - список действий с шаблоном/ISO, позволяющий удалить шаблон/ISO.

source: Template tab:
ru: Вкладка "Шаблон"

source: Description - Template/ISO description provided at its creation.
ru: Описание - описание шаблона/ISO, указанное при его создании.

source: OS - The OS selected for this template/ISO.
ru: OС - ОС, выбранная для шаблона/ISO.

source: General Information - The settings saved for this template/ISO: size, creation date, type, hypervisor, other settings.
ru: Общая информация - настройки, сохраненные для шаблона/ISO: размер, дата создания, тип, гипервизор, другие настройки.

source: Download URL - The URL provided for this template/ISO. Next to it you can see the "Copy" icon |copy icon|. Click it to copy the URL to clipboard and then paste it in the address line.
ru: Ссылка на скачивание - URL, указанная для шаблона/ISO. Рядом расположена кнопка "Копировать" |copy icon|, которая позволяет скопировать URL в буфер обмена и затем вставить ее в адресную строку.

source: Group - Shows the template/ISO group if it is enabled via the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#image-groups>`_. You can change the group by clicking "Edit" |edit icon|. Choose an existing group in the appeared window and click "ASSIGN" to assign the template/ISO to the selected group. You can remove the template/ISO from the group. Select the "Remove from the group <group name>" option and click "REMOVE".
ru: Группа - группа шаблона/ISO. Отображается, если группы заданы для системы через `конфигурационный файл <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#image-groups>`_. Изменить группу можно, кликнув иконку "Редактировать" |edit icon|. Во всплывающем окне выберите одну из существующих групп в списке и нажмите "ПРИСОЕДИНИТЬ". В этом же окне можно удалить шаблон/ISO из группы. Выберите "Удалить из группы <название группы>" и нажмите "УДАЛИТЬ".

source: Zones tab - Shows the zone where the template/ISO is available. If the zone has "Yes" for the *Ready* status, the template/ISO can be used for VM creation.
ru: Вкладка "Зоны" - отображает название зоны, в которой доступен шаблон/ISO. Если статус шаблона/ISO в зоне *Готов*, шаблон/ISO можно использовать для создания виртуальной машины.

source: Tags tab - Presents the list of tags assigned to the template/ISO.
ru: Вкладка "Теги" - предоставляет список тегов шаблона/ISO.

source: Tags can be system or non-system. System tags are used to provide the functionality from the user interface perspective. Changing these tags affects the functionality of the application. The "Show system tags" checkbox allows to view or hide system tags of the template. Hiding system tags helps to avoid accidental unwanted changes. If a user has disabled displaying of these tags, the system will remember it and next time tags will also be hidden. Uncheck the "Show system tags" checkbox to hide system tags from the list.
ru: Теги могут быть системными и несистемными. Системные теги обеспечивают дополнительную функциональность с точки зрения пользовательского интерфейса. Изменение этих тегов может затронуть работу всего приложения. Можно включить или выключить отображение системных тегов с помощью опции "Показывать системные теги". При выключении данной опции системные теги будут скрыты из списка, что поможет избежать случайных нежелательных изменений в них. Система запомнит, что отображение системных тегов отключено, и в дальнейшем системные теги не будут отображаться в списке.

source: The following system tags can be used for templates/ISOs:
ru: Для шаблонов/ISO используются следующие системные теги:

source: ``csui.template.group`` - Used to assign a template/ISO to a group.
ru: ``csui.template.group`` - используется для присвоения группы шаблону/ISO.

source: ``csui.template.download-url`` - Used for URL, if any provided for the template/ISO.
ru: ``csui.template.download-url`` - используется для URL, если она указана для шаблона/ISO.

source: Please, see the `list of tags <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_ to find system tags that can be used for a template/ISO.
ru: См. полный `список тегов <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_ , используемых в системе.

source: To find the tag you are interested in, please, use the search tool above the tag list. You can enter a name or a part of the tag name to distinguish it in the list.
ru: Для быстрого поиска тега в списке воспользуйтесь инструментом поиска вверху. Введите название или часть названия тега, и оно будет выделено в списке.

source: To add a tag for the template/ISO click "Create" |create icon|. In the appeared form enter:
ru: Для добавления тега к шаблону/ISO нажмите "Создать" |create icon|. В появившейся форме введите:

source: Key *
ru: Ключ *

source: Value *
ru: Значение *

source: Required fields are marked with an asterisk (*). The values in the fields cannot start with a space.
ru: Обязательные поля отмечены "звездочкой" (*). Значения в полях не могут начинаться с пробела.

source: Click "Create" to assign a new tag to the template/ISO.
ru: Нажмите "СОЗДАТЬ" для добавления нового тега к шаблону/ISO.

source: When adding a system tag, click "+" in the card to open the creation form. You will see that the ``csui`` prefix is automatically prepopulated here.
ru: При добавлении системного тега нажмите "+" в карточке. Префикс ``csui`` будет автоматически задан в форме создания тега.

source: If you create a non-system tag, it will be saved in a new card. If you have entered a key in the format ``<prefix>.<example>``, a card will be named as "<prefix>". When creating a new tag from this card, click "+" in the card and in the tag creation form the *Key* field will be prepopulated with the <prefix>.
ru: При создании несистемного тега он будет сохранен в отдельную карточку. При введении ключа в формате ``<prefix>.<example>``, название карточки сохранится как "<prefix>". Для создания нового тега из данной карточки, нажмите "+" в карточке, и в поле "Ключ" в форме создания будет предзадан указанный <prefix>.

source: Tags can be edited or/and deleted. Mouse over the tag in the list and see "Edit" and "Delete" buttons.
ru: Управление тегами включает в себя редактирование и/или удаление. Наведите мышью на тег в списке, и рядом с названием тега появятся кнопки "Редактировать" и "Удалить".

source: Click "Edit" to change the tag's key or value in the appeared form. Save the edits.
ru: Нажмите "Редактировать" для изменения ключа или значения тега. Введите изменения в соответствующие поля и сохраните их.

source: Click "Delete" to delete the tag from the list for this template. Confirm your action in the dialog window. Make sure the tag disappeared from the list of assigned tags.
ru: Нажмите "Удалить" для удаления тега из списка тегов. Подтвердите свое действие в диалоговом окне. Тег будет удален из списка.

source: Template/ISO Action Box
ru: Список действий с шаблоном/ISO

source: By clicking "Actions" |actions icon| you can expand the list of actions for those templates/ISO that are in the account your user belongs to (corresponding to "My" type). The deleting action is available here.
ru: Кликом на "Список действий" |actions icon| раскрывается список действий для данного шаблона/ISO. Список действий доступен только для шаблонов/ISO, принадлежащих аккаунту, в котором состоит пользователь (соответствующих типу "Мои"). В списке доступно действие удаления.

source: Click "Delete" to delete the template/ISO and then confirm your action in the dialog window. The template/ISO will be deleted.
ru: Нажмите "Удалить", чтобы удалить шаблон/ISO. Затем подтвердите свое действие и далоговом окне. Шаблон/ISO будет удален.

source: Click "Cancel" to close the window without deleting a template/ISO.
ru: Или нажмите "Отменить". Окно закроется без удаления шаблона/ISO.
