Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-VirtualMachines.po
Languages: ru

source: Virtual Machines
ru: Виртуальные машины

source: *Virtual Machines* is the starting section. Here and in all other views we have implemented a “one-step” approach, and we also made it work without moving from view to view. So all actions on VMs can be managed from one screen view.
ru: Это первый раздел, который видит пользователь при входе в систему. Здесь и во всех других вкладках мы осуществили подход “одного шага”, без необходимости переключаться между разделами. Таким образом, все действия с ВМ могут быть произведены с одной панели.

source: In this section you can perform actions over a VM that is create, start, stop, delete it. Besides, here you can configure the machine editing its service offering parameters, group, firewall rules. Finally, you can access a VM selecting the most appropriate way. We support three options for accessing a VM: via the console, SSH or HTTP.
ru: В этом разделе можно управлять машинами - создавать, запускать, останавливать, удалять их. Кроме того, здесь можно изменять настройки машины, такие как параметры вычислительного предложения, группу, правила брандмауэра. Наконец, можно получить доступ к ВМ одним из удобных для вас способов: через консоль, SSH или HTTP.

source: Below you will find the detailed information on the aforementioned options for VM management via CloudStack-UI.
ru: Ниже представлена подробная информация по вышеупомянутым аспектам управления машинами через CloudStack-UI.

source: Virtual Machines List
ru: Список виртуальных машин

source: At this page, you can see the list of your virtual machines available to your user only.
ru: На этой странице Вы видите список виртуальных машин, доступных только Вашему пользователю.

source: If you are a Domain Administrator you can see the virtual machines of all users in the domain.
ru: Администратор домена может видеть виртуальные машины всех пользователей в домене.

source: You can change the data representation of existing virtual machines from "card" to "list". We have added the switch |view icon|/|box icon| in the upper-right corner of each section. This improvement gives a user an opportunity to work with data in each specific section in a more convenient way.
ru: Вы можете просматривать список существующих виртуальных машин в виде "карточек", или изменить вид списка на "список". Мы добавили переключатель |view icon| / |box icon| в верхнем правом углу каждого раздела. Это улучшение дает пользователю возможность работать с данными в каждом определенном разделе более удобным способом.

source: A list view can be switched to a box view:
ru: Режим списка можно изменить на "карточки":

source: And vice versa, switch a list view to a box view:
ru: Или наоборот, переключите карточки на список:

source: For each VM in the list you can see the following information:
ru: В списке существующих виртуальных машин для каждой машины отображается следующая информация:

source: VM name and IP;
ru: Имя ВМ и IP;

source: State - shows the VM state by color spot: green for Running, red for Stopped, yellow for changing status;
ru: Статус — показывает статус машины цветом: зеленый - запущена, красный - остановлена, желтый — изменение статуса;

source: OS family;
ru: OС;

source: CPU;
ru: ЦП;

source: RAM;
ru: ОЗУ;

source: Disks.
ru: Диски.

source: To the right the Actions button |actions icon| expands the list of actions available for the VM.
ru: Справа под кнопкой Действия |actions icon| можно посмотреть список действий доступных для ВМ.

source: Filtering of Virtual Machines
ru: Фильтрация виртуальных машин

source: The filtering and search tool will help you to find a virtual machine in the list.
ru: Инструмент фильтрации и поиска поможет Вам найти виртуальную машину в списке.

source: You can filter the VM list by accounts (available for Domain Administrators) and/or zones and/or groups and/or states. In the drop-down lists tick the filtering parameters and see the immediate result.
ru: Вы можете отфильтровать список ВМ по аккаунтам (доступно для Администратора Домена) и/или по зонам и/или по группам и/или по статусу. В выпадающих списках отметьте необходимые параметры фильтрации. Список будет мгновенно отсортирован/отфильтрован.

source: Besides, VMs can be grouped by zones and/or groups and/or colors and/or accounts. Grouping makes it easier to identify necessary VMs on the list.
ru: Кроме того, ВМ могут быть сгруппированы по зонам и/или группам и/или цветам и/или аккаунтам. Группировка позволяет быстро определить необходимую ВМ в списке.

source: Use the search tool to find a virtual machine by its name or a part of the name.
ru: Воспользуйтесь поиском, чтобы найти виртуальную машину по ее имени или части имени.

source: Under the *Virtual Machines* section, you can open a form to create a new virtual machine.
ru: Внизу раздела *Виртуальные машины* Вы можете открыть форму создания новой виртуальной машины.

source: Create a Virtual Machine
ru: Создание виртуальной машины

source: Creating a new VM in CloudStack-UI is a one-step action. You can select options from one screen without additional steps.
ru: Виртуальная машина в CloudStack-UI создается в один шаг. Выбор опций осуществляется из одного окна без дополнительных переходов в другие разделы.

source: Please, note that a virtual machine is created with a root disk so you do not need to add any volume at the VM creation step. If necessary, you can add a data disk to the VM later.
ru: Следует помнить, что виртуальная машина создается с root-диском, поэтому дополнительно выбирать диск при создании машины не нужно. При необходимости позднее можно добавить к машине диск данных.

source: To create a new VM click the "Create" button |create icon| at the bottom-right corner.
ru: Для создания виртуальной машины кликните "Создать" |create icon| в нижнем правом углу.

source: The *New virtual machine* form contains three tabs: *General*, *Advanced* and *VM UserData*.
ru: В форме создания ВМ вы увидите вкладки: *Основные*, *Дополнительные* и *UserData ВМ*.

source: In the *General* tab the following fields should be filled in:
ru: Во вкладке *Основные* заполните следующие поля:

source: Required fields are marked with an asterisk (*).
ru: Обязательные поля отмечены "звездочкой" (*).

source: **VM display name** * - A name of VM that will be displayed in the machine list and in any other interface place (except VM details). You can define here any VM name you wish.
ru: **Отображаемое имя** * — имя машины, которое будет отображаться в списке машин и во всех местах интерфейса (кроме деталей ВМ) . Допустимо любое имя ВМ.

source: **Zone** * - A zone of VM operation. Select a zone from the drop-down list. The list of available zones is managed by a Root Administrator. More information about zones in CloudStack can be found in the `official documentation <http://docs.cloudstack.apache.org/en/4.11.1.0/conceptsandterminology/concepts.html#about-zones>`_.
ru: **Зона** * — зона, в которой доступна ВМ. Выберите зону из ниспадающего списка. Список доступных зон конфигурируется Администратором. Больше информации о зонах вы найдете в `официальной документации <http://docs.cloudstack.apache.org/en/latest/concepts.html?highlight=zone#about-zones>`_.

source: **Service offerings** * - Select a set of options and resources for a VM, such as templates for creating virtual machines, disk storage, and other. In the block of the form, a default service offering displays if it is specified in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-compute-offering>`_.
ru: **Вычислительное предложение** * - набор опций и ресурсов, из которых пользователь может выбирать, например, шаблоны для создания ВМ, дисковое пространство, др. В блоке отображается предложение, заданное по умолчанию через `конфигурационный файл <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-compute-offering>`_ (если задано).

source: Click "SELECT" in the Service Offerings block and choose any other option you wish in the modal window.
ru: Кликните "ВЫБРАТЬ" в блоке "Вычислительные предложения" и выберите в открывшемся окне необходимую опцию.

source: The list of available service offerings is managed by an Administrator. Service offering availability is determined by zone in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#service-offering-availability>`_. Service offerings are devided into two lists: Fixed and Custom.
ru: Список доступных ресурсов конфигурируется Администратором. Доступные вычислительные предложения определяются той зоной, которая задана в `конфигурационном файле <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#service-offering-availability>`_. Вычислительные предложения представлены в двух отдельных списках в зависимости от их типа: Фиксированные и Настраиваемые.

source: *Fixed* service offerings are the offerings with fixed parameters. They can not be changed.
ru: *Фиксированные* предложения - это предложения с фиксированными параметрами, которые нельзя редактировать.

source: *Custom* service offerings are offerings with adjustable parameters. You can set the amount of CPU cores, CPU memory and Network rate as you need.
ru: *Настраиваемые* вычислительным предложения - это предложения с настраиваемыми параметрами. Для них есть возможность задать нужное количество ядер ЦП, размеры CPU, памяти, скорость сети.

source: By default, the dialog box opens at a list the default service offering belongs to (if it is defined in the configuration file). If no default offering is defined, the *Fixed* list opens first. If there are no offerings in the *Fixed* list, the *Custom* list of offerings opens first. If there are no available service offerings in either of the lists, you will see a notification.
ru: Если в конфигурационном файле задано вычислительное предложение по умолчанию, то при открытии модального окна в форме будет автоматически выбрано заданное вычислительное предложение. Если вычислительное предложение не задано по умолчанию, модальное окно откроется на вкладке *Фиксированные*. Если нет ни одного предложения в категории *Фиксированные*, модальное окно автоматически откроется на вкладке *Настраиваемые*. Если нет ни одного предложения ни в одном из списков, пользователь увидит оповещение.

source: Use the switcher "Fixed/Custom" above the list to select a necessary type of offerings.
ru: Для переключения между списками предложения разных типов используйте переключатель вверху списка.

source: If service offering classes are determined in the configuration file (see the `configuration guide <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#compute-offering-classes>`_), the list of service offerings is displayed as a list grouped by the determined classes. You can filter the list by classes using the filtering tool above the list. Classes provide additional semantics defining the purpose of VM.
ru: Если в конфигурационном файле определены классы вычислительных предложений (см. `раздел <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#compute-offering-classes>`_ руководства по конфигурациям), вычислительные предложения в списке будут сгруппированы по заданным классам. В таком случае для списка можно использовать фильтрацию по классам. Блок фильтрации находится над списком предложений. Добавление классов позволяет применить дополнительную семантику в наименовании машин.

source: You also can use the search tool to find an option in the list by a name or a part of the name.
ru: Также, возможно применения поиска к списку предложений. Введите название или его часть в поле поиска над списком предложений, чтобы быстро найти в списке нужную опцию.

source: **Fixed Service Offerings**
ru: **Фиксированные вычислительные предложения**

source: For fixed service offerings the parameters are provided in the table per each option. Four main parameters are provided by default. They are:
ru: В списке фиксированных вычислительных предложений для каждого предложения в таблице приводятся параметры. По умолчанию представлены следующие параметры:

source: CPU Cores;
ru: Ядра CPU;

source: Memory (MB);
ru: Память (MB);

source: Network Rate (Mb/s).
ru: Скорость сети (Mb/s).

source: Click "SHOW DETAILS" to the right to expand the range of parameters. Scroll the table to right and you will see:
ru: Нажав "ПОКАЗАТЬ ДЕТАЛИ" внизу списка Вы расширите список параметров в таблице. Воспользуйтесь "бегунком" для передвижения вправо по таблице, где представлены следующие дополнительные параметры:

source: Disk read rate (Mb/s);
ru: Скорость чтения (Mb/s);

source: Disk write rate (Mb/s);
ru: Скорость записи (Mb/s);

source: Disk read rate (IO/s);
ru: Скорость чтения (IO/s);

source: Disk write rate (IO/s).
ru: Скорость записи (IO/s).

source: You can hide the additional parameters by clicking "HIDE DETAILS".
ru: Чтобы скрыть дополнительные параметры, нажмите "СКРЫТЬ ДЕТАЛИ" внизу списка.

source: Choose the option in the list and click "SELECT" below.
ru: Выберите в списке нужное предложение и нажмите "ВЫБРАТЬ" внизу списка.

source: The settings will appear for the VM service offerings.
ru: Выбранные настройки появятся в блоке "Вычислительные предложения" для создаваемой машины.

source: **Custom Service Offerings**
ru: **Настраиваемые вычислительные предложения**

source: For custom service offerings the parameters are also provided in the table per each option. Besides, you can see more parameters by clicking "SHOW DETAILS".
ru: В списке настраиваемых вычислительных предложений для каждого предложения также представлены параметры. Можно расширить список параметров, нажав "Показать детали" внизу списка.

source: By selecting an option in the list, you open a modal window where you can set values for the following parameters:
ru: При выборе одного из вариантов предложений в списке откроется модальное окно, в котором для каждого параметра можно задать значение:

source: Memory (MB).
ru: Память (MB);

source: These parameters can be predefined in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-compute-offering>`_ by an Administrator. The values specified there will be used as default parameters for a custom service offering.
ru: Значения для данных параметров могуть быть предзаданы Администратором в `конфигурационном файле <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-compute-offering>`_ . Они будут использоваться по умолчанию для настраиваемых вычислительных предложений.

source: Administrators can set limits for custom service offering parameters in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#custom-compute-offering-parameters>`_. That means you cannot set values larger than the limits specified for custom service offerings.
ru: Также, в конфигурационном файле Администратором могут быть заданы лимиты для параметров предложений (см. `раздел <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#custom-compute-offering-parameters>`_). Т.е. при определении значений параметров предложений нельзя будет указать значения, превышающие заданные лимиты.

source: Besides, the system checks the available account resources. And if you try to enter a value larger than the available amount of resources, the system will automatically change it to the maximum available value.
ru: Кроме того, система проверяет доступные ресурсы аккаунта. При попытке ввести значение, превышающее доступное количество ресурсов, система автоматически изменит его на максимально допустимое.

source: Click "CONFIRM" to set the custom service offering parameters. The modal window will close and the set values will appear in the list for the selected custom service offerings option. Click "CANCEL" to drop all the settings.
ru: Когда параметры заданы, нажмите "ПРИНЯТЬ" для сохранения заданных параметров. Они появятся в списке параметров настраиваемых предложений для выбранного варианта. Или нажмите "ОТМЕНИТЬ" для отмены сохранения заданных вариантов.

source: Click "SELECT" below the list to assign a selected service offering to your machine. The custom settings will appear for the VM service offerings. Custom service offering parameters are saved to account tags (see the `list of tags <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_) if they are supported for the account. This will make it easier for you to use saved custom parameters for service offerings next time at VM creation as they will be predefined in the form automatically.
ru: Нажмите "ВЫБРАТЬ" внизу списка для присоединения выбранного вычислительного предложения к создаваемой машине. Настроенные параметры будут отображаться в блоке "Вычислительные предложения" в форме создания ВМ. Параметры настраиваемых вычислительных предложений сохраняются в теги аккаунта (см. `список тегов <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_), если данные теги активированы для аккаунта. Это значительно упрощает использование сохраненных параметров настраиваемых предложений в дальнейшем при создании ВМ, т.к. они будут автоматически предзаданы в форме создания ВМ.

source: The system checks the amount of available account resources. In case a selected service offering does not fit the amount of available account resources, a warning message will appear saying the offering cannot be selected.
ru: Система проверяет количество доступных ресурсов аккаунта. В случае, если выбранное вычислительное предложение не подходит по количеству доступных ресурсов, появится предупреждение о том, что данное предложение недоступно для выбора.

source: **Installation source** * - Select an installation source - a Template or an ISO file - that will be used to create the machine from. In the block you can see the installation source selected by default. Click "Select" to choose an installation source you wish. In a modal window you will see a list of templates/ISOs with the "Ready" status available for the selected zone as well as for user's account or the whole domain.
ru: **Источник установки** * — Выберите способ установки ВМ, нажав "ВЫБРАТЬ". Обычно ВМ создают двумя способами: на основе шаблона или ISO файла. В блоке отображается выбранный по умолчанию источник установки. Чтобы изменить его на другой, нажмите "ВЫБРАТЬ" в блоке. В открывшемся модальном окне появится список шаблонов/ISO со статусом "Готов". Доступные шаблоны/ISO представлены в разных списках. Откройте нужный, используя переключатель сверху. Список доступных источников зависит от выбранной зоны и аккаунта пользователя.

source: The filtering tool allows finding a necessary option by selecting among templates/ISOs by OS families, types and groups, or search the source by a name or a part of its name.
ru: Инструмент фильтрации позволяет найти необходимую опцию среди шаблонов/ISO по семьям OS, типам и группам, или по названию или его части.

source: Tick the source in the list and click "SELECT" to implement the selected source.
ru: Отметьте источник в списке и нажмите "ВЫБРАТЬ", чтобы применить выбранный источник к ВМ.

source: Click "CANCEL" to drop selected options. No source will be selected then.
ru: Нажмите "Отменить", чтоб сбросить все опции. Тогда источник не будет выбран.

source: The Disk size slider below the **Installation source** block allows changing the size of a root-disk of the VM. The default minimum size is determined by the account limits and shown in the number field. Move the slider or enter a number value in the field to set the root-disk size.
ru: Ниже блока "Источник установки" находится "бегунок", который позволяет изменить размер root-диска. Передвиньте "бегунок" или введите значение в числовое поле, чтобы задать нужный размер root-диска.

source: **Disk offering** - Available if ISO is selected as a source. Here you can see a disk offering preselected for the machine. To choose another disk offering open a modal window by clicking "SELECT" in the disk offering section and choose a disk offering in the list of available disk offerings. The list of available options is managed by an Administrator. Disk offering availability is determined by the zone defined in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#service-offering-availability>`_.
ru: **Дисковое предложение** * — Данная опция доступна при создании ВМ из ISO. Откройте список доступных дисковых предложений, нажав "ВЫБРАТЬ" в блоке дисковых предложений. Список доступных дисковых предложений задается Администратором. Доступность дисковых предложений определяется той зоной, которая задана в конфигурационном файле (см. `раздел <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#service-offering-availability>`_).

source: For each disk offering you can expand detailed information by clicking the arrow icon or the whole line in the list. In the appeared section you will see a range of parameters. The following parameters are shown by default:
ru: Для каждого предложения в списке можно развернуть подробную информацию, кликнув на строку или стрелку напротив предложения. В открывшемся блоке представлены следующие параметры:

source: Bandwidth (MB/s): Read/Write rates;
ru: Скорость чтения и записи (МБайт/сек);

source: IOPS: Read/Write rates and Min/Max values;
ru: IOPS: Чтение/Запись (IO/сек) и значения Min/Max;

source: Storage type;
ru: Тип хранилища;

source: Provisioning type;
ru: Выделение ёмкости;

source: Creation date.
ru: Дата создания.

source: Use the scrolling tool to view them all.
ru: Для просмотра полного перечня параметров воспользуйтесь прокруткой справа.

source: More parameters can be added via the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#disk-offering-parameters>`_ by an Administrator. Select a disk offering in the list and click "SELECT".
ru: Администратор может расширить список параметров через конфигурационный файл (см. `руководство по конфигурациям <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#disk-offering-parameters>`_). Выберите дисковое предложение в списке и нажмите "ВЫБРАТЬ".

source: If the selected disk offering has a custom disk size (it is set by Administrator), you can change the disk size. Move the slider up to the volume size you wish.
ru: Если выбранное дисковое предложение имеет настраиваемый размер диска (устанавливается Администратором), появится "бегунок", передвигая который можно изменить размер диска.

source: If you do not have enough account resources, you will not be able to select the disk that does not fit the available amount of resources - an error will display.
ru: Если для выбранного диска недостаточно ресурсов аккаунта, система не позволит выбрать неподходящий по ресурсам диск - появится ошибка.

source: Find more about disk offerings in the `official documentation <http://docs.cloudstack.apache.org/en/4.11.1.0/adminguide/service_offerings.html?highlight=disk%20offerings#compute-and-disk-service-offerings>`_.
ru: Больше информации о дисковом предложении можно найти в `официальной документации <http://docs.cloudstack.apache.org/en/4.11.1.0/adminguide/service_offerings.html?highlight=disk%20offerings#compute-and-disk-service-offerings>`_.

source: In the *Advanced* tab you will find the following fields:
ru: Во вкладке *Дополнительные* следует заполнить следующие поля:
