Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-Accounts.po
Languages: ru

source: Accounts
ru: Аккаунты

source: In the *Accounts* section Administrators can manage accounts and users in them, as well as user settings and activity logs. For an account, details and resource limits can be viewed. Please, note that the account limits are shared by all users in the account. If you are facing the problem of the lack of resources, contact your Administrator. Administrators are able to edit the limits of an account. Besides, they can monitor resource usage having access to the resource statistics for each account.
ru: В разделе *Аккаунты* Администраторы могут управлять аккаунтами, пользователями и пользовательскими настройками, а также просматривать логи об активности пользователей в аккаунте. Для аккаунтов отображается подробная информация и лимит используемых ресурсов. Обратите внимание, что ресурсы аккаунта делят между собой все пользователи этого аккаунта. При недостатке ресурсов свяжитесь с Администратором. Администратор может изменить лимит ресурсов для аккаунта. Кроме того, он может отслеживать расход ресурсов в аккаунте, т.к. он имеет доступ к статистике ресурсов каждого аккаунта.

source: Administrators can see the list of accounts for the whole domain. They can create new users for an account, edit or delete a user.
ru: Администраторы видят все аккаунты в домене. Они могут создавать новых пользователей в аккаунте и управлять ими.

source: If you are a User, you can view but not manage your account and users in it. For each user in the account, you can see the settings.
ru: Пользователь может видеть аккаунт, которому он принадлежит, и других пользователей в нем, но не может управлять ими. Для каждого пользователя в аккаунте доступны настройки.

source: Account List
ru: Список аккаунтов

source: Clicking *Accounts* in the left-side navigation bar you open the *Accounts* section. It presents the list of accounts. Administrators can see accounts for the whole domain. A user can see his/her account only, that is the account his/her user belongs to.
ru: Раздел *Аккаунты* открывается кликом на *Аккаунты* в навигационной панели слева. В нем представлен список аккаунтов, существующих в домене. Администраторы видят все аккаунты в домене. Пользователь может видеть только свой аккаунт, т.е. аккаунт, которому он принадлежит.

source: You can switch the view from list to box using the switch tool |view icon|/|box icon| in the upper-right corner.
ru: Отображение аккаунтов можно переключить со списка на карточки, используя переключатель |view icon|/|box icon| справа.

source: For each account in the list you can see the following information:
ru: Для каждого аккаунта в списке отображается следующая информация:

source: Account name;
ru: Название аккаунта;

source: State - Shows the account state by color spot: green for Enabled, red for Disabled statuses;
ru: Статус - цветовая метка показывает статус аккаунта: зеленая - "Активирован", красная - "Деактивирован";

source: Role - A role assigned to the account - Root Administrator, Resource Administrator, Domain Administrator, User. Find more information on roles in CloudStack in the `official documentation <http://docs.cloudstack.apache.org/en/4.11.1.0/adminguide/accounts.html#roles>`_.
ru: Роль - роль аккаунта - Администратор, Администратор ресурсов, Доменный администратор, Пользователь. См. подробнее о ролях в CloudStack в `официальной документации <http://docs.cloudstack.apache.org/projects/cloudstack-administration/en/4.9/accounts.html>`_.

source: Role type - A role type connected to the role.
ru: Тип роли - тип роли для заданной роли.

source: Domain - The domain which the account belongs to.
ru: Домен - домен, которому принадлежит аккаунт.

source: Action list - Allows an Administrator to manage the account - to disable or delete it. Find more details at :ref:`Account_Action_Box`.
ru: Список действий - позволяет Администратору управлять аккаунтом: деактивировать его или удалить. Подробнее см. раздел :ref:`Account_Action_Box`.

source: Filtering of Accounts
ru: Фильтрация аккаунтов

source: If you are an Administrator, filtering and search tools will help you to find an account in the list.
ru: Инструмент фильтрации и поиска позволяет быстро найти нужный аккаунт в списке.

source: You can filter the list by:
ru: Доступна фильтрация по следующим параметрам:

source: Domains - Select a domain/domains available to you from the drop-down list.
ru: Домены - выберите домен/домены из списка.

source: Roles - Select a role - Root Administrator, Resource Administrator, Domain Administrator and/or User -from the drop-down list.
ru: Роли - выберите роль из списка - Администратор, Администратор ресурсов, Доменный администратор и/или Пользователь.

source: Role types - Select a role type/types from the drop-down list.
ru: Типы ролей - выберите тип/типы ролей из списка.

source: States - Select a state/states - Enabled and/or Disabled - from the drop-down list.
ru: Статусы - выберите статус/статусы из списка - Активирован и/или Деактивирован.

source: Besides, accounts can be grouped by the parameters mentioned above.
ru: Кроме того, аккаунты можно группировать по параметрам, перечисленным выше.

source: Create an Account
ru: Создание аккаунта

source: An Administrator can create a new account in the domain.
ru: Создание нового аккаунта в домене доступно для Администратора.

source: By clicking "Create" |create icon| in the bottom-right corner you will open a form where the following fields should be completed:
ru: Кликом на "Создать" |create icon| в нижнем правом углу открывается форма создания аккаунта, где необходимо заполнить следующие поля:

source: Required fields are marked with an asterisk (*).
ru: Обязательные поля отмечены "звездочкой" (*).

source: Name * - Enter any desired login ID for the account name. It should be unique within the domain.
ru: Имя аккаунта * - введите желаемое имя аккаунта, уникальное в домене.

source: Email * - Enter the accounts email address.
ru: Email * - введите email аккаунта.

source: Password * - Enter any password you like. You can view the password that you are entering by clicking |view| to the right. Hide the password under dots by clicking |hide|.
ru: Пароль * - введите желаемый пароль. Можно активировать отображение вводимых символов, нажав |view| справа. Спрятать символы вводимого пароля можно кликом на |hide|.

source: First name * - Enter the first name of a person or the first part of the entity represented by the account. It can be a department or a customer.
ru: Имя * - введите имя первого пользователя аккаунта или другого представителя в аккаунте. Это может быть подразделение или контрагент.

source: Last name * - Enter the last name of a person or the second part of the entity represented by the account (a customer or a department).
ru: Фамилия * - введите фамилию пользователя аккаунта или вторую часть названия подразделения или контрагента.

source: Domain * - Select a domain in which the account is to be created.
ru: Домен * - выберите домен, которому будет принадлежать созданный аккаунт.

source: Role * - Select the role for the account.
ru: Роль * - выберите роль для аккаунта из ниспадающего списка.

source: Time zone - Set the time zone that corresponds to the account locale.
ru: Часовой пояс - укажите часовой пояс, соответствующий местоположению, в котором аккаунт будет действовать.

source: Network domain - If you want to assign a special domain name to the account's guest VM network, specify the DNS suffix.
ru: Сетевой домен - если сети гостевой машины аккаунта нужно присвоить имя домена, укажите DNS-суффикс.

source: Click "CREATE" to create the new account. Make sure it has appeared in the list of accounts.
ru: Нажмите "СОЗДАТЬ", чтобы сохранить новый аккаунт. Он должен появиться в списке аккаунтов.

source: A user is created automatically for the new account. User's name corresponds to the first and the last name specified in the account creation form. This user inherits account's email and time zone.
ru: Для нового аккаунта пользователь создается автоматически. Имя пользователя соответствует имени и фамилии, указанным в форме при создании аккаунта. Ему присваиваются email и часовой пояс аккаунта.

source: Click "CANCEL" to leave the account creation form. No account will be created then.
ru: Нажмите "ОТМЕНИТЬ", форма создания аккаунта закроется, аккаунт не будет создан.

source: Account Details Sidebar
ru: Информационная панель аккаунта

source: For each account, the information is available in the details sidebar to the right. Click the account in the list to open the sidebar:
ru: Для каждого аккаунта в информационной панели справа представлена информация. Панель открывается кликом на аккаунт в списке:

source: There are two tabs in the sidebar: General and Users.
ru: Информация в ней представлена в двух вкладках: "Общее" и "Пользователи".

source: The *General* tab contains the general information on the account: details, limits for resources.
ru: Во вкладке "Общее" содержится общая информация по аккаунту: детали, ограничения по ресурсам, статистика использования ресурсов (доступно для Администратора).

source: Administrators can edit the limits. Click "Edit" |edit icon| in the Limits block and change the values right in the block.
ru: Ограничения можно редактировать. Право редактирования ограничений есть у Администраторов. Для редактирования ограничений нужно нажать "Редактировать" |edit icon| в блоке ограничений и изменить значения в полях блока.

source: Administrators can see the statistics on resource usage at the bottom. Refresh the data by clicking |refresh icon|.
ru: Администраторы могут видеть статистику использования ресурсов в блоке ниже. Обновить данные статистики можно кликом на |refresh icon|.

source: The *Users* tab contains the list of users in the account. For each user you can expand the information card where the following information is listed:
ru: Во вкладке "Пользователи" содержится список пользователей в аккаунте. Для каждого пользователя можно развернуть карточку и увидеть данные:

source: Username;
ru: Имя аккаунта;

source: First and Last name;
ru: Имя и фамилия пользователя;

source: Timezone;
ru: Часовой пояс;

source: Secret key - The key generated for a user by clicking "Regenerate key" in the Action box. You can copy it to the buffer by clicking |copy icon|.
ru: Секретный ключ - ключ, создаваемый при применении действия "Сгенерировать ключ" из списка действий. Скопировать ключ в буффер обмена можно, кликнув |copy icon|.

source: API key - The key generated for a user by clicking "Regenerate key" in the Action box. You can copy it to the buffer by clicking |copy icon|.
ru: Ключ API - ключ, создаваемый при применении действия "Сгенерировать ключ" из списка действий. Скопировать ключ в буффер обмена можно, кликнув |copy icon|.

source: An Administrator has a list of actions available for each user. A user can manage his/her user only. A list of actions is available under the |actions icon| button. It contains the following actions:
ru: Для управления пользователем в карточке пользователя доступен список действий. Администратор может управлять всеми пользователями в домене. Пользователь может управлять только своим пользователем. Список действий доступен по клику на |actions icon|. В нем предлагаются следующие действия:

source: Edit user;
ru: Изменить пользователя;

source: Change password;
ru: Изменить пароль;

source: Regenerate key;
ru: Сгенерировать ключ;

source: Delete user (available for Administrators).
ru: Удалить пользователя (доступно для Администратора).

source: Find more about actions for users in the :ref:`User_Action_Box` section.
ru: Подробно о действиях с пользователями см. в разделе :ref:`User_Action_Box`

source: Create a User
ru: Создание пользователя

source: Administrators can create a new user from the *Users* tab of the Account Details sidebar by clicking "Create" |create icon|.
ru: Администраторы могут создать нового пользователя из вкладки "Пользователи" информационной панели аккаунта. Кликните "Создать" |create icon|:

source: In the appeared form fill in the following fields:
ru: В открывшейся форме заполните следующие поля:

source: Required fields are marked with asterisks (*).
ru: Обязательные поля отмечены "звездочкой" (*).

source: Username * - Enter any desired user ID. It should be unique within the domain.
ru: Имя аккаунта * - введите желаемое имя аккаунта, уникальное в домене. Пароль * - введите желаемый пароль. Можно активировать отображение вводимых символов, нажав |view| справа. Спрятать символы вводимого пароля можно кликом на |hide|.

source: First name * - User's first name.
ru: Имя * - введите имя пользователя.

source: Last name * - User's last name.
ru: Фамилия * - введите фамилию пользователя.

source: Email * - Enter the user's email address.
ru: Email * - введите email пользователя.

source: Time zone * - Set the timezone that corresponds to the user's locale. Select an option from the drop-down list.
ru: Часовой пояс * - укажите часовой пояс, соответствующий местоположению, в котором аккаунт будет действовать.

source: Click "CREATE" to create the new user. It will appear in the list of users for this account.
ru: Нажмите "СОЗДАТЬ". Новый пользователь будет добавлен в аккаунт. Он появится в списке пользователей данного аккаунта.

source: Click "CANCEL" to cancel the user creation.
ru: Для отмены создания пользователя нажмите "ОТМЕНИТЬ"

source: User Action Box
ru: Список действий с пользователем

source: Administrators can manage a user via the Action box.
ru: Администраторы могут управлять пользователями посредством выбора нужного действия из списка действий для пользователя.

source: The list of actions allows an Administrator to:
ru: Список действий позволяет Администратору:

source: Edit user - Opens a form to edit user's settings (name, email, timezone). Edit the information and click "SAVE" to save the edits.
ru: Изменить пользователя - при выборе данного действия открывается форма редактирования настроек пользователя (имя, email, часовой пояс). Редактируйте информацию и нажмите "СОХРАНИТЬ", чтобы сохранить изменения.

source: Change password - Opens a modal window with two fields for you to enter a new password and confirm it. Use the view tool |view| to view or hide a password while entering. Click "SAVE" to save the new password.
ru: Изменить пароль - при выборе данного действия открывается модальное окно, где следует ввести желаемый пароль в первом поле и подтвердить его в следующем поле. Воспользуйтесь просмотром |view|, чтобы видеть или скрыть символы пароля. Нажмите "СОХРАНИТЬ" для регистрации нового пароля.

source: Regenerate key - Allows changing the keys - secret and API - for the user. Confirm your action in the dialog window, and the keys will be changed.
ru: Сгенерировать ключ - данное действие позволяет создать или изменить секретный ключ и ключ API для пользователя. Подтвердите свое действие в диалоговом окне, ключи будут сгенерированы/изменены.

source: Delete a user - Allows deleting a user from the system. Confirm your action in the dialog window, and the user will be deleted.
ru: Удалить пользователя - данное действие позволяет удалить пользователя из системы. Подтвердите свое действие в диалоговом окне, и пользователь будет удален.

source: Account Action Box
ru: Список действий с аккаунтом

source: Administrators can manage an account via the Action box under |actions icon|.
ru: Администраторы могут управлять аккаунтами посредством выбора нужного действия из списка действий для аккаунта под |actions icon|. Список действий позволяет Администратору:

source: Disable account - Allows disabling an account. By disabling the account all users for this account will no longer have access to their cloud resources. All running VMs will be immediately shut down. Click "Disable account" and confirm your action in the dialog window. The account will be inactive.
ru: Деактивировать аккаунт - доступно для активированных аккаунтов. Позволяет сделать аккаунт неактивным. При деактивации аккаунта облачные ресурсы всех его пользователей будут недоступны, все запущенные машины будут остановлены. Для деактивации аккаунта нажмите "Деактивировать аккаунт" и подтвердите свое действие в диалоговом окне. Аккаунт будет деактивирован.

source: Enable account - Allows activating a disabled account. Click "Enable account" and confirm your action in the dialog window. The account will be activated.
ru: Активировать аккаунт - доступно для деактивированного аккаунта. Позволяет активировать аккаунт. Для этого нажмите "Активировать аккаунт" и подтвердите свое действие в диалоговом окне. Аккаунт будет активирован.

source: Delete account - Allows an Administrator to delete an account from the system. Confirm your action in the dialog window, and the account will be deleted.
ru: Удалить аккаунт - позволяет удалить аккаунт из системы. Подтвердите свое действие в диалоговом окне, и аккаунт будет удален.
