Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-Firewall.po
Languages: ru

source: Firewall
ru: Брандмауэр

source: The *Virtual Machines* -> *Firewall* section allows managing security groups that are used for isolating traffic to virtual machines.
ru: В разделе *Виртуальные машины* -> *Брандмауэр* пользователь может управлять группами безопасности, которые применяются для изоляции трафика виртуальных машин.

source: Read more about security groups in the `official documentation <http://docs.cloudstack.apache.org/en/4.11.2.0/adminguide/networking/security_groups.html>`_ of CloudStack.
ru: Более подробно о группах безопасности написано в `официальной документации <http://docs.cloudstack.apache.org/en/4.11.2.0/adminguide/networking/security_groups.html>`_ CloudStack

source: In this section, a user can see and manage firewall templates, shared and private security groups.
ru: В данном разделе пользователь может просматривть и управлять шаблонами брандмауэра, разделяемыми и приватными группами безопасности.

source: **Firewall templates** are presets of rules that can be system or custom (that is created by a user). These presets will be used when creating a new security group. Administrators can specify system presets during the interface deployment via the JSON configuration file (find more in the `configurations guide <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#security-group-templates>`_). They will always be available for creation of a new group.
ru: **Шаблоны брандмауэра** представляют собой предзаданные правила безопасности, которые могут быть системными или пользовательскими, созданные отдельными пользователями. Администраторы могут указать в конфигурационном файле JSON системные предустановки, которые будут отображаться по умолчанию (см. подробнее в `руководстве по конфигурациям<https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#security-group-templates>`_). Эти предзаданные правила можно использовать при создании группы безопасности.

source: A custom security group template can be created via the UI. Find more information on how to create a custom security group template at :ref:`Create_FTemplate`.
ru: Пользовательский шаблон группы безопасности можно создать через UI. См. подробнее радел :ref:`Create_FTemplate`.

source: Upon VM creation, a user applies templates (if they exist) to create a new security group for a VM. These rules make a **private security group** used for that virtual machine only. Thus, when a user changes the rules for a certain virtual machine, it does not affect other machines.
ru: При создании ВМ, чтобы создать новую группу безопасности для данной машины, применяются шаблоны (если они есть). Созданная группа является **приватной** и используется только данной конкретной машиной. Впоследствии, если пользователь редактирует правила для конкретной машины, эти изменения не влияют на работу других машин.

source: The second way is to use a **shared security group** for your virtual machine. Shared groups are used by several VMs. Changes of rules in them may affect other VMs.
ru: Также, для виртуальной машины можно использовать **разделяемую группу безопасности**. Разделяемые группы используются несколькими машинами. Изменения правил в них может повлиять на работу других виртуальных машин.

source: A default security group can be defined for the account. It will be preselected for each new virtual machine. Please, read the `configuration guide <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-security-group-name>`_ to find more information on how to set up a default security group.
ru: Для аккаунта можно задать группу безопасности по умолчанию. Она будет автоматически выбрана при создании новой виртуальной машины. Более подробно о том, как задать группу безопасности по умолчанию, написано в `руководстве по конфигурациям <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-security-group-name>`_.

source: Users can manage security group rules in two modes: a "view" mode with filtering by types and protocols and an “edit” mode. Security groups editing is available when switching from "view" mode to "editing" mode. If the group is shared, the user is warned that changes will affect other VMs using this group. This behavior allows avoiding undesirable changes for other VMs.
ru: Пользователи могут управлять группами безопасности в двух режимах: в режиме просмотра и в режиме редактирования, переключение между которыми доступно при просмотре правил группы. При редактировании разделяемой группы безопасности система предупреждает, что изменения могут затронуть работу других машин. Это позволяет избежать нежелательных изменений работы других машин.

source: Templates, shared and private security groups are placed in different tabs of the *Firewall* section. You can switch from templates to shared or private security groups using the tool above the list.
ru: Шаблоны брандмауэра, разделяемые и приватные группы безопасности расположены в разных вкладках раздела *Брандмауэр*. Переключаться между шаблонами и разделяемыми или частными группами безопасности можно с помощью кнопок в верхней части экрана.

source: A user can see security groups of his/her user only. An Administrator can observe security groups of all accounts in the domain.
ru: Пользователь видит только те группы безопасности, которые принадлежат его/ее пользователю. Администратор видит группы безопасности всех аккаунтов в домене.

source: Firewall List
ru: Список групп безопасности

source: The security groups are presented in a list format. You can change the view from list to cards clicking the switch view icon |view icon|/|box icon| in the upper-right corner.
ru: Группы безопасности представлены в виде списка. Формат представления можно изменить со списка на карточки с помощью переключателя |view icon|/|box icon| в правом верхнем углу.

source: To quickly find the security group you need, please, use the search tool above the list. Enter a name or a part of the name of the template/security group and see the immediate result.
ru: Для более быстрого поиска группы в списке используйте инструмент поиска сверху. Введите название группы или его часть, и список будет отфильтрован по заданным параметрам.

source: Administrators can filter the list of templates/shared groups by accounts.
ru: Администраторы могут фильтровать список шаблонов/групп безопасности по аккаунтам.

source: Create a Security Group Template
ru: Создание шаблона группы безопасности

source: You can create your own template. It will be available as a base at a new private security group creation for VM.
ru: Вы можете создать собственный шаблон безопасности, который будет доступен при создании виртуальной машины в качестве основы для приватной группы безопасности.

source: A new security group template is created on the base of existing templates. This security group will be created as a custom template (with a ``custom-template`` type).
ru: Новый шаблон группы безопасности создается на основе существующих шаблонов. Созданная группа будет иметь тип ``custom-template``.

source: If you would like to create a new security group template, click "Create" |create icon| in the bottom-right corner and fill in the form:
ru: Чтобы создать новый шаблон группы безопасности, нажмите "Создать" |create icon| в правом нижнем углу и заполните поля формы:

source: Required fields are marked with an asterisk (*).
ru: Обязательные поля отмечены "звездочкой" (*).

source: Name * - Enter a name for the template.
ru: Название * - введите название шаблона.

source: Description - Provide a short description for the firewall template.
ru: Описание - введите краткое описание шаблона.

source: Basic rules - Click "ADD" to open the list of rules to assign them to the template. In the appeared window select a template in the “All templates” list at the left and move it to the “Selected templates” list at the right by clicking the arrow icon:
ru: Базовые правила - Нажмите "ДОБАВИТЬ", чтобы открыть список правил для добавления их в шаблон. В появившемся окне выберите шаблон из левого списка "Все шаблоны" и переместите его в правый список "Выбранные шаблоны" с помощью "стрелки":

source: Click “SELECT ALL” to move all templates from left to right at once.
ru: Нажмите “ВЫБРАТЬ ВСЕ”, чтобы разом переместить все шаблоны из левого списка в правый.

source: Click “RESET” to drop all selected templates.
ru: Чтобы очистить список выбранных шаблонов, нажмите “СБРОСИТЬ”.

source: In the list below you will see the rules corresponding to the selected templates. All of them are checked as selected. Uncheck those you do not wish to add to your firewall template.
ru: В списке ниже появятся правила, соответствующие выбранным шаблонам. Все правила отмечены в списке как активные. Отключите те, которые Вы не хотите добавлять в шаблон брандмауэра.

source: Click “SAVE” to apply the selected rules to your security group template.
ru: Нажмите “СОХРАНИТЬ” для создания шаблона с выбранными правилами.

source: Click “CANCEL” to drop the selected options. No rules will be assigned to the template. You will return to the “Create a new security group” window.
ru: Чтобы сбросить выбранные настройки, нажмите “ОТМЕНИТЬ”. Правила не будут добавлены в шаблон. Вы вернетесь к форме создания шаблона.

source: When all fields are completed, click "CREATE" to create the new firewall template. The template will appear in the list of firewall templates as *Custom*:
ru: Когда все поля заполнены, нажмите "СОЗДАТЬ", чтобы создать новый шаблон брандмауэра. Шаблон появится в списке шаблонов как *Пользовательский*:

source: Click "CANCEL" to cancel the template creation process. No firewall templates will be created then. All fields will be cleared in the form.
ru: Или нажмите "ОТМЕНИТЬ", чтобы отменить создание шаблона. Поля формы будут очищены, новый шаблон не будет создан.

source: Create a Shared Security Group
ru: Создание разделяемой группы безопасности

source: You can create a shared security group and it will be available for creating virtual machines of other users.
ru: Можно создать разделяемую группу безопасности, которую могут использовать другие пользователи при создании виртуальных машин.

source: A new shared security group is created on the base of existing templates. This security group will be created with a ``shared`` type.
ru: Новая разделяемая группа безопасности создается на основе существующих шаблонов, и имеет тип "разделяемая" (``shared``).

source: If you would like to create a new shared security group, navigate to the Shared Security Group section and click "Create" in the bottom-right corner. Then, fill in the form:
ru: Чтобы создать новую разделяемую группу безопасности, нажмите "Создать" |create icon| в правом нижнем углу и заполните форму (обязательные поля отмечены "звездочкой" *):

source: Name * - Enter a name for the group.
ru: Название * - введите название группы.

source: Description - Provide a short description for the group.
ru: Описание - введите краткое описание для группы.

source: Basic rules - Click "ADD" to open the list of rules to assign them to the group. In the appeared window select a template in the “All templates” list at the left and move it to the “Selected templates” list at the right by clicking the arrow icon:
ru: Базовые правила - нажмите "Добавить", чтобы открыть список доступных правил для добавления в группу. В появившемся окне выберите шаблон из левого списка "Все шаблоны" и переместите его в правый список "Выбранные шаблоны" с помощью "стрелки":

source: In the list below you will see the rules corresponding to the selected templates. Check those you wish to add to your shared security group.
ru: В списке ниже появятся правила, соответствующие выбранным шаблонам. Отметьте те правила, которые Вы хотите добавить в группу безопасности.

source: Click “CANCEL” to drop the selected options. No rules will be assigned to the security group. You will return to the “Create a new security group” window.
ru: Нажмите "ОТМЕНИТЬ", чтобы сбросить все выбранные опции. Правила не будут добавлены в группу безопасности. Пользователь вернется к форме создания группы.

source: Click "CREATE" to create the new shared security group. The group will appear in the list of shared security groups.
ru: Нажмите “СОХРАНИТЬ” для создания группы с выбранными правилами.

source: Click "CANCEL" to cancel the group creation process. No group will be created then. All fields will be cleared in the form.
ru: Для отмены создания группы нажмите "ОТМЕНИТЬ". Группа не будет создана, поля формы очистятся.

source: Private Security Groups
ru: Приватные группы безопасности

source: Private security groups are listed in the *Private Security Groups* section.
ru: Существующие в системе приватные группы безопасности отображаются в разделе *Приватные группы безопасности*.

source: Security groups appear in this section once they are created for a virtual machine (see :ref:`Create_VM`). A private security group name has the following format - ``sg-{{ virtual machine name }}`` - containing the name of the virtual machine it is created for.
ru: Создать группу безопасности можно при создании виртуальной машины (см. :ref:`Create_VM`). Название приватной группы имеет следующий формат - ``sg-{{ virtual machine name }}``, - где содержится название виртуальной машины, для которой создана группа

source: You can quickly find a group by its name or a part of the name using the searching tool above the list.
ru: Список групп можно фильтровать по названию или его части, используя инструмент поиска над списком.

source: Besides, Administrators can filter the list by accounts.
ru: Кроме того, Администратор может фильтровать список по аккаунтам.

source: You can filter the list by ticking the "Orphan" checkbox above. It allows displaying only the security groups that are not used by any machine.
ru: Также, фильтрация списка возможна с помощью опции "Свободные" в левом верхнем углу. Активируйте ее, чтобы отобразить в списке только те группы, которые не используются ни одной виртуальной машиной.

source: The "Orphan" option appears above the list in case the security groups that are not used by any VM exist in the list. This might happen in case a VM has been deleted but a group has been not (because of an error or incorrect behavior).
ru: Опция "Свободные" доступна, если в списке групп есть свободные группы безопасности. Свободные группы возникают в случае, когда виртуальная машина была удалена, а группа не удалилась ввиду ошибки или некорректного поведения системы.

source: Security Group Details Sidebar
ru: Информационная панель группы безопасности

source: You can see the firewall rules details in the sidebar to the right.
ru: Информацию о группе безопасности можно просмотреть в информационной панели справа.

source: Click the template/shared/private security group in the list and open the sidebar. You will see two tabs there - Details and Tags.
ru: Кликните на шаблон/разделяемую группу/приватную группу безопасности в списке и откройте информационную панель справа. В ней расположены две вкладки - "Детали" и "Теги".

source: The **Details** tab contains the following information:
ru: Во вкладке "Детали" отображается следующая информация:

source: Name of the security group;
ru: Название группы безопасности;

source: :ref:`SG_Action_Box` under |actions icon|;
ru: :ref:`SG_Action_Box` под |actions icon|;

source: ID of the security group;
ru: ID группы безопасности;

source: Description giving an idea what the security group contains (not available for private security groups);
ru: Описание группы для общего представления о том, что содержится в группе (для приватных групп описание недоступно);

source: Type - Defines the security group types. For firewall templates it can be ``custom-template`` for custom templates, or ``predefined-template`` for system templates. For shared security groups it is ``shared``. For private security groups you will see ``private``.
ru: Тип - определяет тип группы. Для шаблонов брандмауэра: ``custom-template`` для пользовательских шаблонов, или ``predefined-template`` для системных шаблонов. Для разделяемых групп безопасности: ``shared``. Для приватных групп безопасности: ``private``.

source: For shared security groups you also can see what virtual machines are assigned to this group. The machine name in the list is active. You can move to the virtual machine details bar by clicking it.
ru: Для разделяемых групп безопасности также отображается название машины, для которой используется группа. Название виртуальной машины активно. Кликом на него откроется информационная панель машины.

source: For private security groups a VM name is also displayed in the details sidebar, but it is not active.
ru: Для приватных групп название машины также отображается в информационной панели, но оно не активно.

source: The **Tags** tab presents the list of tags assigned to the security group. Using the search tool above you can quickly find a tag by its name.
ru: Во вкладке "Теги" представлен список тегов, добавленных к группе безопасности. Используя инструмент поиска над списком, можно быстро найти тег по названию.

source: System tags are listed in a separate card.
ru: Системные теги отображаются в отдельной карточке.

source: Сlick |create icon| to add a tag. Enter a key and a value.
ru: Нажмите |create icon|, чтобы добавить тег. Введите ключ и значение.

source: Both fields are required. The input values for both fields cannot start with a space.
ru: Оба поля обязательны к заполнению. Вводимые значения не могут начинаться с пробела.

source: Click "CREATE" to create the new tag. It will be saved in a separate card.
ru: Нажмите "СОЗДАТЬ", чтобы сохранить новый тег. Он отобразится в отдельной карточке.

source: An existing tag can be edited or deleted by clicking a correspondent icon next to the tag's name.
ru: Созданный тег можно редактировать или удалить, кликнув на соответствующую иконку рядом с названием тега.

source: Security Group Action Box
ru: Список действий с группой безопасности

source: Firewall templates, shared and private security groups have an Action box with the following actions in it:
ru: Для шаблона брандмауэра, разделяемых или приватных групп безопасности можно развернуть Список действий со следующими опциями:

source: View - Allows viewing the rules in the group/template. Click "Rules" |view| to open the rules implemented to the template.
ru: Правила - позволяет просмотреть правила группы/шаблона. Нажмите "Правила" |view|, чтобы открыть список правил, применяемых для данного шаблона.

source: Delete - Allows deleting the group or the template from the system.
ru: Удалить - позволяет удалить группу или шаблон из системы.

source: A template/security group cannot be deleted if it is used for a virtual machine, or it belongs to another user. Deleting action is not available for system firewall templates.
ru: Нельзя удалить шаблон или группу безопасности, если он/она используется виртуальной машиной, или принадлежит другому пользователю. Также действие удаления недоступно для системных шаблонов брандмауэра.

source: Edit a Firewall Template/Security Group
ru: Редактирование шаблона брандмауэра/группы безопасности

source: When clicking "Rules" |view| in the Action box you open a modal window where the rules of the template/security group are listed. The list of rules can be filtered by:
ru: Кликом на "Правила" |view| в списке действий открывается модальное окно, где представлен список правил шаблона/группы безопасности. Список правил можно фильтровать по:

source: IP versions - IPv4 and/or IPv6;
ru: Версиям - ipv4 и/или ipv6;

source: Types - Ingress and/or Egress;
ru: Типам - Входящее и/или Исходящее;

source: Protocols - TCP and/or UDP and/or ICMP.
ru: Протоколам - TCP и/или UDP и/или ICMP.

source: Besides, you can group the rules by types and/or protocols.
ru: Также, список правил можно группировать по типам и/или протоколам.

source: You can edit the implemented rules right in this modal window by clicking "EDIT" below the list. When switching to the edit mode you are enabled to add rules or delete the selected ones from the list.
ru: В этом же модальном окне можно редактировать правила. Перейти в режим редактирования можно кликом на "РЕДАКТИРОВАТЬ" внизу списка. Редактирование подразумевает добавление или удаление правил, отмеченных в списке.

source: To add rules, please, fill in the fields in the panel above the list and click “+”:
ru: Для добавления правил заполните поля в панели над списком и нажмите “+”:

source: **Validation**
ru: **Правила валидации полей**

source: Please, make sure you enter valid values for Start and End ports:
ru: При заполнении полей "Начальный порт" и "Конечный порт" убедитесь, что вы указываете корректные значения, а именно:

source: Start port can be less or equal to End port. For more convenience, we added the autocomplete, that is, when entering a Start port value, the End port field is prepopulated with an equal value.
ru: Значение для начального порта не может быть меньше значения для конечного порта. Для удобства мы добавили автозаполнение полей - при вводе начального порта то же значение подставляется в поле "Конечный порт", где при желании его можно изменить на большее значение.

source: The values in these fields cannot be greater/less than maximum/minimum allowed values (for TCP/UDP max port is 65535, for ICMP - 255).
ru: Значения в данных полях не могут быть больше/меньше максимально/минимально разрешенных значений (для TCP/UDP максимально разрешенное значение порта 65535, для ICMP - 255).

source: The fields cannot be empty.
ru: Поля "Начальный порт" и "Конечный порт" обязательны к заполнению.

source: For ICMP type make sure you input a valid CIDR, ICMP type and code.
ru: Для типа ICMP следует указывать корректные значения для CIDR, тип и код ICMP.

source: You will not be able to enter an ICMP type and a code until a valid CIDR is specified. Likewise, you will not be able to enter an ICMP code until a valid ICMP type is specified.
ru: Поля CIDR, тип и код ICMP зависимы от предшествующего поля: пока не указан корректный CIDR, нельзя ввести тип ICMP, и пока не указан корректный тип ICMP, нальзя ввести код ICMP.

source: CIDR allows entering IP addresses in both IPv4 and IPv6 formats.
ru: Для CIDR поддерживаются оба формата IP адресов: IPv4 и IPv6.

source: ICMP IPv6 the "[-1] Any" value is supported for type and code.
ru: Для ICMP IPv6 поддерживается значение "[-1] Любой" для полей тип и код.

source: ICMP type and code fields cannot be empty.
ru: Поля Тип и Код ICMP обязательны к заполнению.

source: For invalid values the add button "+" is disabled.
ru: При вводе некоррекнтых значений кнопка добавления правила "+" недоступна.

source: To delete rules, please, click the Delete icon in the list. The rule will be deleted from the security group.
ru: Чтобы удалить правила, нажмите на значок удаления. Правило будет удалено из списка.

source: Then you can move back to the view mode, or close the window. You will see the rules are edited.
ru: Затем можно вернуться в режим просмотра группы или закрыть окно. Измененные правила отобразятся в списке.

source: Please, note, when editing shared security groups, a warning message appears:
ru: Обратите внимание, что при редактировании разделяемой группы безопасности, появляется предупреждение:

source: Click “Yes” if you still want to edit a shared security group. You will be switched to the "Edit" mode. Change the security group as you need following the instructions above.
ru: Нажмите “Да”, если группу по прежнему нужно редактировать. Окно переключится в режим редактирования. Измените настройки группы безопасности, как описано выше.
