Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-Start.po
Languages: ru

source: Start Working With CloudStack-UI
ru: Начало работы с CloudStack-UI

source: This page is aimed to help you to make first steps at CloudStack-UI. If you have never worked with CloudStack before, you should start with installing the CloudStack platform. Follow the instruction in `the official documentation <http://docs.cloudstack.apache.org/en/4.11.1.0/installguide/index.html>`_.
ru: CloudStack-UI создан для более легкого и удобного управления облачной инфраструктурой — просмотра и использования облачных ресурсов, включая виртуальные машины, шаблоны и ISO, диски и снимки, группы безопасности и адреса IP. Информация, представленная в данном документе, поможет начать работу с CloudStack-UI. Если прежде вы не работали с CloudStack, рекомендуем начать с установки системы CloudStack. Для этого следуйте инструкциям в `официальной документации <http://docs.cloudstack.apache.org/en/4.11.1.0/installguide/index.html>`_.

source: Then deploy CloudStack-UI (see the `instructions for deployment <https://github.com/bwsw/cloudstack-ui#deployment>`_).
ru: Затем установите CloudStack-UI (см. `инструкции по установке интерфейса <https://github.com/bwsw/cloudstack-ui#getting-started-guide>`_).

source: Logging In
ru: Вход в систему

source: To enter the platform use your credentials provided by an administrator:
ru: Для входа в систему используйте логин и пароль, предоставленные администратором:

source: Required fields are marked with asterisks (*).
ru: Обязательные поля отмечены звездочкой (*).

source: User name * - The user ID of your account.
ru: Имя пользователя * - ID пользователя в вашем аккаунте.

source: Password * - The password associated with the user ID.
ru: Пароль * - Пароль, соответствующий ID пользователя.

source: Domain - Specify domain when you log in. CloudStak-UI supports three ways to do it. Choose the one which is more convenient for you:
ru: Домен — Укажите домен при входе. CloudStak-UI поддерживает три способа ввода домена. Выберите тот, который для вас более удобен:

source: Enter a domain in the field under the "Show advanced options" button |adv icon|.
ru: Введите домен в поле, которое раскрывается нажатием кнопки "Показать дополнительные параметры" |adv icon|.

source: Administrator can set a domain in configurations. Domain field will be prepopulated with the specified value. It is more convenient for a user as he/she does not need to enter the domain every time at logging in. In this case the domain field can be hidden by clicking |adv icon|. Find more information on the feature configuration at the `configuration guide <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-domain>`_.
ru: Администратор может установить домен в конфигурационном файле. В этом случае заданное значение будет автоматически указываться в качестве домена при входе в систему. Пользователю не придется вводить его каждый раз при авторизации. Поле домена можно скрыть, нажав на |adv icon|. Подробнее об определении домена через конфигурационный файл читайте в `руководстве по конфигурациям <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-domain>`_.

source: Another way to log in is to enter a URL in the format ``http://<ip-address>/login?domain=<domain>``. The domain will be prepopulated in the logging in form with the value that is specified in the URL. Please, note, the domain value in URL will override the domain set in the configurations by Administrator.
ru: Еще одним способом авторизации является вход через URL с указанием в ней домена в следующем формате: ``http://<ip-address>/login?domain=<domain>``. Значение домена из URL будет автоматически задано в форме авторизации. *Примечание*: значение домена из URL переопределяет значение домена, заданного Администратором в конфигурационном файле.

source: Push "Login" to proceed to CloudStack. You will see the first section - *Virtual Machines*.
ru: Нажмите "Войти" для перехода в CloudStack. Вы увидите первый раздел - *Виртуальные Машины*.

source: To the left you can see the main navigation bar. It shows the user name and allows moving from section to section.
ru: Слева находится панель основного меню. В ней отображаются имя пользователя и названия разделов, кликом на которые можно переходить из раздела в раздел.

source: When entering the system, a user sees the *Virtual Machines* section at the second level of the menu. At the first level, the main navigation bar has two expandable sections with the following nested menu items:
ru: При входе в систему, пользователь видит раздел *Виртуальные машины* в меню второго уровня. В меню первого уровня отображаются два основных раздела, в которых можно увидеть следующие вложенные элементы меню:

source: *Virtual Machines*
ru: *Виртуальные машины*

source: Virtual machines
ru: Виртуальные машины;

source: Storage
ru: Хранилище

source: Images
ru: Образы

source: Snapshots
ru: Снимки

source: Firewall
ru: Брандмауэр

source: SSH keys
ru: SSH ключи

source: Logout
ru: Выход

source: *Accounts*
ru: *Аккаунты*

source: Accounts
ru: Аккаунты

source: Activity log
ru: Журнал событий

source: Settings
ru: Настройки

source: The Logout section is placed at both levels.
ru: Раздел "Выход" расположен в меню обоих уровней.

source: To move between levels, click |menu icon| and then one of the two levels.
ru: Для перехода на первый уровень меню нажмите |menu icon|, а затем выберите нужный раздел из двух.

source: Resource Usage
ru: Используемые ресурсы

source: In this section you can see the resource statistics: used and free VMs, computational resources, volumes and storage space.
ru: В этом разделе Вы видите статистику использования ресурсов: используемые и свободные ВМ, вычислительные ресурсы, диски и хранилища.

source: Unfold *Resource Usage* panel in the upper part of the screen. It provides information on the following resources:
ru: Откройте панель *Использование Ресурсов* в верхней части экрана, где представлена информация о следующих ресурсах:

source: Virtual machines;
ru: Виртуальные машины;

source: Computational resources - CPU, RAM;
ru: Вычислительные ресурсы - CPU, RAM;

source: Volumes and snapshots;
ru: Диски и их снимки;

source: Storage - primary and secondary.
ru: Хранилище - основное и вторичное.

source: You can switch between used or free resources by clicking the option you need above the resource data list.
ru: Вы можете переключиться между используемыми и доступными ресурсами, кликнув переключатель над списком данных о ресурсах.

source: A user can see the resource usage statistics for his/her user only.
ru: Пользователь может видеть статистику использования ресурсов только для своего пользователя.

source: A Domain Administrator can view resources for his/her account and for the whole domain.
ru: Администратор домена может видеть ресурсы для своего аккаунта и для всего домена.

source: Notifications on Pending Operations
ru: Оповещения о недавних действиях

source: In the upper-right corner of the screen, you can see the list of pending operations by clicking a bell button |bell icon|. It informs you of the latest operations in the system. You can clear the list after its reviewing by deleting every notification one by one or by clicking "CLEAR ALL" at the list bottom.
ru: В верхнем правом углу экрана можно просматривать список недавних действий, нажав кнопку |bell icon|. Этот список сообщает Вам о последних операциях в системе. После просмотра списка можно очистить его, удалив каждое уведомление один за другим, или нажав "ОЧИСТИТЬ" в конце списка для удаления всех оповещений сразу.

source: Alongside with the notification panel, the action completion confirmation additionally appears in the snackbar notification at the page bottom.
ru: Помимо уведомлений в панели оповещений, подтверждение завершения действия дублируется внизу экрана в дополнительной панели.

source: In case of errors at data loading the snackbar also notifies of them. In this case it has a refresh button that refreshes the whole app.
ru: Также, дополнительная панель появляется при возникновении ошибок загрузки данных. В этом случае на ней предусмотрена кнопка "Обновить", которая позволяет обновить всю систему.

source: Support Information in Error Messages
ru: Информация о технической поддержке при возникновении ошибок

source: A user can add the information on support services to all error messages to let users get assistance faster in case of a failure. Support information should be specified in the ``support-info.md`` file stored in a `special folder <https://github.com/bwsw/cloudstack-ui/tree/master/src/support>`_ of the project. It may include contacts e.g. phone numbers, emails or any other details.
ru: Пользователь может добавить информацию о службе поддержки во все сообщения об ошибках. Это позволит быстрее связаться со службой поддержки и получить помощь при возникновении ошибок. Информация должна быть указана в файле ``support-info.md``, который хранится в `специальной папке <https://github.com/bwsw/cloudstack-ui/tree/master/src/support>`_ проекта. Она может включать в себя контакнтые данные, например номера телефонов, адреса электронной почты или другие данные для быстрой связи со службой технической поддержки.

source: The specified support details will display under a drop-down menu. Click it in the error message window to expand it.
ru: Указанная контактная информация службы поддержки будет отображаться в раскрывающемся блоке "Информация о технической поддержке" в окне уведомления об ошибке. Развернуть его можно кликом на блок.

source: Localization of the file is supported.
ru: Поддерживается локализация файла.

source: Adding Custom Scripts
ru: Добавление пользовательских скриптов

source: We support adding custom JavaScript scripts to extend the UI functionality with the services necessary for a user. For example, using custom scripts a user can add JivoSite or Google Analytics widgets to the interface.
ru: В CloudStack-UI есть возможность расширить функциональность UI необходимым для пользователя образом путем добавления пользовательских скриптов. Так, например, можно подключить виджеты JivoSite или Google Analytics.

source: Custom scripts are added at running the CloudStack-UI Docker-container. All that a user should do is to define the ``/scripts/custom.js`` custom script content and map it via a Docker-volume. By default, the ``/scripts/custom.js`` file is empty.
ru: Интеграция пользовательских скриптов JavaScript производится при запуске Docker-контейнера с приложением. Пользователю достаточно определить содержимое файла ``/scripts/custom.js`` и отобразить его через Docker-volume при запуске контейнера. По умолчанию файл ``/scripts/custom.js`` пустой.

source: As a result, you can see the added service in the UI:
ru: В результате, в UI появится добавленный сервис. На изображении ниже отображается подключенный виджет JivoSite:
