Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-Firewall.po
Languages: ru

source: Editing is not available for system firewall templates and security groups of other users. You can view the rules only.
ru: Редактирование недоступно для системных шаблонов брандмауэра, а также групп безопасности, принадлежащих другим пользователям. Правила, входящие в них, можно только просматривать.

source: "Convert to Shared" Action for Private Security Groups
ru: Создание общей группы безопасности из приватной

source: For private security groups you can find a "Convert to shared" action in the Action box. It allows making a shared SG from a private SG so that it can be used for VMs by other users.
ru: В списке действий для приватных групп безопасности можно увидеть опцию "Сделать общей", которая позволяет превратить приватную группу безопасности в разделяемую. Таким образом, данную группу можно будет использовать для других ВМ.

source: To convert a private security group into a shared one, please, follow the steps:
ru: Чтобы сдлать из приватной группы безопасности разделяемую, доступную для других машин, нужно:

source: Move to the list of Private Security groups,
ru: Перийти в раздел "Приватные группы безопасности" ,

source: Select "Convert to shared" option in action box for a security group,
ru: выбрать опцию "Сделать общей" в списке действий той машины, которую нужно сделать разделяемой.

source: A warning dialog appears. Click "YES" to confirm your action.
ru: В диалоговом окне следует подтвердить свое действия, кликнув "ДА".

source: The security group will be moved to the list of "Shared Security Groups". The tag "is private" will be removed for this security group.
ru: Группа безопасности переместится в раздел "Разделяемые группы безопасности". Из ее списка тегов будет удален тег, указывающий тип группы "private".

source: Click "NO" to cancel the convertion, the security group will stay private.
ru: Нажмите "НЕТ", чтобы отменить перевод группы в разделяемую группу.
