Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-LogView.po
Languages: ru

source: Log View Plugin
ru: Плагин для просмотра журналов ВМ

source: The section is under development!
ru: Раздел в процессе разработки!

source: Overview
ru: Общая информация

source: To make the *View logs* section available, first deploy the backend API plugin and then activate the Log View UI-plugin via the ``config.json`` file. See deployment instructions below.
ru: Чтобы подключить раздел *Просмотр логов*, нужно сначала установить бэкенд-плагин Log View, а затем включить UI-плагин через файл конфигурации ``config.json`` .

source: Deployment Instructions
ru: Установка плагина

source: Full instructions on the Log View plugin deployment is presented at the `plugin page <https://github.com/bwsw/cloudstack-ui/wiki/Log-View-Plugin>`_.
ru: Полная инструкция по установке бэкенд-плагина Log View представлена на `странице описания плагина <https://github.com/bwsw/cloudstack-ui/wiki/Log-View-Plugin>`_.

source: To enable the Log View plugin you need to:
ru: Чтобы подключить UI-плагин Log View, необходимо:

source: Install the backend API plugin into CloudStack.
ru: Установить бэкенд-плагин в CloudStack.

source: Deploy the necessary components: ElasticSearch, Filebeat, Logstash, Curator.
ru: Установить необходимые компоненты: ElasticSearch, Filebeat, Logstash, Curator.

source: Enable the UI extension via the ``config.json`` file.
ru: Подключить UI-расширение через файл конфигурации ``config.json``.

source: View Logs
ru: Просмотр логов в UI

source: After successful deployment you can see the *View logs* section under the *Virtual Machines* menu in UI. In this section you can view the log files for a defined period of time or in a real-time mode. To view logs you should specify an account (for Administrators), a VM for which you wish to see the logs, and a log file to view the logs from. More details are provided below.
ru: После успешного подключения плагина в UI вы увидите раздел *Просмотр логов* в разделе *Вируальные машины* основного меню слева. В этом разделе можно просматривать записи журналов ВМ за указанный период времени или в режиме реального времени . Для просмотра журналов необходимо указать аккаунт (доступно для Администраторов), машину и журнал этой машины, записи из которого нужно просмотреть. Подробнее см. описание ниже.

source: Filtering Logs
ru: Фильтрация записей

source: To view logs in the list, please, set up the filtering parameters.
ru: Для просмотра логов в списке задайте параметры фильтрации.

source: Select the following parameters in the provided order from drop-down lists:
ru: Выберите из ниспадающих списков следующие параметры в указанном порядке:

source: Required fields are marked with an asterisk (*).
ru: Обязательные поля отмечены "звездочкой" (*).

source: Accounts * - Allows Administrators to further select a VM in a specific account/accounts. Select an account or a number of accounts in the drop-down list.
ru: Аккаунты * - позволяют Администратору в следующем шаге выбрать машину конкретного(ых) аккаунта(ов), для которой необходимо просмотреть журналы . Выберите из ниспадающего списка один или несколько аккаунтов.

source: VM * - Allows selecting logs for a specific VM. Choose a machine you wish in the drop-down list. The list of available VMs is determined by the account(s) selected at the previous step, if you are an Administrator. If you are a user, you can see the machines belonging to your user only.
ru: ВМ * - позволяют выбрать журнылы конкретной ВМ. Выберите ВМ из ниспадающего списка. Список доступных ВМ определяется аккаунтом(ами), выбранным(и) на предыдущем шаге, если вы Администратор. Если вы пользователь, в списке вы увидите те машины, которые принадлежат вашему пользователю.

source: Log file - Allows viewing logs by a log file available for the selected VM. Choose a log file in the drop-down list. If no log file selected, all machine logs will display in the list.
ru: Журнал * - позволяет просматривать записи конкретного журнала. Выберите из ниспадающего списка журнал для показа записей из него. Если не выбирать конкретный журнал, в списке будут отображены записи из всех журналов выбранной машины.

source: Date * - Allows selecting logs for a specific period. Click |date icon| and in the appeared calendar choose the start and end dates to see the logs for. By default, the system shows logs for the last day.
ru: Дата - позволяет просматривать журналы за определенный период времени. Нажмите |date icon| и в появившемся календаре выберите начальную и конечную дату. По умолчанию показываются логи за последние сутки.

source: Time - Allows filtering logs for a specific time period within the selected dates. The time format is determined by the time format setting specified under the "Settings" section. Enter start and end time you wish into the fields to set a custom time period.
ru: Время - позволяет задать конкретный промежуток времени в рамках заданного периода. Формат времени определяется настройкой формата, заданной в разделе "Настройки". Вы можете ввести желаемое время в полях для начального и конечного времени.

source: Click "Show logs" to implement the filtering settings.
ru: Нажмите "Показать логи" для вывода логов согласно параметрам фильтрации.

source: The logs will be displayed in accordance with the chosen period.
ru: В списке будут отражены логи за указанный период.

source: You can change filtering parameters and refresh the list of logs by clicking "SHOW LOGS".
ru: Можно изменить параметры фильтрации и обновить список логов, нажав "ПОКАЗАТЬ ЛОГИ".

source: The set filtering parameters are saved to user tags. That means, if you log out of the system and then login again, you will continue to view logs with the previously set filtering parameters.
ru: Заданные параметры фильтрации сохраняются в теги пользователя. Это значит, что покинув систему и снова вернувшись в нее, вы продолжите просмотр журналов машин с теми же параметрами фильтрации, которые были заданы прежде.

source: View Logs List
ru: Список записей журналов

source: By clicking "SHOW LOGS", a user can view log files corresponding to the filtering parameters. Logs are listed in a chronological order from the earliest till the latest.
ru: Кликом на "ПОКАЗАТЬ ЛОГИ" пользователь может просматривать записи из журналов в соответствии с параметрами фильтрации. Записи в списке показаны в хронологическом порядке, от самых ранних до самых поздних.

source: By default, the system shows logs for the last day.
ru: По умолчанию, отображаются записи за последние сутки.

source: A user can view logs for his/her VMs only. An Administrator can see logs for all accounts in the domain.
ru: Пользователь может просматривать логи только для своих машин. Администратор может просматривать логи для машин всех аккаунтов в домене.

source: The following information for each log file is presented in the list:
ru: Для каждой записи в таблице представлена следующая информация:

source: Date
ru: Дата

source: File
ru: Журнал

source: Text
ru: Текст

source: Sorting Logs
ru: Сортировка записей

source: The sorting tool allows viewing the newest logs first in the list. Enable the checkbox to the right and click on "Show logs" to refresh the list.
ru: Для сортировки записей можно активировать опцию "Новые сверху" справа и обновить список кликом на "ПОКАЗАТЬ ЛОГИ".

source: Searching Logs
ru: Поиск по записям

source: Use the search tool to find logs by a word or a text. Enter the text in the search field above the list and click on "Show logs" to refresh the list.
ru: Для быстрого поиска по списку записей воспользуйтесь строкой поиска, расположенной над списком. Введите слово или текст и нажмите "ПОКАЗАТЬ ЛОГИ", чтобы обновить список. Записи будут отфильтрованы по заданным критериям поиска.

source: Following Logs
ru: Просмотр записей в режиме реального времени

source: After setting filtering parameters and clicking "Show logs", a user can start following logs, in other words, start monitoring logs online.
ru: После определения параметров фильтрации и нажатия на "ПОКАЗАТЬ ЛОГИ" пользователь может включить просмотр записей в режиме реального времени, чтобы отслеживать записи журналов машины.

source: When the "Follow logs" option is activated, the Log View UI-plugin sends requests to get the latest logs with the defined frequency and for a period, defined in the configuration file. By default, once per 1 second the system requests logs for the last 30 seconds. A user can customize these parameters via the configuration file (see `details <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#log-view-plugin>`_).
ru: При активации отслеживания журналов в режиме реального времени UI-плагин Log View запрашивает журналы с той частотой и за тот период времени, которые заданы в конфигурационном файле. По умолчанию, журналы запрашиваются с частотой один раз в секунду, и при каждом запросе по умолчанию возращаются записи за последние 30 секунд. Пользователь может задать другие значения данных настроек в конфигурационном файле (см. подробнее в `руководстве по конфигурациям <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#log-view-plugin>`_)

source: To view logs in a real time-mode, click "Follow logs" |follow icon|. This button is available right after selecting a virtual machine in the filtering parameters or after setting all necessary filtering parameters and clicking "Show logs". You will see the filtering options are got disabled and the log list is automatically getting refreshed per every second.
ru: Для отслеживания журналов в режиме реального времени нажмите "Отслеживать" |follow icon|. Кнопка доступна после выбора виртуальной машины в параметрах фильтрации, или после установки всех необходимых параметров фильтрации и нажатия кнопки "Показать логи". При активации режима отслеживания журналов вы увидите, что список записей журналов автоматически обновляется каждую секунду. При этом параметры фильтрации недоступны для выбора.

source: The "Follow logs" button changes its position depending on the applied sorting mode. If the "Newest first" option is disabled the button stands in the bottom-right corner, like at the screenshot above. If "Newest first" is enabled, the button goes to the upper-right corner and the latest logs will be displayed at the top of the list.
ru: Кнопка "Отслеживать" меняет положение в зависимости от применения режима сортировки. Если сортировка "Новые сверху" отключена, кнопка находится в правом нижнем углу, как на изображении выше. Если сортировка "Новые сверху" включена, кнопка отображается в правом верхнем углу, и записи в списке будут отображаться в обратном хронологическом порядке - от более ранних к более поздним.

source: By default, the list contains up to 1000 log records showing logs for the last minute.
ru: По умолчанию, в списке отображаются записи за последнюю минуту. Максимальное количество записей - 1000.

source: If too many entries are to be displayed in the list, the system loads them by parts when a user scrolls the list down.
ru: Если в списке большое количество записей, они будут подгружаться частями при "прокрутке" списка вниз.

source: You can set up parameters of log following in the "Log View Plugin Settings" section:
ru: Вы можете изменить параметры по умолчанию в разделе настроек “Просмотр логов (режим реального времени)”:

source: **Show last (minutes)** - allows viewing logs for the last set period. You can set the number of minutes from 1 (default) to 10.
ru: **Показывать за последние (минуты)** - время, за которое вы желаете отображать записи при каждом обновлении списка; допустимые значения - от 1 (по умолчанию) до 10 минут.

source: **Show last (messages)** - allows setting a maximum amount of logs to display. You can set from 1 to any number of log records. By default, 1000 messages are shown.
ru: **Максимальное количество отображаемых записей** - позволяет задать максимальное число записей для показа; допустимые значения - от 1 до бесконечности. По умолчанию, показываются 1000 записей.

source: Click "Update" to apply the settings.
ru: Нажмите "Обновить" для применения заданных значений.

source: To stop following logs click on |unfollow icon|.
ru: Чтобы остановить отслеживание записей, нажмите |unfollow icon|.
