Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-SSHkeys.po
Languages: ru

source: SSH Keys
ru: Ключи SSH

source: In the *Virtual Machines* -> *SSH keys* section you can create and manage SSH keys.
ru: В разделе *Virtual Machines* -> *Ключи SSH* можно создавать и управлять ключами SSH.

source: In addition to the username and password authentication, CloudStack supports using SSH keys to log in to the cloud infrastructure for additional security. Find more information in the `official documentation <http://docs.cloudstack.apache.org/projects/cloudstack-administration/en/latest/virtual_machines.html?highlight=keys#using-ssh-keys-for-authentication>`_.
ru: CloudStack поддерживает использование ключей SSH в качестве дополнительной защиты при доступе к облачной инфраструктуре, помимо имени пользователя и пароля. См. подробнее в `официальной документации <http://docs.cloudstack.apache.org/projects/cloudstack-administration/en/latest/virtual_machines.html?highlight=keys#using-ssh-keys-for-authentication>`_.

source: CloudStack-UI allows managing SSH key in a separate section which is more convenient for a user.
ru: CloudStack-UI позволяет управлять ключами SSH в отдельном разделе, что значительно удобнее для пользователя.

source: SSH Key List
ru: Список ключей SSH

source: SSH keys existing in the account are presented in this section. A user can see and manage SSH keys for his/her user only.
ru: В данном разделе представлены ключи SSH, созданные в аккаунте. Пользователь может просматривать и управлять ключами SSH, которые принадлежат ему.

source: Administrators can see and manage keys for all accounts in the domain.
ru: Администраторы могут видеть и управлять ключами всех пользователей в домене.

source: You can switch the view from a list mode to a card mode using the switch tool |view icon|/|box icon| in the upper-right corner.
ru: Существующие ключи могут быть представлены в виде списка или в виде карточек. Используйте переключатель |view icon|/|box icon| в правом верхнем углу.

source: For every key the following information is displayed:
ru: Для каждого ключа отображается следующая информация:

source: Key name;
ru: Название ключа;

source: SSH public key;
ru: Fingerprint открытого ключа SSH;

source: Action box - Allows deleting a key from the system.
ru: Список действий - позволяет удалить ключ из системы.

source: Filtering of SSH Keys
ru: Фильтрация ключей SSH

source: The filtering tool is available to Administrators. It is placed above the list of keys and allows filtering keys by accounts.
ru: Фильтрация ключей доступна для Администраторов и позволяет фильтровать и группировать ключи по аккаунтам.

source: Besides, the keys can be grouped by accounts that may be convenient for list viewing.
ru: Панель фильтрации расположена над списком ключей.

source: Create an SSH Key
ru: Создание ключа SSH

source: You can generate a new SSH key to use for authentication.
ru: Вы можете создать новый ключ SSH для аутентификации.

source: By clicking “Create” |create icon| in the bottom-right corner you will open a form where you should specify a key name:
ru: Нажмите "Создать" |create icon| в правом нижнем углу и в открывшейся форме введите название ключа:

source: Then click “CREATE”. The SSH key will be auto-generated. The public key will appear in the list of SSH keys with a fingerprint. In the modal window, you will see the private key. This private key is not saved in the system. You should save it for yourself. Click "COPY" to correctly copy it and save it locally.
ru: Затем нажмите "СОЗДАТЬ". Ключ SSH будет создан автоматически. Открытый ключ появится в списке ключей SSH, для него будет отображаться fingerprint. В модальном окне появится закрытый ключ, который нужно будет скопировать и сохранить локально. В системе он не сохранится. Нажмите "КОПИРОВАТЬ", чтобы правильно скопировать его в буфер обмена и сохранить себе.

source: Then click “OK” to close the window.
ru: Нажмите “OK”, чтобы закрыть окно.

source: You can specify an SSH public key entering its value in the field. It should start from ``ssh-rsa`` followed by one space and at least one symbol. Then click “CREATE”. The key will be saved. No private key is required in this case.
ru: Можно задать значение для ключа. Для этого введите значение ключа во втором поле, после того, как ввели название. Значение ключа должно начинаться с ``ssh-rsa`` с последующим пробелом и минимум одним символом после него. Затем нажмите “СОЗДАТЬ”. Ключ будет сохранен. Закрытый ключ в данном случае не будет создан.

source: The created SSH key is available to assign to VMs now.
ru: Новый ключ будет доступен для добавления к виртуальной машине сразу после создания.

source: SSH Key Details Sidebar
ru: Информационная панель ключа SSH

source: By clicking an SSH key in the list you will open a details sidebar to the right.
ru: Кликом на ключ SSH в списке можно открыть информационную панель справа.

source: It contains the following information:
ru: В ней отображается следующая информация:

source: SSH key name;
ru: Название ключа SSH;

source: Key action box allowing key deleting;
ru: Список действий, через который можно удалить ключ;

source: SSH public key fingerprint;
ru: Fingerprint открытого ключа SSH;

source: SSH key description - In this block a description can be added to understand better what this key is for. Click the block and enter a short description in the text field. Then click "SAVE" to save it.
ru: Описание ключа SSH - В данном блоке можно добавить описание для ключа, для лучшего понимания его назначения. Кликните на блок и введите описание в текстовое поле. Нажмите "СОХРАНИТЬ".

source: Click "CANCEL" to drop adding a description.
ru: Для отмены добавления описания нажмите "ОТМЕНИТЬ".

source: SSH Key Action Box
ru: Список действий с ключом SSH

source: By clicking "Actions" |actions icon| you can expand the list of actions for those SSH keys that belong to your user only. The deleting action is available here.
ru: Список действий для ключей SSH открывается кликом на |actions icon| напротив нужного ключа в списке. Список действий доступен для тех ключей, которые принадлежат пользователю. В списке действий доступно действие удаления ключа SSH.

source: Click "Delete" to delete a key and then confirm your action in the dialog box. The key will be deleted. Click "Cancel" to close the window without deleting a key.
ru: Для отмены удаления ключа нажмите "Отменить". Модальное окно закроется, ключ не будет удален из системы.
