Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-VirtualMachines.po
Languages: ru

source: Name of the snapshot * - Define a name for the snapshot. It is auto-generated in the form ``<date>-<time>``. But you can specify any name you wish.
ru: Имя снимка * — укажите имя для снимка. Система автоматически генерирует имя в формате ``<дата>-<время>``. Но Вы можете указать любое имя по желанию.

source: Description - Add a description of the snapshot to know what it contains.
ru: Описание — добавьте краткое описание снимка диска.

source: All snapshots are saved in the list of snapshots. In the disk information, you will see the name and time of the *last-taken snapshot*. For each snapshot the list of actions is available. Find more information on snapshot actions in the :ref:`Actions_on_Snapshots` sections below.
ru: Все снимки сохраняются в списке снимков. В разделе информации о диске Вы увидите имя и время *последнего* созданного снимка. Для каждого снимка доступны действия, описанные в разделе :ref:`Actions_on_Snapshots` ниже.

source: **Set up snapshot schedule**
ru: **Установить расписание для снимков**

source: You can schedule regular snapshotting by clicking "Set up snapshot schedule" in the Actions list.
ru: Для снимков можно задать расписание, кликнув "Установить расписание для снимков" в списке действий.

source: In the appeared window set up the schedule for recurring snapshots:
ru: В появившемся окне установить график периодического создания снимков:

source: Select the frequency of snapshotting - hourly, daily, weekly, monthly;
ru: Выберите частоту создания снимков — ежечасно, ежедневно, еженедельно, ежемесячно;

source: Select a minute (for hourly scheduling), the time (for daily scheduling), the day of week (for weekly scheduling) or the day of month (for monthly scheduling) when the snapshotting is to be done;
ru: Выберите минуту (для ежечасного создания снимков), время (для ежедневного создания снимков), день недели (для еженедельного создания снимков) или день в месяце (для ежемесячного создания снимков), когда снимок должен быть сделан;

source: Select the timezone according to which the snapshotting is to be done at the specified time;
ru: Выберите временную зону, в соответствии с которой расписание будет выполняться;

source: Set the number of snapshots to be made.
ru: Установите количество снимков, которое должно быть создано.

source: Click "+" to save the schedule. You can add more than one schedule but only one per each type (hourly, daily, weekly, monthly).
ru: Нажмите "+", чтобы сохранить расписание. Можно создать несколько графиков создания снимков, но не более одного для каждого типа расписания (ежечасного, ежедневного, еженедельного, помесячного).

source: **Resize the disk**
ru: **Изменить размер диска**

source: Disk resizing is not available for machines with active snapshots.
ru: Нельзя изменить размер диска, если у машины есть активные снимки.

source: This action is available to data disks created on the base of disk offerings with a custom disk size. Disk offerings with custom disk size can be created by Root Administrators only.
ru: Данное действие доступно для допольнительных дисков, созданных на основе дискового предложения с размером диска, устанавливаемого пользователем. Такие дисковые предложения могут создать только Администраторы.

source: Selecting "Resize the disk" option in the Actions list you are able to enlarge the disk size.
ru: Выбрав "Изменить размер диска" в списке действий, Вы сможете увеличить/уменьшить размер диска.

source: In the appeared window set up a new size using the slider and click "RESIZE" to save the edits.
ru: В появившемся окне установите новый размер, двигая «бегунок». Кликните "ИЗМЕНИТЬ РАЗМЕР" для сохранения изменений.

source: Click "CANCEL" to drop the size changes.
ru: Нажмите "ОТМЕНИТЬ", чтобы сбросить все изменения.

source: **Detach**
ru: **Открепить**

source: Detaching a volume is not available for machines with active snapshots.
ru: Нельзя открепить диск, если у машины есть активные снимки.

source: This action can be applied to data disks. It allows detaching the data disk from the virtual machine.
ru: Данное действие можно применить к дополнительным дискам. Оно позволяет открепить диск от виртуальной машины.

source: Click "Detach" in the Actions list and confirm your action in the dialog window.
ru: Нажмите "Открепить" в списке действий и подтвердите свое действие в диалоговом окне.

source: The data disk will be detached. It will be in the list of **Spare** drives in the *Storage* section.
ru: Дополнительный диск будет откреплен и снова появится в списке свободных дисков в разделе *Хранилище*.

source: **Delete**
ru: **Удалить**

source: Deleting a volume is not available for machines with active snapshots.
ru: Нельзя удалить диск у машин, имеющих активные снимки.

source: This action can be applied to data disks. It allows deleting a data disk from the system right in the *Storage* VM details sidebar.
ru: Действие удаления можно применить к дополнительным дискам. Оно позволяет удалить дополнительный диск из системы прямо из вкладки «Хранилище» информационной панели ВМ.

source: Click "Delete" in the volume Actions list and confirm your action in the dialog window.
ru: Нажмите "Удалить" в списке действий и подтвердите свое действие в диалоговом окне.

source: The data disk will be deleted from the system right at this moment.
ru: Дополнительный диск будет удален из системы в тот же момент.

source: If a disk has snapshots, the system will ask you if you want to delete the snapshots of the disk as well. Click "Yes" to delete the snapshots. Click "No" to leave the snapshots in the system after volume deleting.
ru: Если у диска есть снимки, система спросит, хотите ли Вы удалить их вместе с удалением диска. Нажмите "Да", чтобы удалить снимки. Нажмите "Нет", чтобы сохранить снимки в системе после удаления диска.

source: Snapshot Action Box
ru: Список действий со снимком дисков ВМ

source: For a newly taken snapshot all actions except "Delete" are disabled until the snapshot is backed up to the Secondary Storage that may take some time. Once it is backed up, a full range of actions is available to a user.
ru: Для только что созданного снимка в списке действий доступно только действие "Удалить", т.к. снимок еще не скопирован во вторичное хранилище. Как только снимок будет скопирован во вторичное хранилище (что может занять некоторое время), для него будет доступен полный список действий.

source: For each snapshot the following actions are available:
ru: Для каждого снимка доступны следующие действия:

source: **Create a template** - Register a new template right from the disk information block of the sidebar. In the appeared window fill in the form:
ru: **Создать шаблон** — позволяет создать новый шаблон прямо из вкладки информационного блока диска. В появившемся окне заполните форму:

source: Name * - Enter a name of the new template.
ru: Название * — введите имя нового шаблона.

source: Description * - Provide a short description of the template.
ru: Описание * — дайте краткое описание шаблона.

source: OS type * - Select an OS type from the drop-down list.
ru: Тип OС * — выберите тип OС из ниспадающего списка.

source: Group - Select a group from the drop-down list.
ru: Группа — выберите группу из ниспадающего списка.

source: Password enabled - Tick this option if your template has the CloudStack password change script installed. That means the VM created on the base of this template will be accessed by a password, and this password can be reset.
ru: Пароль включен — отметьте эту опцию галочкой, если у вашего шаблона установлен скрипт изменения пароля CloudStack. То есть, машина, созданная на основе данного шаблона, будет доступна по паролю. Пароль можно изменить.

source: Dynamically scalable - Tick this option if the template contains XS/VM Ware tools to support dynamic scaling of VM CPU/memory.
ru: Динамическое масштабирование — отметьте эту опцию галочкой, если ваш шаблон содержит инструмент XS/VM Ware для поддержки динамического масштабирования CPU/памяти ВМ.

source: Click "SHOW ADDITIONAL FIELDS" to expand the list of optional settings. It allows creating a template that requires HVM. Tick this option in this case.
ru: Нажмите "ПОКАЗАТЬ ДОПОЛНИТЕЛЬНЫЕ ПАРАМЕТРЫ", чтобы развернуть список дополнительных параметров настройки. Откроется флажок HVM. Он позволяет создать шаблон, который требует HVM. Отметьте эту опцию при необходимости.

source: Once all fields are filled in click "CREATE" to create the new template.
ru: Как только все поля заполнены, нажмите "СОЗДАТЬ", чтобы создать новый шаблон.

source: **Create Volume** - Allows creating a volume from the snapshot.
ru: **Создать диск** — позволяет создать диск из снимка.

source: Type a name for a new volume into the Name field in the modal window. Click “CREATE” to register a new volume.
ru: Введите название нового диска в поле "Название" в открывшемся окне. Нажмите "СОЗДАТЬ" для сохранения нового диска.

source: Click “CANCEL” to cancel the volume creation.
ru: Нажмите “ОТМЕНИТЬ” для отмены создания диска.

source: **Revert Volume To Snapshot** - Allows turning the volume back to the state of the snapshot.
ru: **Вернуть диск к снимку** — позволяет вернуть диск обратно к состоянию снимка.

source: In the dialog window confirm your action. Please, note, the virtual machine the volume is assigned to will be rebooted.
ru: Подтвердите свое действие в диалоговом окне. Обратите внимание, что виртуальная машина, к которой привязан диск, будет переустановлена.

source: **Delete** - allows deleting the last-taken snapshot.
ru: **Удалить** — позволяет удалить последний созданный снимок.

source: Besides, you can see all the snapshots in the list by clicking the "VIEW ALL" button. In the appeared window you will see the list of all snapshots. For each snapshot in the list, the same actions are available: you can create a template, or delete a snapshot.
ru: Кроме того, можно просмотреть все снимки в списке, нажав кнопку "СМОТРЕТЬ ВСЕ". В появившемся окне Вы увидите список всех снимков. Для каждого снимка в списке доступны те же самые действия: создать шаблон из снимка, создать диск, вернуть диск к снимку и удалить снимок.

source: **ISO** - Allows attaching ISO.
ru: **ISO** — позволяет добавить ISO к машине.

source: Attach ISO by clicking the "Attach" button in the ISO card. In the dialog window you will see the list of available ISO files. To easily find the ISO file you need, please, use the search tool above the list. Additionally, you can filter the list by OS family(-ies), by type(-s), by group(-s). Tick the ISO file you wish in the list and click "ATTACH". The ISO will be attached to the VM.
ru: Прикрепите ISO к ВМ, нажав "Прикрепить" в блоке ISO. В диалоговом окне Вы увидите список доступных файлов ISO. Чтобы легко найти нужный файл ISO воспользуйтесь инструментом поиска над списком. Кроме того, Вы можете отфильтровать список по семье (-ям) OС, типу (-ам), группе (-ам). Отметьте нужный файл ISO в списке и нажмите "ПРИКРЕПИТЬ". ISO будет прикреплен к ВМ.

source: You can detach the ISO file by clicking the "Detach" button.
ru: ISO можно отсоединить от ВМ, нажав "Открепить".

source: Network Tab
ru: Вкладка "Сеть"

source: The Network tab presents the network configurations of the VM.
ru: Во вкладке "Сеть" представлены конфигурации сети ВМ.

source: **NIC information** - VM network details are shown here: Network namе, Netmask, Gateway, IP, Broadcast URI, Traffic Type, Type, Default, MAC address.
ru: **Информация о NIC** — здесь представлена информация о сети ВМ: название сети, маска сети, шлюз, IP, тип трафика, MAC адрес.

source: You can add a secondary IP for the VM from this tab. Click "+" next to the Secondary IP option and confirm your action in the dialog window. The IP appears for the VM.
ru: Также, здесь можно добавить для ВМ дополнительный IP адрес. Нажмите "+" рядом с опцией "Дополнительный IPv4" и подтвердите действие в диалоговом окне. Дополнительный IPv4 появится в карточке сети ВМ.

source: You can delete the secondary IP by clicking the "Delete" button next to it.
ru: Дополнительный IP можно удалить нажатием кнопки "Удалить" рядом с ним.

source: **Firewall rules** - Allows viewing the security group assigned to the virtual machine, attach and detach groups, edit rules in a group.
ru: **Правила брандмауэра** — позволяет просматривать группу безопасности, используемую машиной, присоединять и отсоединять группы, редактировать правила в группе.

source: It is allowed to attach several groups to one machine. They are listed in the box. Next to each group, you can see the buttons |view| to view rules of the group and "-" to detach the group from the machine.
ru: Одна машина может входить одновременно в несколько групп безопасности. Группы перечислены в карточке. Рядом с каждой группой можно увидеть кнопку |view|, которая позволяет просматривать правила группы, и "-", чтобы открепить группу от машины.

source: **View rules**
ru: **Просмотр правил**

source: Click |view| to open the list of assigned firewall rules.
ru: Кликом на |view| открывается список правил присоединенной группы безопасности.

source: You can filter the list by IP version, types and/or protocols. Or you can adjust the view by grouping the list by types and/or protocols.
ru: Список правил можно фильтровать по типам и/или протоколам. Также, список можно группировать по типам и/или протоколам.

source: **Edit rules**
ru: **Редактирование правил**

source: In the modal window you can edit a security group. Click "EDIT" to move to the editing form. There you will be able to add rules, or delete the selected ones from the list.
ru: Группу безопасности можно редактировать в модальном окне. Нажмите "РЕДАКТИРОВАТЬ" для перехода к форме редактирования. В ней Вы можете добавить правила, или удалить правила из списка.

source: To add rules, please, fill in the fields in the bar above the list and click "+":
ru: Для добавления правил заполните поля в блоке над списком и нажмите "+":

source: To delete rules, please, click "Delete" icon in the list. The rule will be deleted from the security group.
ru: Чтобы удалить правило, нажмите иконку "Удалить" в списке. Правило будет удалено из группы безопасности.

source: Then you can move back to the view mode, or close the window.
ru: Затем снова вернитесь в режим просмотра, или закройте окно.

source: Please, note, when editing shared security groups, a warning message appears:
ru: При редактировании разделяемой группы безопасности появится предупреждение:

source: Click "Yes" if you still want to edit a shared security group. You will be moved to the "Firewall" section where you can edit the security group. After editing, go back to the virtual machine that uses this group. You will see the rules are edited.
ru: Нажмите "Да", если Вы все же хотите редактировать группу безопасности. Вы перейдете в раздел *Брэндмауэр*, где сможете редактировать группу. После внесения изменений вернитесь к машине, которая использует данную группу. Вы увидите, что правила в группе изменились.

source: **Attach Security Group**
ru: **Присоединить группу безопасности**

source: A VM can be a member of any number of security groups. To attach a security group to the virtual machine, you can use the "+" button. Click it to open a modal window. It displays the list of all security groups available for the machine. Groups that are attached to the machine are not available for selecting and look grayish. By default, the first option in the list is preselected. Click the radio-button next to the option you wish and press "SAVE".
ru: Машина может относиться к нескольким группам безопасности одновременно. Чтобы присоединить группу безопасности к виртуальной машине, используйте кнопку "+". Кликом на нее открывается модальное окно, в котором отображается список всех групп безопасности, доступных для присоединения к машине. Группы, которые уже присоединены к машине, недоступны для выбора. Первая опция в списке выбрана по умолчанию. С помощью радио-кнопки выберите нужную опцию и нажмите "СОХРАНИТЬ".

source: If you attach a group to the machine in the Running state, the system will inform you that the machine will be stopped. If you agree, the machine gets stopped and the group appears in the list of attached groups. Then, the machine gets started again.
ru: При присоединении группы к машине в статусе "Запущенная" появится оповещение о том, что машина будет остановлена. Если вы хотите продолжить, система остановит машину, присоединенная группа появится в списке групп для данной машины. Затем машина будет снова запущена.

source: **Detach Security Group**
ru: **Отсоединить группу безопасности**

source: To detach a security group from the virtual machine, use the "-" button. Click it and confirm your action in the dialog box.
ru: Чтобы отсоединить группу безопасности от виртуальной машины, используйте кнопку "-". Подтвердите свое действие в диалоговом окне.

source: If you detach a group from the machine in the Running state, the system will inform you that the machine will be stopped. If you agree, the machine gets stopped and the group disappears from the list of machine's security groups. Then, the machine gets started again.
ru: При отсоединении группы от машины в статусе "Запущенная", появится оповещение о том, что машина будет остановлена. Если вы хотите продолжить, система остановит машину, группа исчезнет из списка присоединенных групп. Затем машина будет снова запущена.

source: See the :ref:`Firewall` section for more information on firewall rules in the system.
ru: Более подробно о группах безопасности читайте в разделе :ref:`Firewall`.

source: Tags Tab
ru: Вкладка "Теги"

source: Under this tab, you can create and see the VM tags.
ru: В данной вкладке Вы можете создавать и просматривать теги виртуальной машины.

source: CloudStack-UI uses tags very extensively to provide additional UX capabilities. Tags are key-value pairs. So it makes a kind of a key-value storage for the meta-information - VM description or group, or a user language. The tags used by Cloudstack-UI are system tags. They are prefixed with ``csui``. You can find the full list of system tags supported by CloudStack-UI at the `page <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_.
ru: В CloudStack-UI теги используются для обеспечения дополнительных возможностей пользовательского взаимодействия (UX). Теги — это пары ключ-значение, посредством которых создается своего рода база метаданных — описание ВМ или группы, язык пользователя. Теги, используемые Cloudstack-UI, являются системными тегами. Системные теги начинаются с префикса ``csui``. Полный список системных тегов CloudStack-UI Вы найдете на `странице <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_.

source: System tags are used to provide functionality from the user interface perspective. Changing these tags affects the functionality of the application. The "Show system tags" checkbox allows to view or hide system tags of the virtual machine. Uncheck this box to hide system tags from the list. It helps to avoid accidental unwanted changes. If a user has disabled displaying of these tags, the system will remember it and next time tags will also be hidden.
ru: Системные теги используются для обеспечения дополнительной функциональности с точки зрения пользовательского интерфейса. Изменение данных тегов может повлечь за собой нежелательные изменения в работе системы. Во вкладке «Теги» есть опция "Показать системные теги", которая позволяет просматривать или скрывать системные теги машины. Отключите данную опцию, чтобы скрыть системные теги из списка во избежание нежелательных изменений. При отключении данной опции система запомнит, что системные теги следует скрывать, и в следующий раз не будет их показывать по умолчанию.

source: To find the tag you are interested in, please, use the search tool above the tag list. You can enter a name or a part of the tag name to distinguish it in the list.
ru: Для поиска тега в списке воспользуйтесь инструментом поиска. Введите имя или часть имени тега и нужный тег будет выделен в списке.

source: The tags assigned to the virtual machine are presented in the list. System tags are presented in one card, other tags - in a separate card. For each tag in the list the following actions are available when hovering the mouse over the tag key:
ru: При наведении мышью на имя тега рядом с ним появляется список действий:

source: Edit - Allows editing the tag. In the appeared form define a new key and/or value (both fields are required). Click "Edit" to save the edits. Click "Cancel" to drop the edits. The tag won't be changed then.
ru: Редактировать — дает возможность редактировать тег. В открывшейся форме задайте новые ключ и значение (оба поля обязательны к заполнению). Нажмите "Редактировать" для сохранения внесенных изменений. Нажмите "Отмена", чтобы сбросить все изменения и отменить редактирование тега.

source: Delete - Allows deleting the tag. Click "Delete" and confirm your action in the dialog window.
ru: Удалить — позволяет удалить тег. Нажмите "Удалить" и подтвердите свое действие в диалоговом окне.

source: **Create Tags**
ru: **Создание тега**

source: You can create a tag right from *Tags* tab.
ru: Во вкладке «Теги» можно создать тег.

source: Click "Create" |create icon| and fill in the appeared form:
ru: Нажмите "Создать" |create icon| и заполните поля формы:

source: Required fields are marked with an asterisk (*). You cannot use space as the first symbol.
ru: Обязательные поля отмечены "звездочкой" (*). Значения в полях не должны начинаться с пробела.

source: Key * - Enter a key here.
ru: Ключ * — укажите ключ.

source: Value * - Enter the value here.
ru: Значение * — укажите значение ключа.

source: When adding a system tag, click "+" in the card to open the creation form. You will see that the ``csui`` prefix is automatically prepopulated here.
ru: При добавлении системного тега нажмите "+" в блоке системных тегов. Откроется форма создания тега. Вы увидите, что в ней поле "Ключ" уже содержит ``csui``. Вам останется ввести остальную часть ключа.

source: If you create a non-system tag, it will be saved in a new card. If you have entered a key in the format ``<prefix>.<example>``, a card will be named as "<prefix>". When creating a new tag from this card, click "+" in the card and in the tag creation form the *Key* field will be prepopulated with the <prefix>.
ru: При создании несистемного тега он сохранится в отдельный блок. Если создаваемый тег имеет ключ в виде ``<prefix>.<example>``, название блока будет иметь имя ``<prefix>``. Создавая тег из этого блока, в форме создания тега поле «Ключ» будет автоматически содержать значение ``<prefix>``.

source: Access a Virtual Machine
ru: Доступ к виртуальной машине

source: Access VM component allows a user to obtain all necessary credentials to access a VM in the final dialog box shown after VM creation, or later when a user selects a corresponding action in the VM Action box. Depending on tags determined for a template or a VM, the system allows getting access to the VM interaction interface. Currently, the following access modes are supported:
ru: Помощники доступа к виртуальной машине позволяют пользователю получить все необходимые реквизиты для доступа к ней в финальном диалоговом окне, который отображается пользователю после создания машины, или позже, когда пользователь выбирает соответствующий пункт в контекстном меню виртуальной машины. В зависимости от того, какие теги определены для шаблона, из которого создается машина, или для самой машины, в интерфейсе доступа к ВМ отображается необходимая информация. На сегодня реализованы следующие режимы доступа к машине:

source: Via a VNC console - active by default for all VMs;
ru: Через VNC консоль — опция активна по умолчанию для всех машин;

source: Via SSH;
ru: По SSH;

source: Via HTTP.
ru: По HTTP.
