Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-Snapshots.po
Languages: ru

source: Snapshots
ru: Снимки

source: The *Virtual Machines* -> *Snapshots* section contains the information on snapshots - Volume snapshots and Virtual Machine snapshots - existing in the system.
ru: В разделе *Виртуальные машины* -> *Снимки* содержится информация о снимках дисков и снимках виртуальных машин, существующих в системе.

source: A Volume snapshot is a capture of virtual machine disks. You can find more information on volume snapshots in the Apache CloudStack `documentation <http://docs.cloudstack.apache.org/en/4.11.1.0/adminguide/storage.html#working-with-volume-snapshots>`_.
ru: Снимок диска - это зафиксированное в моменте состояние дисков машины. Более подробно о снимках диска написано в `документации Apache CloudStack <http://docs.cloudstack.apache.org/en/4.11.1.0/adminguide/storage.html#working-with-volume-snapshots>`_.

source: Virtual Machine snapshots allow users to preserve the VM data volumes and its CPU/memory state. Currently we support VM snapshots for the KVM hypervisor only. For more information about Virtual Machine snapshots check out the `official documentation <http://docs.cloudstack.apache.org/en/4.11.1.0/adminguide/virtual_machines.html?highlight=snapshots#virtual-machine-snapshots>`_.
ru: Снимки виртуальных машин позволяют пользователю сохранить состояние дисков машины и ее ОЗУ/памяти. На сегодняшний день мы поддерживаем создание снимков машин для только гипервизора KVM. Более подробную информацию о снимках ВМ вы найдете в `официальной документации <http://docs.cloudstack.apache.org/en/4.11.1.0/adminguide/virtual_machines.html?highlight=snapshots#virtual-machine-snapshots>`_.

source: Virtual Machine snapshots are currently under development!
ru: Подраздел "Снимки виртуальных машин" находится в разработке!

source: Snapshots List
ru: Список снимков

source: All snapshots existing in the system are presented in the list format. There are two lists in the section - Volume snapshots and Virtual Machine snapshots. To move between lists use the switch button at the top.
ru: Все снимки, созданные в системе, представлены в виде списке. В разделе есть два подраздела - Диски и ВМ, они содержат списки снимков дисков и ВМ соответственно. Для переключения между подразделами используйте переключатель сверху.

source: The list of snapshots can be presented in the box view or in the list view. Change the view using |view icon|/|box icon| button.
ru: Снимки дисков могут быть представлены в формате карточек или в формате списка. Менять представление можно с помощью переключателя |view icon|/|box icon| в правом углу списка.

source: For each snapshot in the list the following information is presented:
ru: Для каждого снимка в списке представлена следующая информация:

source: State bullet - green for a backed up snapshot, red for any error behavior, yellow for a snapshot being created, grey for allocated.
ru: Метка статуса - зеленая - "снимок сохранен", красная - "ошибка", желтая - "снимок создается", серая - "снимок аллоцирован".

source: Name of the snapshot.
ru: Название снимка.

source: Volume/VM name the snapshot is created for.
ru: Имя диска/машины, с которого/которой создан снимок.

source: Date and time of creation.
ru: Дата и время создания снимка.

source: Actions button |actions icon|.
ru: Список действий под кнопкой |actions icon|.

source: Filtering of Snapshots
ru: Фильтрация снимков

source: Filtering of snapshots is available above the list.
ru: Инструмент фильтрации снимков доступен вверху списка.

source: You can filter the list by the following parameters:
ru: Фильтровать список можно по следующим параметрам:

source: by Accounts (available to Administrators).
ru: по аккаунтам (доступно Администраторам).

source: by Type - Hourly, Daily, Weekly, Monthly, Manual depending on the schedule of snapshotting (available for Volume snapshots).
ru: по типу - ежечасные, ежедневные, еженедельные, ежемесячные, с ручным режимом создания снимков, в зависимости от расписания создания снимков (доступно для снимков диска).

source: by Virtual Machine - Select a VM or VMs in the drop-down list to filter the list for the snapshots for those belonging to the VM or VMs.
ru: по виртуальным машинам - выберите машину или несколько машин в ниспадающем списке для фильтрации снимков, принадлежащих этой машине/этим машинам.

source: by creation date - Select a date using a date picker to filter the list for the snapshots created within the specified period.
ru: по дате создания - выберите дату, используя календарь, чтобы фильтровать список снимков, созданных в этот день.

source: You can group snapshots:
ru: Снимки можно группировать:

source: by Accounts (available for Administrators) and/or
ru: по аккаунтам (доступно Администраторам) и/или

source: by Type (for Volume snapshots) or
ru: по типу (доступно для снимков дисков) или

source: by VM (for VM snapshots)(*is not currently available*).
ru: по виртуальным машинам (для снимков машин) (*в данный момент не доступна*).

source: The searching tool allows to find a snapshot by:
ru: С помощью инструмента поиска можно быстро найти снимок в списке по:

source: its name or a part of the name;
ru: названию или части названия;

source: snapshot description.
ru: описанию снимка.

source: Snapshot Details Sidebar
ru: Информационная панель снимка

source: A details sidebar presents the information on a snapshot. It appears to the right by clicking a snapshot in the list.
ru: В информационной панели отображается информация о снимке. Панель открывается справа кликном на снимок в списке.

source: For a Volume snapshot the following information is presented in the details sidebar:
ru: Для снимков дисков в информационной панели отображаются следующие данные:

source: Snapshot name, a state bullet and actions under the |actions icon| button;
ru: Имя снимка, иконка статуса и список действий под |actions icon|;

source: Date and time of creation;
ru: Дата и время создания снимка;

source: Type - Presents the snapshot type - Hourly, Daily, Weekly, Monthly, Manual;
ru: Тип - Отображает тип снимка - ежечасный, ежедневный, еженедельный, ежемесячный, вручную;

source: Volume information and a virtual machine it is assigned to.
ru: Информация о диске и виртуальной машине, к которой относится снимок.

source: For a VM snapshot the following information is presented in the details sidebar:
ru: Для снимков виртуальных машин в информационной панели отображаются следующие данные:

source: Type - Presents the snapshot type, e.g. *DiskAndMemory*;
ru: Тип - Отображает тип снимка, например, *DiskAndMemory*;

source: Current - Defines if the snapshot refers to the most recent snapshot compared to the current state of the VM;
ru: Текущий - Показывает, относится ли моментальный снимок к самому последнему снимку по сравнению с текущим состоянием виртуальной машины;

source: Parent - Shows a parent snapshot (if any exists) of this snapshot;
ru: Родительский снимок - Указывает родительский снимок (если он есть) данного снимка;

source: Description for the snapshot provided at creation;
ru: Описание для снимка, добавленное при его создании;

source: The name of a virtual machine the snapshot belongs to. It is a link that opens details of the VM for more information.
ru: Имя виртуальной машины, которой принадлежит снимок. Имя является активной ссылкой на детали машины.

source: Snapshot Actions Box
ru: Список действий со снимком

source: The following actions are available for Volume snapshots:
ru: Для снимков дисков доступны следующие действия:

source: Create template;
ru: Создать шаблон;

source: Create volume;
ru: Создать диск;

source: Revert volume to snapshot;
ru: Вернуть диск к состоянию снимка;

source: Delete.
ru: Удалить.

source: The following actions are available for Virtual Machine snapshots:
ru: Для снимков виртуальных машин доступны следующие действия:

source: Revert VM to snapshot;
ru: Вернуть машину к состоянию снимка;

source: For a newly created snapshot the "Delete" action is available only till the snapshot is backed up to the Secondary Storage that may take some time. Once it is backed up (marked with a green state icon), a full range of actions is available to a user.
ru: Для только что созданных снимков в списке действий доступно только действие "Удалить", т.к. снимок еще не скопирован во вторичное хранилище. Как только снимок будет скопирован во вторичное хранилище (что обозначено в UI зеленой иконкой статуса), для него будет доступен полный список действий.

source: Below you will find details for each action.
ru: Ниже каждое действие описано подробнее.

source: **Create Template**
ru: **Создать шаблон**

source: Open a creation form to register a new template from a Volume snapshot.
ru: Откройте форму создания шаблона из снимка диска.

source: Fill in the fields:
ru: Заполните поля:

source: Required fields are marked with an asterisk (*).
ru: Обязательные поля отмечены "звездочкой" (*).

source: Name * - Enter a name of the new template.
ru: Название * - введите название нового шаблона.

source: Description * - Provide a short description of the template.
ru: Описание * - дайте краткое описание для шаблона.

source: OS type * - Select an OS type from the drop-down list.
ru: Тип ОС * - выберите тип ОС из ниспадающего списка.

source: Group - Select a group from the drop-down list.
ru: Группа - выберите группу из ниспадающего списка.

source: Password enabled - Tick this option if your template has the CloudStack password change script installed. That means the VM created on the base of this template will be accessed by a password, and this password can be reset.
ru: Пароль включен - отметьте эту опцию галочкой, если у вашего шаблона установлен скрипт изменения пароля CloudStack. То есть, машина, созданная на основе данного шаблона, будет доступна по паролю, и пароль можно изменить.

source: Dynamically scalable - Tick this option if the template contains XS/VM Ware tools to support dynamic scaling of VM CPU/memory.
ru: Динамическое масштабирование - отметьте эту опцию галочкой, если ваш шаблон содержит инструмент XS/VM Ware для поддержки динамического масштабирования CPU/памяти ВМ.

source: Click “Show additional fields” to expand the list of optional settings. It allows creating a template that requires HVM. Tick this option in this case.
ru: Нажмите «Показать дополнительные параметры», чтобы развернуть список дополнительных параметров настройки. Откроется флажок HVM. Он позволяет создать шаблон, который требует HVM. Отметьте эту опцию при необходимости.

source: Once all fields are filled in click "Create" to create the new template.
ru: Как только все поля заполнены, нажмите «СОЗДАТЬ», чтобы создать новый шаблон.

source: Click "Cancel" to cancel the template creation.
ru: Чтобы отменить создание шаблона, нажмите "ОТМЕНИТЬ".

source: **Create Volume**
ru: **Создание диска**

source: This action allows creating a volume from a Volume snapshot.
ru: Данное действие позволяет создать диск из снимка диска.

source: Type a name for a new volume into the Name field in the modal window. Click "CREATE" to register a new volume.
ru: В открывшемся окне введите название диска в поле "Название". Нажмите "СОЗДАТЬ", чтобы сохранить новый диск.

source: Click "CANCEL" to cancel the volume creation.
ru: Чтобы отменить создание диска, нажмите "ОТМЕНИТЬ".

source: **Revert Volume to Snapshot**
ru: **Вернуть диск к снимку**

source: This action is available for Volume snapshots. It allows turning the volume back to the state of the snapshot. It is available to those snapshots that have a volume.
ru: Данное действие доступно для снимков дисков. С помощью него можно вернуть состояние диска к снимку. Оно доступно для тех снимков, у которых есть диск.

source: In the dialog window confirm your action. Please, note, the virtual machine the volume is assigned to will be rebooted.
ru: В диалоговом окне подтвердите ваше действие. Обратите внимание, что виртуальная машина, к которой относится диск, будет перезагружена.

source: **Revert VM to Snapshot**
ru: **Вернуть машину к снимку**

source: This action is available for Virtual Machine snapshots. It allows turning the VM back to the state of the snapshot. It is useful if you implemented any changes to the VM and they went wrong so this action allows quick restoring of a VM to its previous state.
ru: Данное действие доступно для снимков виртуальных машин. Оно позволяет вернуть машину к состоянию снимка. Действие полезно, если вы применили к машине изменения и что-то пошло не так, как планировалось. Тогда с помощью этого действия можно быстро восстановить машину до состояния снимка.

source: Select "Revert VM to Snapshot" from the actions list and confirm your action in the dialog window. The VM state will be reverted to the snapshot.
ru: Выберите "Вернуть ВМ к снимку" в списке действий и подтвердите свое действие в диалоговом окне. Состояние машины вернется к состоянию снимка.

source: It is not allowed to revert a machine to snapshot if the current Service Offering of the VM differs from that used at the moment the snapshot was taken.
ru: Нельзя вернуть машину к состоянию снимка, если вычислительное предложение машины отличается от того, что использовалось на момент создания снимка.

source: **Delete**
ru: **Удалить**

source: This action allows deleting a snapshot from the system.
ru: Данное действие позволяет удалить снимок из системы.

source: Click "Delete" in the Action box and confirm your action in modal window. The snapshot will be deleted.
ru: Нажмите "Удалить" в списке действия и подтвердите свое действие в появившемся окне. Снимок будет удален.

source: Click "NO" to cancel the snapshot deleting.
ru: Чтобы отменить удаление снимка, нажмите "НЕТ".
