Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-Storage.po
Languages: ru

source: Storage
ru: Хранилище

source: In the *Virtual Machines* -> *Storage* section, you can create and manage drives for virtual machines. Here you can add new disks, create templates and snapshots of a volume, view the list of snapshots for each volume.
ru: В данном разделе можно создавать дополнительные диски для виртуальных машин и управлять ими. Здесь можно добавлять диски, создавать шаблоны и снимки томов, просматривать списки снимков для каждого тома.

source: Drive list
ru: Список дисков

source: If you have just started working with CloudStack and you do not have virtual machines yet, you have no disks in the list. Once you create a VM, a root disk is created for it automatically. Creation of an additional disk takes resources and requires expenses. Please, make sure you definitely need an additional data disk.
ru: В начале работы в CloudStack у Вас нет виртуальных машин и дисков. При создании виртуальной машины для нее автоматически создается корневой диск. Создание дополнительных дисков отнимает ресурсы и требует дополнительных затрат. Прежде, чем создавать дополнительный диск, пожалуйста, убедитесь, что он Вам действительно необходим.

source: Here you can find a list of disks existing for your user.
ru: Существующие диски представлены в разделе в виде списка. Пользователю доступны только диски, принадлежащие его/ее пользователю.

source: Domain Administrator can see disks of all accounts in the domain.
ru: Доменный Администратор видит диски всех пользователей в домене.

source: Disks can be viewed as a list or as a grid of cards. Switch the view by clicking a view icon |view icon|/|box icon| in the upper-right corner.
ru: Представление дисков можно изменить с режима списка на режим карточек. Выберите удобный режим представления, нажав переключатель |view icon|/|box icon| в правом верхнем углу.

source: Filtering of Drives
ru: Фильтрация дисков

source: Root disks are visually distinguished from data disks in the list. There is an option to display only spare disks which allows saving user's time in certain cases.
ru: В списке дисков корневые диски отличаются от дополнительных дисков цветом. Сверху есть функция отображения только свободных дисков. Активируйте ее, чтобы быстро отсортировать свободные диски в списке.

source: As in all lists, there is the filtering tool for selecting drives by zones and/or types. You also can apply the search tool selecting a drive by its name or a part of the name.
ru: Как и во всех разделах, в разделе *Хранилище* список дисков можно фильтровать по зонам и/или по типам. Также, можно искать диски по названию или его части.

source: For better distinguising of drives in the list you can group them by zones and/or types, like in the figure below:
ru: Диски можно группировать по зонам и/или типам, как на изображении ниже:

source: Domain Administrators can see the list of drives of all accounts in the domain. Filtering by accounts is available to Administrators.
ru: Доменному Администратору доступны диски всех аккаунтов в домене. Он может фильтровать список дисков по аккаунтам.

source: For each drive in the list the following information is presented:
ru: Для каждого диска в списке представлена следующая информация:

source: Drive name,
ru: Название диска,

source: Size,
ru: Размер,

source: State - Ready or Allocated.
ru: Статус — Готов или Аллоцирован.

source: The Actions button |actions icon| is available to the right. It expands the list of actions for a disk. See the information on actions in the :ref:`Actions_on_Disks` section below.
ru: Справа находится кнопка Список действий |actions icon|. Подробнее о действиях с дисками можно узнать в разделе :ref:`Actions_on_Disks` ниже.

source: Create New Volume
ru: Создание нового диска

source: In the *Storage* section you can create new volumes. Please, note that if you are aimed at creation of a virtual machine, we do not recommend starting from adding new disks to the system. You can go right to the *Virtual Machines* section and create a VM. A root disk will be cerated for the VM automatically.
ru: В разделе *Хранилище* можно создать новый диск. Обратите внимание, если вы собираетесь создать виртуальную машину, не стоит начинать с добавления диска в систему. Можно сразу перейти в раздел *Виртуальные машины* и создать ВМ. Новая машина будет создана с root-диском.

source: If necessary, you can create a data disk and attach it to your VM. By clicking the "Create" button |create icon| in the bottom-right corner you will open a creation form. Please, make sure you definitely need an additional disk as it takes resources and requires expenses. If you do not have disks yet, when clicking "Create", a dialog box will ask you if you surely want to create a drive. Confirm your creation action by clicking "CONTINUE":
ru: Но если все же необходимо создать дополнительный диск, откройте форму создания диска, нажав кнопку создания |create icon| в правом нижнем углу. Если Вы только начали работать в CloudStack и у Вас нет виртуальных машин и дисков, при создании диска система попросит подтвердить Ваше намерение создать новый диск. Нажмите "ПРОДОЛЖИТЬ", если Вы действительно хотите создать дополнительный диск:

source: A creation form will appear.
ru: Откроется форма создания диска.

source: To create a new volume fill in the fields:
ru: В форме заполните поля:

source: Required fields are marked with an asterisk (*).
ru: Обязательные поля отмечены "звездочкой" (*).

source: Name * - Enter a name of the volume.
ru: Название * - Введите название диска.

source: Zone * - Select a zone from the drop-down list.
ru: Зона * - Выберите зону из ниспадающего списка.

source: Disk offering * - Select from the list of available offerings opening it in a modal window by clicking "SELECT". The list of available disk offerings is determined in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#service-offering-availability>`_ by Administrator.
ru: Дисковое предложение * - Выберите дисковое предложение. Откройте список доступных дисковых предложений, нажав "ВЫБРАТЬ" в блоке дисковых предложений. Список доступных дисковых предложений задается Администратором. Доступность дисковых предложений определяется той зоной, которая задана в `конфигурационном файле <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#service-offering-availability>`_.

source: In the modal window you can see the name and short description for each disk offering and a radio-button to select any option.
ru: В списке отображаются имя и короткое описание дискового предложения. Слева от каждой опции находится радио-кнопка для выбора дискового предложения.

source: For each disk offering you can expand detailed information by clicking the arrow icon or the whole line in the list. In the appeared section you will see a range of parameters. The following parameters are shown by default:
ru: Для каждого предложения в списке можно развернуть подробную информацию, кликнув на строку или стрелку напротив предложения. В открывшемся блоке представлены следующие параметры:

source: Bandwidth (MB/s): Read/Write rates;
ru: Скорость чтения и записи (МБайт/сек);

source: IOPS: Read/Write rates and Min/Max values;
ru: IOPS: Чтение/Запись (IO/сек) и значения Min/Max;

source: Storage type;
ru: Тип хранилища;

source: Provisioning type;
ru: Выделение ёмкости;

source: Creation date.
ru: Дата создания.

source: Use the scrolling tool to view them all.
ru: Для просмотра полного перечня параметров воспользуйтесь прокруткой справа.

source: More parameters can be added via the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#disk-offering-parameters>`_ by an Administrator.
ru: Администратор может расширить список параметров через `конфигурационный файл <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#disk-offering-parameters>`_ .

source: Select a disk offering in the list and click "SELECT".
ru: Выберите дисковое предложение в списке и нажмите "ВЫБРАТЬ".

source: If the selected disk offering has a custom disk size (it is set by Administrator), you can change the disk size moving the slider to the volume size you wish or entering a value into the number field.
ru: Если выбранное дисковое предложение имеет настраиваемый размер диска (устанавливается Администратором), размер диска можно изменить, двигая "бегунок" до нужного значения.

source: Click "CREATE" to save the settings and create the new volume. You will see the drive appears in the list.
ru: Нажмите "СОЗДАТЬ", чтобы сохранить настройки и создать новый диск. Созданный диск появится в списке дисков.

source: Click "CANCEL" to drop all the settings. The drive will not be created then.
ru: Нажмите "ОТМЕНИТЬ" для отмены создания диска.

source: Volume Details Sidebar
ru: Информационная панель диска

source: By clicking a disk in the list you can access the information on the volume.
ru: Нажатием на диск в списке можно открыть информационную панель справа.

source: At the right sidebar you can find two tabs:
ru: В ней — две вкладки:

source: Volume tab - Provides the information on the disk volume:
ru: Вкладка "Диск", в которой отображается информация о диске:

source: General information - Presents disk size, date and time of creation, the storage type (shared, local).
ru: Общая информация — Размер, дата и время создания диска, тип хранилища (общее, локальное).

source: Description - Allows entering a short description to the drive. Click at the Description card and enter a short description in the text block.
ru: Описание — Позволяет добавить краткое описание к диску. Нажмите на блок «Описание» и введите краткое описание в текстовое поле.

source: Click "Save" to save the description. Description will be saved to volume `tags <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_.
ru: Нажмите "Сохранить", чтобы сохранить описание. Описание сохраняется в `теги диска <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_.

source: You can edit the description by clicking the "Edit" button |edit icon| in the tab.
ru: Описание можно редактировать, нажав "Редактировать" |edit icon| в блоке описания.

source: Disk offering - Presents the information on the disk offering chosen at disk creation.
ru: Дисковое предложение — Содержит информацию о дисковом предложении, на основе которого был создан диск.

source: Snapshots tab - Allows creating disk snapshots. Snapshots can be taken for disks with the "Ready" status only.
ru: Вкладка "Снимки", которая содержит информацию о снимках диска, если они есть. Здесь же можно сделать снимок диска. Снимки можно делать только для дисков со статусом "Готов".

source: Click the "Add" button |create icon| and enter in the dialog box:
ru: Нажмите "Создать" |create icon| и введите в диалоговом окне:

source: Name - Define a name for the snapshot. It is auto-generated in the format ``<date>-<time>``. But you can specify any name you wish.
ru: Имя - Название снимка. Система автоматически предлагает имя в формате ``<дата>-<время>``. Можно ввести любое название по желанию.

source: Description - Add a description of the snapshot to know what it contains.
ru: Описание - Дайте краткое описание снимку, чтобы понимать, что он содержит.

source: Then click "Create" and see the snapshot has appeared in the list.
ru: Нажмите "Создать" и созданный снимок появится в списке существующих снимков диска.

source: Every snapshot is saved in a separate card. There you will see the name and time of the snapshot.
ru: Каждый снимок сохраняется в отдельную карточку. В ней отображается название и время создания снимка.

source: For each snapshot the list of actions is available. Find more information on snapshot actions in the :ref:`Actions_on_Snapshot_Volume` section below.
ru: Для каждого снимка доступен список действий. Подробнее об этом написано в разделе :ref:`Actions_on_Snapshot_Volume` ниже.

source: Snapshots Action Box
ru: Список действий для снимков

source: For a newly taken snapshot all actions except "Delete" are disabled until the snapshot is backed up to the Secondary Storage that may take some time. Once it is backed up, a full range of actions is available to a user.
ru: Для только что созданного снимка в списке действий доступно только действие "Удалить", т.к. снимок еще не скопирован во вторичное хранилище. Как только снимок будет скопирован во вторичное хранилище (что может занять некоторое время), для него будет доступен полный список действий.

source: Likewise the Virtual Machine information tab, the same actions are available for a snapshot:
ru: Список действий для снимков содержит тот же перечень действий, что и в Информационной панели виртуальной машины:

source: **Create a template** - Allows creating a template from the snapshot. This template can be used for VM creation.
ru: **Создать шаблон** - позволяет создать из снимка шаблон, который потом можно использовать для создания ВМ.

source: Fill in the form to register a new template:
ru: Заполните форму для регистрации нового шаблона в системе:

source: Name * - Enter a name of the new template.
ru: Название * - введите имя нового шаблона.

source: Description * - Provide a short description of the template.
ru: Описание * - дайте краткое описание шаблона.

source: OS type * - Select an OS type from the drop-down list.
ru: Тип OС * - выберите тип OС из ниспадающего списка.

source: Group - Select a group from the drop-down list.
ru: Группа — выберите группу из ниспадающего списка.

source: Password enabled - Tick this option if the template has the password change script installed. That means the VM created on the base of this template will be accessed by a password, and this password can be reset.
ru: Пароль включен - отметьте эту опцию галочкой, если у вашего шаблона установлен скрипт изменения пароля CloudStack. То есть, машина, созданная на основе данного шаблона, будет доступна по паролю, и пароль можно изменить.

source: Dynamically scalable - Tick this option if the template contains XS/VM Ware tools to support the dynamic scaling of VM CPU/memory.
ru: Динамическое масштабирование - отметьте эту опцию галочкой, если ваш шаблон содержит инструмент XS/VM Ware для поддержки динамической масштабируемости CPU/памяти ВМ.

source: Click "SHOW ADDITIONAL FIELDS" to expand the list of optional settings. It allows creating a template that requires HVM.
ru: Нажмите "ПОКАЗАТЬ ДОПОЛНИТЕЛЬНЫЕ ПАРАМЕТРЫ", чтобы развернуть список дополнительных параметров настройки. Откроется флажок HVM. Он позволяет создать шаблон, который требует HVM. Отметьте эту опцию, если это необходимо.

source: Once all fields are filled in click "Create" to create the new template.
ru: Как только все поля заполнены, нажмите "СОЗДАТЬ", чтобы создать новый шаблон.

source: **Create Volume** - Allows creating a volume from the snapshot.
ru: **Создать диск** - позволяет создать диск из снимка.

source: Type a name for a new volume into the Name field in the modal window. Click “Create” to register a new volume.
ru: Введите название нового диска в поле "Название*" в открывшемся окне. Нажмите "Создать" для сохранения нового диска.

source: Click “Cancel” to cancel the volume creation.
ru: Нажмите “Отменить” для отмены создания диска.

source: **Revert Volume To Snapshot** - Allows turning the volume back to the state of the snapshot.
ru: **Вернуть диск к снимку** - Позволяет вернуть диск обратно к состоянию снимка.

source: In the dialog box confirm your action. Please, note, the virtual machine the volume is assigned to will be rebooted.
ru: Подтвердите свое действие в диалоговом окне. Обратите внимание, что при выполнении данного действия виртуальная машина, к которой относится диск, будет переустановлена.

source: **Delete** - Allows deleting the snapshot. Click “Delete” in the Action box and confirm your action in modal window. The snapshot will be deleted. Click “Cancel” to cancel the snapshot deleting.
ru: **Удалить** - позволяет удалить снимок. Выберите "Удалить" в списке действий и подтвердите свое действие в диалоговом окне. Снимок будет удален. Нажмите "Отменить" для отмены удаления снимка.

source: Volume Action Box
ru: Список действий для дисков

source: Action on drives are available under the Actions button |actions icon|.
ru: Раскройте список действий для дисков, нажав |actions icon| рядом с названием диска в списке или в информационной панели.

source: The following actions are available on disk:
ru: Список действий с диском включает в себя:

source: For root disks:
ru: Для корневых дисков:

source: Take a snapshot;
ru: Сделать снимок;

source: Set up snapshot schedule;
ru: Установить расписание для снимков;

source: Resize the disk.
ru: Изменить размер диска.

source: For data disks:
ru: Для дополнительных дисков:

source: Detach;
ru: Прикрепить/Открепить;

source: Resize the disk;
ru: Изменить размер диска;

source: Delete.
ru: Удалить.

source: **Take a snapshot**
ru: **Сделать снимок**

source: You can take a snapshot of the disk to preserve the data volumes. Snapshots can be taken for disks with the "Ready" status only.
ru: Снимок диска позволяет сохранить состояние дополнительного диска. Данное действие доступно только для дисков со статусом "Готов".

source: Click "Take a snapshot" in the disk Actions list and in the dialog window enter the following information:
ru: Нажмите "Сделать снимок" в списке действий к диску и в диалоговом окне введите:

source: Name of the snapshot * - Define a name for the snapshot. It is autogenerated in the form ``<date>-<time>``. But you can specify any name you wish.
ru: Имя снимка * - укажите имя для снимка. Система автоматически генерирует имя в формате ``<дата>-<время>``. Но Вы можете указать любое имя по желанию. Описание — Добавьте краткое описание снимка диска.

source: All snapshots are saved in the list of snapshots. For a snapshot you can:
ru: Все снимки сохраняются в список снимков диска. Для снимков доступны следующие действия:

source: Create a template;
ru: Создать шаблон;

source: Delete the snapshot.
ru: Удалить снимок.

source: See the :ref:`Actions_on_Snapshot_Volume` section for more information.
ru: Более подробно действия со снимками описаны в разделе :ref:`Actions_on_Snapshot_Volume`.

source: **Set up snapshot schedule**
ru: **Установить расписание для снимков**

source: This action is available for disks with the "Ready" status only.
ru: Данное действие доступно только для дисков со статусом "Готов".

source: You can schedule the regular snapshotting by clicking "Set up snapshot schedule" in the Actions list.
ru: Расписание создания снимков можно установить, нажав "Установить расписание для снимков" в списке действий.

source: In the appeared window set up the schedule for recurring snapshots:
ru: В появившемся окне установить график периодического создания снимков:

source: Select the frequency of snapshotting - hourly, daily, weekly, monthly;
ru: Выберите частоту создания снимков — каждый час, каждый день, каждую неделю, каждый месяц;

source: Select a minute (for hourly scheduling), the time (for daily scheduling), the day of week (for weekly scheduling) or the day of month (for monthly scheduling) when the snapshotting is to be done;
ru: Выберите минуту (для почасового создания снимков), время (для ежедневного создания снимков), день недели (для еженедельного создания снимков) или день в месяце (для ежемесячного создания снимков), когда снимок должен быть сделан;

source: Select the timezone according to which the snapshotting is to be done at the specified time;
ru: Выберите временную зону, в соответствии с которой расписание будет выполняться;

source: Set the number of snapshots to be made.
ru: Установите количество снимков, которое должно быть создано.

source: Click "+" to save the schedule. You can add more than one schedule but only one per each type (hourly, daily, weekly, monthly).
ru: Нажмите "+", чтобы сохранить расписание. Можно создать несколько графиков создания снимков, но не более одного для каждого типа расписания (почасового, ежедневного, еженедельного, помесячного).

source: **Resize the disk**
ru: **Изменить размер диска**

source: This action is available to root disks as well as data disks created on the base of disk offerings with a custom disk size. Disk offerings with custom disk size can be created by Root Administrators only.
ru: Данное действие доступно для дополнительных дисков, созданных на основе дискового предложения с размером диска, устанавливаемого пользователем. Такие дисковые предложения могут создать только Администраторы.

source: You can change the disk size by selecting "Resize the disk" option in the Actions list. You are able to enlarge disk size only.
ru: Выбрав "Изменить размер диска" в списке действий Вы сможете увеличить/уменьшить размер диска.

source: In the appeared window set up a new size and click "RESIZE" to save the edits.
ru: В появившемся окне установите новый размер, двигая «бегунок». Кликните "ИЗМЕНИТЬ РАЗМЕР" для сохранения изменений.

source: Click "Cancel" to drop the size changes.
ru: Нажмите "Отменить", чтобы сбросить все изменения.

source: **Attach/Detach**
ru: **Прикрепить/Открепить**

source: This action can be applied to data disks. It allows attaching/detaching the data disk to/from the virtual machine.
ru: Данное действие можно применить к дополнительным дискам. Оно позволяет прикрепить/открепить диск к/от виртуальной машины.

source: Click "Attach" in the Actions list and in the dialog window select a virtual machine to attach the disk to. Click "ATTACH" to perform the attachment.
ru: Нажмите "Прикрепить" в списке действий и в появившемся окне выберите машину, к которой следует прикрепить диск. Нажмите "ПРИКРЕПИТЬ" в диалоговом окне.

source: An attached disk can be detached. Click "Detach" in the Actions list and confirm your action in the dialog window. The data disk will be detached from the virtual machine.
ru: Прикрепленный диск можно открепить. Нажмите "Открепить" в списке действий и подтвердите свое действие в диалоговом окне. Дополнительный диск будет откреплен от машины.

source: **Delete**
ru: **Удалить**

source: This action can be applied to data disks. It allows deleting a data disk from the system.
ru: Данное действие можно применить к дополнительным дискам. Оно позволяет удалить дополнительный диск из системы.

source: Click "Delete" in the Actions list and confirm your action in the dialog window.
ru: Нажмите "Удалить" в списке действий и подтвердите свое действие в диалоговом окне.

source: If a volume has snapshots the system will ask you if you want to delete them as well. Click "YES" to delete the snapshots of the volume. Click "NO" to keep them.
ru: Если у диска есть снимки, система спросит, хотите ли Вы удалить их вместе с удалением диска. Нажмите "ДА", чтобы удалить снимки. Нажмите "НЕТ", чтобы сохранить снимки в системе после удаления диска.

source: The data disk will be deleted from the system.
ru: Дополнительный диск будет удален из системы в тот же момент.
