Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-VirtualMachines.po
Languages: ru

source: To access the detailed information on how to add the token to the Filebeat configuration, please, use the provided link to the plugin documentation:
ru: Чтобы узнать, как воспользоваться токеном и добавить его к конфигурации Filebeat, воспользуйтесь ссылкой на официальную документацию по проекту:

source: Click OK to close the window.
ru: Нажмите ОК, чтобы закрыть окно.

source: Invalidate token - Allows making the token invalid. It is necessary in case of compromising when a token needs to be changed to a new one. In the appeared window, input the token into the text field and click INVALIDATE. The token will become invalid.
ru: Аннулировать токен - Позволяет сделать токен недействительным. Это необходимо в случае компрометации, когда необходимо заменить старый токен на новый. В открывшемся окне введите токен в текстовое поле и нажмите АННУЛИРОВАТЬ. Токен станет недействительным.

source: Or you may click CANCEL to close the window. The token will remain valid.
ru: Чтобы отменить действие и закрыть окно, нажмите ОТМЕНИТЬ. Токен останется действительным.

source: **Pulse** - It is a custom feature created in CloudStack-UI to visualize the VM performance statistics. By clicking "Pulse" at the Actions box you open a modal window with 3 tabs: CPU/RAM, Network, Disk. There you can see the charts of resources statistics for the VM.
ru: **Pulse** — это функциональность, созданная в CloudStack-UI для отображения статистики работы ВМ. Выбрав "Pulse" в списке действий, Вы откроете модальное окно с тремя вкладками: ЦП/Память, Сеть, Диск. В них Вы найдете графики статистики использования ресурсов ВМ.

source: You can adjust the graphs by range, data aggregation period, shift interval and other parameters.
ru: Отображение графиков можно настроить, меняя период агрегации данных, интервал сдвига и другие параметры.

source: This plugin is convenient for dynamic monitoring of VM performance. Find more information about it in the `official documentation <https://github.com/bwsw/cloudstack-ui/wiki/Pulse-Plugin>`_. Pulse plugin deployment instructions can be found at the :ref:`Pulse_Plugin` page.
ru: Данный плагин удобен для динамического мониторинга работы машины. Вы найдете больше информации об этом плагине в разделе :ref:`Pulse_Plugin`. Инструкции по установке плагина Пульс можно найти в разделе :ref:`PulseDeployment`.

source: Please, note, when performing one of the actions from the list, other actions in this list are disabled until the action in progress finishes.
ru: При выборе одного из действий в списке другие действия в списке становятся недоступны до завершения выбранного действия.

source: VM Details Sidebar
ru: Информационная панель виртуальной машины

source: For each virtual machine, you can get the details.
ru: Для каждой виртуальной машины в боковой панели справа можно открыть информационный блок.

source: By clicking a VM line or card you can open a sidebar to the right.
ru: Кликом на ВМ в списке или на карточку ВМ откроется панель справа.

source: Here and in all other sections the sidebar width is adjustable - you can change it by hovering over its edge and dragging to the width you wish.
ru: Здесь и во всех остальных разделах ширина боковой панели редактируется. Ширину панели можно изменить, если навести мышь на ее край и потянуть до нужной ширины.

source: In the details sidebar you will find the information for the selected virtual machine:
ru: В панели отображается следующая информация:

source: VM name.
ru: Имя VM.

source: Color-picker |color picker| - Allows marking a virtual machine with a color to distinguish it in the list. The range of available colors for VMs is specified in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#vm-colors>`_.
ru: Цвет ВМ |color picker| — позволяет отметить виртуальную машину цветом в списке. Доступные цвета задаются в `файле конфигурации <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#vm-colors>`_.

source: Actions on the VM. See the :ref:`VM_Actions` section below.
ru: Список действий для ВМ. См. подробнее в разделе :ref:`VM_Actions` ниже.

source: You will see four tabs in the sidebar. Let's describe what information on the virtual machine is presented in each tab.
ru: В панели Вы увидите 4 вкладки. Ниже будет описана информация, представленная в каждой вкладке.

source: Virtual Machine Tab
ru: Вкладка "Машина"

source: The Virtual Machine tab contains the general setting of the VM. Some settings can be edited here. At the bottom you can see the Statistics section which shows real-time data for the VM performance.
ru: Вкладка "Машина" содержит основные настройки ВМ. Некоторые настройки в ней можно редактировать. В конце находится раздел *Статистика*, которая отображает данные по работе ВМ в реальном времени.

source: Description - A short description of the VM. Click the block to edit it. Enter a few words about the VM. Click "Save" to save the description. It is a custom description for your machine. It is saved to tags with ``csui.vm.description`` tag.
ru: Описание — отображает краткое описание ВМ (если есть). Кликните по блоку, чтобы отредактировать его. Введите краткое описание ВМ. Нажмите "Сохранить", чтобы сохранить описание. Это описание для Вашей машины сохранится в теги ВМ с тегом ``csui.vm.description``.

source: The description can be edited. Click "Edit" |edit icon| to change the description.
ru: Описание можно редактировать, кликнув "Редактировать" |edit icon| и изменив описание в текстовом поле.

source: It also can be edited from the Tags tab. Click Edit icon |edit icon| next to the ``csui.vm.description`` tag and change the description text in the appeared form.
ru: Также, описание можно редактировать из вкладки тегов. Кликните "Редактировать" рядом с тегом ``csui.vm.description`` и измените описание в появившейся форме.

source: Details - Displays general information about the VM:
ru: Детали — отображает детали машины:

source: VM host name,
ru: заданное или сгенерированное автоматически имя хоста,

source: Zone selected for the VM to be available in,
ru: зону, в которой ВМ будет доступна,

source: Machine ID,
ru: ID виртуальной машины,

source: VM UserData - Allows viewing, editing and copying user data applied to the machine.
ru: UserData ВМ - позволяет просматривать, редактировать и копировать пользовательские данные, используемые для машине.

source: Click |view| to open the modal window and view the user data applied to the machine. Use the scroll tool if the text contains many symbols.
ru: Нажмите |view|, чтобы открыть модальное окно и просмотреть user data машины. Если текст длинный, используйте "прокрутку" справа.

source: You can copy data by clicking |copy icon|.
ru: Можно скопировать данные кликом на |copy icon|.

source: Click EDIT to view the data in the editing mode. Make necessary changes and save them.
ru: Нажмите РЕДАКТИРОВАТЬ для просмотра данные в режиме редактирования. Внесите изменения в текстовом поле и сохраните их.

source: Or click CANCEL to close the dialog window without saving changes.
ru: Или нажмите ОТМЕНИТЬ, чтобы закрыть диалоговое окно без сохранения изменений.

source: Group - A group the VM is assigned to. Edit this field by clicking the "Edit" button |edit icon|. In the appeared dialog window choose a group from the drop-down list. Click "Assign" to assign the VM to the chosen group.
ru: Группа — группа, к которой относится ВМ. Редактируйте данное поле, кликнув "Редактировать" |edit icon|. В появившемся диалоговом окне выберите группу из ниспадающего списка и кликните "Применить" для добавления ВМ в группу .

source: Or you can create a new group right from this window selecting the "Create a new group" option. Click "ASSIGN" to assign the created group to the VM.
ru: Вы также можете создать новую группу, вписав название группы прямо в текстовое поле в диалоговом окне. Кликните "Применить" для добавления группы к ВМ.

source: To remove a machine from the assigned group select the "Remove from the group" option and click "REMOVE" to eliminate the VM from the group. A *Default group* will be displayed for this machine.
ru: Для удаления ВМ из группы выберите "Удалить из группы" и кликните "Удалить". Для машины, которая не относится ни к одной из групп, в поле "Группа" отображается "Группа по умолчанию".

source: Service offering - The service offerings of the VM. Expand the section to view the whole list of offering parameters.
ru: Вычислительные предложения - предложения вычислительных ресурсов VM. Раскройте раздел, чтобы просмотреть весь список предложений.

source: Edit this field by clicking the "Edit" button |edit icon|. In the appeared window you will see the list of available service offerings.
ru: Редактируйте это поле, нажав кнопку "Редактировать" |edit icon|. В появившемся окне откроется список доступных предложений.

source: The list consists of two sections - Fixed and Custom. In each section, offerings can be filtered by classes if classes are determined in the `configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#compute-offering-classes>`_.
ru: Список состоит из двух разделов - *Фиксированные* и *Настраиваемые*. В каждом разделе можно фильтровать предложения по классам, если для предложений заданы классы. Задать классы вычислительных предложений можно в `конфигурационном файле <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#compute-offering-classes>`_.

source: You can use the search tool to find an offering in the list by a name or a part of the name.
ru: Также, можно воспользоваться поиском и ввести в поле поиска название или часть названия предложения, чтобы быстрее найти его в списке.

source: Select an option from the list to change the service offering.
ru: Выберите в списке вариант предложения.

source: Click "Change" to implement the edits.
ru: Нажмите "Изменить", чтобы сохранить выбранную опцию.

source: A started virtual machine will be rebooted at editing the service offering.
ru: При редактировании вычислительного предложения запущенная виртуальная машина будет перезапущена.

source: Affinity Group - The affinity group(s) assigned to the virtual machine. A name and a type of groups are displayed here. Groups are listed in alphabetic order. Hovering over a group name shows a description of a group (if provided at creation).
ru: Аффинитетная группа — в этом блоке отображена(ны) имя и тип аффинитетной(ых) группы (групп), присвоенной(ых) виртуальной машине. Наведением мыши на название группы можно просмотреть описание для нее (если оно есть).

source: If no affinity group is assigned to the VM, or you wish to add another affinity group to the list, click "Add" (+) in the block. A dialog box appears where you can choose an existing group or create a new one.
ru: Если ВМ не присвоено группы, ее можно добавить, нажав "Добавить" (+). В диалоговом окне можно выбрать группу из списка существующих или создать новую.

source: Select a group in the list and click "Assign" to assign it to the VM. A user can add several groups to one virtual machine.
ru: Выберите группу в списке и кликните «Присвоить». Группа будет присвоена ВМ. Пользователь может добавить несколько групп одной ВМ.

source: To create an affinity group fill in the form at the top of the dialog box and click "+" to add the group to the list. Then, you can assign the newly created group to the VM.
ru: Чтобы создать аффинитетную группу, заполните форму и нажмите "+". Группа добавится к списку. Теперь группу можно добавить к ВМ.

source: When assigning an affinity group to a started virtual machine, the system will suggest you stopping the VM. Click "OK" in the dialog window. Then, the VM will be started again.
ru: При добавлении группы к запущенной машине система предложит остановить ВМ. Нажмите "OK" в диалоговом окне. Затем машина будет снова запущена.

source: The selected group/groups can be deleted by clicking |delete icon| near the group name in the list.
ru: Можно удалить выбранную группу/группы, кликнув |delete icon| напротив имени группы в блоке аффинитетных групп машины.

source: Template - Shows the template used to create the virtual machine.
ru: Шаблон — отображает шаблон, используемый при создании ВМ.

source: SSH key - Shows the SSH key of the virtual machine. Add the SSH key by clicking "+". In the appeared window select the SSH key in the drop-down list and click "CHANGE":
ru: Ключ SSH — отображает ключ SSH данной ВМ. Добавьте ключ SSH, кликнув "+". В появившемся окне выберите ключ SSH из ниспадающего списка и кликните "ИЗМЕНИТЬ":

source: At saving the new SSH key for a started VM you will see the warning: "You need to stop the virtual machine to reset SSH key." Click "OK" if you want to stop it right now. Click "Cancel" to drop the edits.
ru: При сохранении нового ключа SSH для работающей ВМ появится предупреждение: "При переустановке ключа SSH необходимо остановить виртуальную машину." Кликните "OK", если Вы хотите остановить ее. Нажмите "ОТМЕНИТЬ", чтобы сбросить все настройки.

source: Statistics - shows VM statistics on CPU utilized, Network read, Network write, Disk read, Disk write, Disk read (IO), Disk write (IO). Refresh data by clicking the "Refresh" button |refresh icon| in the upper-right corner.
ru: Статистика — отображает статистику использования CPU машиной, Сеть чтения, Сеть записи, Скорость чтения, Скорость записи, Скорость чтения (IO), Скорость записи (IO). Обновите данные, нажав "Обновить" |refresh icon| в правом верхнем углу.

source: VM Snapshots
ru: Снимки ВМ

source: This section presents the information on snapshots created for the virtual machine. It shows the details for the last taken snapshot, allows viewing a complete list of all machine's snapshots and managing them. You also can take a VM snapshot in this section.
ru: В данном разделе представлена информация о снимках, созданных для виртуальной машины. В нем отображается информация о последнем созданном снимке, список всех снимков машины, а также кнопки действий для управления снимками.

source: The following information is displayed in this section:
ru: В разделе доступна следующая информация:

source: Details on the last taken snapshot: name, creation date and time;
ru: Детали последнего созданного снимка: имя, дата и время создания;

source: "View All" allows viewing a full list of snapshots created for the machine. It opens a modal window where a user can see the list of snapshots and manage them using the action buttons:
ru: Кнопка "ВСЕ" позволяет открыть полный список снимков, созданных для машины. Список открывается в отдельном окне. Напротив каждого снимка в списке находятся кнопки действий, позволяющие управлять снимками:

source: A user can manage snapshots in the list using action buttons:
ru: Пользователь может управлять снимками в списке:

source: **Revert VM to snapshot** - Allows returning the virtual machine to the state captured in the snapshot. It is useful if you implemented any changes to the VM and they went wrong. You can easily restore the VM to its previous state using this action. Select "Revert VM to snapshot" by clicking |revert icon| and confirm your action in the dialog window. The VM will be reverted.
ru: **Вернуть ВМ к снимку** — позволяет вернуть виртуальную машину к состоянию снимка. Действие полезно, если вы применили к машине изменения и что-то пошло не так, как планировалось. Тогда с помощью этого действия можно быстро восстановить машину до состояния снимка.

source: The machine cannot be reverted to the snapshot state if the current Service Offering of the VM differs from that used at the moment the snapshot was taken. Besides, the action is not available for stopped machines.
ru: Нельзя вернуть машину к состоянию снимка, если вычислительное предложение машины отличается от того, что использовалось на момент создания снимка. Также, опция недоступна для машин в статусе "Остановлена".

source: **Delete** - Allows deleting a snapshot from the system.
ru: **Удалить** — позволяет удалить снимок.

source: **Create Snapshot**
ru: **Создать снимок ВМ**

source: Taking a VM snapshot is available for machines in the Running state only. The maximum number of VM snapshots can be defined in the configuration file (see the `configuration guide <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#vm-snapshots-limit>`_).
ru: Создание снимка ВМ возможно только для машин в статусе "Запущенная". Максимальное количество снимков ВМ можно задать в файле конфигурации (см. `руководство по конфигурации <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#vm-snapshots-limit>`_).

source: To create a snapshot click '+' and fill in the appeared form:
ru: Чтобы создать снимок, нажмите '+' и заполните поля формы:

source: Name - Enter a name for the snapshot.
ru: Имя — введите имя снимка.

source: Description - Provide a short description for the snapshot.
ru: Описание — дайте краткое описание снимка.

source: Snapshot memory - Check the box to snapshot the VM CPU and memory, i.e. a snapshot of the *DiskAndMemory* type. Currently, it is activated by default and is not editable.
ru: Снимок памяти — включите данную опцию, чтобы сделать снимок ЦП и памяти, т.е. создать снимок типа *DiskAndMemory*. На данный момент она включена по умолчанию, т.к. поддерживается создание снимков только типа *DiskAndMemory*.

source: Once all fields are completed, click CREATE to save the snapshot.
ru: Заполнив все поля нажмите "СОЗДАТЬ" для сохранения нового снимка.

source: The VM will be paused for creating a snapshot and then resumed. The snapshot will appear in the list of VM snapshots.
ru: ВМ будет приостановлена на момент создания снимка. Снимок появится в списке снимков ВМ.

source: To drop the snapshot creation, click CANCEL.
ru: Чтобы отменить создание снимка, нажмите ОТМЕНИТЬ.

source: Storage Tab
ru: Вкладка "Диски"

source: The second tab - Storage - contains the information on the volumes allocated to the virtual machine as well as snapshots created for the volumes.
ru: Во второй вкладке — "Диски" — содержится информация о дисках, выделенных для ВМ, а также о снимках дисков, если они есть.

source: In this tab the following information is presented:
ru: Здесь доступна следующая информация:

source: **Disk information**
ru: **Информация о диске**

source: Each VM has a root disk. Besides, data disks can be added to the VM.
ru: Каждая ВМ создается с root-диском. Кроме этого, к машине можно присоединить дополнительный диск данных.

source: The following general information on a root disk is presented (expand the card to see the whole list):
ru: Для root-диска представлена следующая информация (разверните карточку, чтоб увидеть полный список данных):

source: Name - The disk name.
ru: Имя — Имя диска.

source: Size - The disk size.
ru: Размер — Размер диска.

source: Creation Date and Time.
ru: Дата и время создания.

source: Storage Type (Shared/Local).
ru: Тип хранилища (общее/локальное).

source: Last Snapshot information.
ru: Информация о последнем сделанном снимке.

source: Action Box.
ru: Список действий.

source: **Attach a volume** - Allows attaching a data disk to the VM.
ru: **Присоединить диск** — Позволяет присоединить дополнительный диск к ВМ.

source: Attaching volumes available for machines in the «Running» status only. Attaching a volume is not available for machines with active snapshots.
ru: Нельзя присоединить диск, если у машины есть активные снимки или машина остановлена.

source: Additional volume (a data disk) can be attached to the VM. Click "Select" to select a data disk. Select a disk in the drop-down list and click "SELECT".
ru: К ВМ можно присоединить дополнительный том (диск данных). Нажмите "Выбрать", чтобы выбрать диск. Выберите диск в списке и нажмите "Выбрать".

source: The chosen data disk will appear for the virtual machine with the "Attach" button. Click "Attach" to attach the selected disk to the virtual machine.
ru: Выбранный диск появится в карточке. Нажмите "Присоединить" рядом с названием диска в карточке. Диск будет присоединен к машине.

source: If there are no available spare drives yet, you can create one right from this panel.
ru: Если в системе нет доступных дисков, Вы можете создать его прямо из панели информации.

source: Click "Create new volume" and you will be moved to the Storage section. A "New volume" form will appear where you should specify the following information:
ru: Нажмите "Создать новый диск". Вы перейдете в раздел *Хранилище*. Появится форма создания диска, где необходимо указать:

source: Name * - Name of the new data disk.
ru: Название * — укажите имя нового дополнительного диска.

source: Zone * - Select a zone for it from the drop-down list.
ru: Зона * — выберите зону для него из ниспадающего списка.

source: Disk offering * - Select a disk offering from the list in the modal window. The disk offering list is managed by Root Administrator.
ru: Дисковое предложение * — кликните "ВЫБРАТЬ" и выберите дисковое предложение из открывшегося списка. Список дисковых предложений задается Администратором.

source: Size - Set the disk size if it is available. Disk size can be changed if a custom disk offering is selected above.
ru: Размер — установите размер диска, если это доступно. Размер диска можно изменить, если выбрано дисковое предложение, настраиваемое пользователем.

source: Once all fields are filled in, click "CREATE" to save the new volume.
ru: Заполнив все поля нажмите "СОЗДАТЬ" для сохранения нового диска.

source: Click "CANCEL" to drop the new volume creation.
ru: Нажмите "ОТМЕНА", чтобы сбросить все настройки и отменить создание диска.

source: Move back to the virtual machine information sidebar. Under the "Storage" tab in the "Attach a volume" section click "+" to select an additional disk. Select a data disk in the drop-down list and click "Select" to add it to the "Attach a volume" section. To attach the volume press the "Attach" button.
ru: Вернитесь обратно к информационной панели виртуальной машины. Во вкладке "Диски" в карточке *Добавить диск* кликните "+", чтобы выбрать дополнительный диск. Выберите дополнительный диск из ниспадающего списка и нажмите "Выбрать", чтобы диск появился в карточке. Теперь присоедините диск к ВМ, нажав кнопку "Присоединить".

source: Volume Action Box
ru: Список действий с диском

source: For each volume, the Actions list can be opened by clicking the actions icon |actions icon|.
ru: Для каждого диска можно открыть список действий, кликнув |actions icon|.

source: The following actions on disks are available in this list:
ru: В списке доступны следующие действия для дисков:

source: For root disks:
ru: Для корневых дисков:

source: Take a snapshot;
ru: Сделать снимок;

source: Set up snapshot schedule;
ru: Установить расписание для снимков;

source: Resize the disk.
ru: Изменить размер диска.

source: For data disks:
ru: Для дополнительных дисков:

source: Detach;
ru: Отсоединить;

source: Resize the disk;
ru: Изменить размер диска;

source: Delete.
ru: Удалить.

source: **Take a snapshot**
ru: **Сделать снимок**

source: You can take a VM snapshot to preserve all the VM’s data volumes as well as (optionally) its CPU/memory state. This is useful for quick restore of a VM.
ru: Для сохранения всех дисков ВМ, а также состояния ее памяти можно сделать снимок дисков ВМ. Из снимка можно быстро восстановить диски машины.

source: Click "Take a snapshot" in the disk Actions list and in the dialog window enter the following information:
ru: Нажмите "Сделать снимок" в списке действия к диску и в диалоговом окне введите:
