Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-VirtualMachines.po
Languages: ru

source: **VM host name** - This is a hostname for the machine. It will be shown only in the Virtual Machine tab of the VM details sidebar. The field is optional. You can enter any name you wish but it should start with a Latin letter, contain figures, Latin letters and ‘-’ (up to 63 symbols) and be unique within the zone. If the field is left empty, the system auto-generates a name in the following form: ``vm-<UID>``.
ru: **Имя хоста** — имя хоста для машины. Оно будет отображаться только в разделе общей информации о машине в панели деталей. Поле необязательно к заполнению. Вы можете задать любое имя, которое начинается с буквы латинского алфавита, содержит буквы, цифры и "-" (максимум 63 символа) и является уникальным в рамках выбранной зоны. Если поле оставить пустым, система автоматически сгенерирует имя в формате ``vm-<UID>``.

source: **Group** - Select a group from the drop-down list. Or create a new group by typing its name right in the field. If no group is assigned, a *Default group* will be displayed for this machine.
ru: **Группа** — выберите группу из ниспадающего списка. Или создайте новую группу, вписав ее название прямо в поле. Если группа не определена для машины, в поле "Группа" будет отображаться *Группа по умолчанию*.

source: **Affinity group** - Select an affinity group in the list or create a new group filling in the form. By clicking "SELECT" in the block you open a form with the list of existing groups and a creation block above the list.
ru: Аффинитетная группа — выберите аффинитетную группу в списке или создайте новую группу, заполнив форму. Нажмите "ВЫБРАТЬ" в блоке. Откроется форма со списком групп и блоком создания группы над списком.

source: **Create an Affinity group**. To create a new affinity group you should fill in the form at the top of the dialog box:
ru: **Создать аффинитетную группу**. Для создания группы заполните форму в верхней части формы:

source: Name * - Enter a name for the group. The name should contain letters, figures, start with a letter and should not contain spaces. Maximum length is 63 symbols.
ru: Имя * — введите имя группы. Оно может содержать буквы, цифры, должно начинаться с буквы и не должно содержать пробелов. Максимальная длина — 63 символа.

source: Type * - Select type of the group - "anti-affinity" or "affinity".
ru: Тип * — выберите тип группы - «аффинитетная» или «анти-аффинитетная».

source: Description - Provide a short description. Maximum length is 63 symbols.
ru: Описание — введите краткое описание для группы. Максимальная длина — 63 символа.

source: Click "+" to add the new group with the specified settings to the list.
ru: Нажмите "+", чтобы создать группу с заданными настройками.

source: **Select a group**. Click on a group in the list and press "SELECT".
ru: **Выбрать группу**. Выберите группу в списке и нажмите «ВЫБРАТЬ».

source: What an affinity group is you can read in the `official documentation <http://docs.cloudstack.apache.org/en/4.11.1.0/adminguide/virtual_machines.html?highlight=Affinity%20group#affinity-groups>`_.
ru: Что такое аффинитетная группа, можно узать из `официальной документации <http://docs.cloudstack.apache.org/en/4.11.1.0/adminguide/virtual_machines.html?highlight=Affinity%20group#affinity-groups>`_.

source: **Firewall rules** - Allows to select a security group for the machine. A default security group, if it is defined in `the configuration file <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-security-group-name>`_, is selected by default. If you want to change it, click "EDIT" to select another security group for the VM. In the appeared window choose between "Create new" or "Select Shared" options.
ru: **Правила брандмауэра** - выберите группу безопасности для машины. В блоке отображается группа безопасности, заданная по умолчанию в `файле конфигурации <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-security-group-name>`_. Чтобы изменить ее, нажмите «РЕДАКТИРОВАТЬ» , чтобы задать группу безопасности для ВМ. В появившемся окне выберите «Создать» или «Выбрать общую».

source: **Create a new security group**
ru: **Создать новую группу безопасности**

source: A new security group can be created on the base of templates. This security group will be created as a *private* group used for this VM only.
ru: Новая группа безопасности создается на основе выбранных шаблонов. Эта группа безопасности будет создана как *частная* группа, используемая только для данной ВM.

source: When creating a new security group, you can see the templates in the "All templates" section of the modal window. To form your custom security group, select a template in the "All templates" list at the left and move it to the "Selected templates" list at the right by clicking the arrow icon:
ru: Создавая новую группу безопасности, Вы увидите шаблоны в списке "Все шаблоны" слева. Выберите шаблон и переместите его в список "Выбранные шаблоны" справа, кликнув на стрелку:

source: Click "SELECT ALL" to move all templates from left to right at once.
ru: Кликните "ВЫБРАТЬ ВСЕ" чтобы одновременно переместить все шаблоны слева направо.

source: Click "RESET" to drop all selected templates.
ru: Кликните "СБРОСИТЬ", чтобы сбросить все выбранные шаблоны.

source: In the list below you will see the rules corresponding to the selected templates. All of them are checked as selected. Uncheck those you do not wish to add to your VM as firewall rules.
ru: В списке ниже Вы увидите правила, соответствующие выбранным шаблонам. Все они отмечены как выбранные. Снимите флажок с тех, которые Вы не хотите добавлять к создаваемой ВM в качестве правил группы безопасности.

source: Click "SAVE" to apply the selected rules to your virtual machine.
ru: Нажмите "СОХРАНИТЬ", чтобы применить выбранные правила к виртуальной машине.

source: Click "CANCEL" to drop the selected options. No rules will be assigned to the virtual machine. You will return to the "Create new virtual machine" window.
ru: Нажмите "ОТМЕНИТЬ", чтобы сбросить выбранные варианты. Правила не будут заданы для виртуальной машины. Вы вернетесь к форме создания виртуальной машины.

source: **Select Shared security group**
ru: **Выбрать общую группу безопасности**

source: If you would like to select an existing group of firewall rules, you can click the "Select Shared" option and tick those groups in the list that you want to assign to your VM. The security groups in the *Shared* list are used by other VMs in the domain. That means you won't be able to uncheck some rules in the group that you do not want to include into the list (like at creating VM from a template). You can assign only the whole shared security group to your VM.
ru: Если Вы хотите бы выбрать существующую группу правил брандмауэра, Вы можете нажать "Выбрать общую" и пометить те группы в списке, который Вы хотите задать для ВМ. Группы безопасности в этом списке используются другими ВМ в домене. Это означает, что Вы не сможете отключить отдельные правила группы, если Вы не хотите включать их в группу безопасности (как при создании VM из шаблона). Вы можете назначить для ВМ только всю группу безопасности целиком.

source: You can edit a shared security group after the VM is created. In the *Network* tab of the VM details sidebar the assigned shared security group(s) can be viewed and edited. Please, find more information on security group editing in the :ref:`VM_Network_Tab` section.
ru: Отредактировать общую группу безопасности можно после создания ВМ. Во вкладке *Сеть* информационной панели ВМ можно посмотреть и редактировать выбранную общую группу (группы) безопасности. Больше информации о редактировании группы безопасности вы найдете в разделе :ref:`VM_Network_Tab`.

source: Click "Cancel" to drop the selected options. No rules will be assigned to the virtual machine.
ru: Нажмите "ОТМЕНИТЬ", чтобы сбросить все выбранные варианты. Правила не будут заданы для виртуальной машины.

source: **SSH keypair** - Select an SSH keypair. The list of keys contains the SSH keys available for the account under which the VM is being created. Find more information on SSH keys in the :ref:`SSH_Keys` section.
ru: **SSH ключ** — выберите ключ SSH. Список ключей содержит те ключи, которые доступны для аккаунта, в котором создана ВМ. См. подробнее о ключах безопасности в разделе :ref:`SSH_Keys`

source: **Start VM** - Tick the box to start the VM right after its deployment. If this option is activated, the VM acquires an IP and a password (if required by the template). If it is not, the machine IP is not available till VM is started, no password is assigned to it.
ru: **Запустить ВМ** — поставьте здесь галочку, если Вы хотите запустить ВМ сразу после ее создания. При активации данной опции виртуальной машине будет присвоен IP и пароль (если это задано в настройках шаблона). Если данная опция не активирована, IP машины будет недоступен до запуска ВМ. Пароль, если он требуется настройками, также не будет присваивается машине до ее запуска.

source: In the *VM UserData* tab you can add any custom data for the machine. It allows adding necessary settings to the machine and deploying it configured with necessary services. In this tab, you will find a text area, where you can enter the configurations in any format. The maximum allowed size of data is 32 KB.
ru: Во вкладке *UserData ВМ* можно добавить любые пользовательские данные к настройкам машины. Это позволяет передать дополнительные настройки внутрь виртуальной машины и развернуть машину с нужными сервисами. User data добавляется при создании ВМ в любом формате. Максимальный размер данных - 32 Кбайт.

source: Once all fields are filled in, click "Create".
ru: После заполнения всех полей нажмите "СОЗДАТЬ".

source: For some templates/ISOs used at VM creation you are offered to accept a "Template/ISO Terms and Conditions Agreement". An administrator is able to specify an agreement for a template or ISO. An agreement may determine, for example, software licensing terms or restrictions on the liability of the software template vendor. A user must confirm it to continue VM installation from a chosen source.
ru: Для некоторых шаблонов/ISO, используемых при создании ВМ, Вам предлагается принять условия договора на использование выбранного шаблона или ISO. Администратор может определить в таком соглашении, например, программное обеспечение, условия лицензирования или ограничения ответственности продавца шаблонов программного обеспечения. Пользователь должен согласиться с этими условиями, чтобы продолжить установку ВМ на основании выбранного источника.

source: If you are creating a virtual machine on the base of a template/ISO that requires an agreement, read the terms in the appeared window and click "I AGREE" to continue.
ru: Если Вы создаете виртуальную машину на основе шаблона/ISO, который требует соглашения, прочитайте условия в появившемся окне и нажмите "СОГЛАСЕН", чтобы продолжить.

source: Or click "CANCEL" to close the terms and move back to the creation form. Change the installation source.
ru: Или нажмите "ОТМЕНИТЬ", закройте условия и вернитесь к форме создания ВМ. Выберите другой источник установки для создания ВМ.

source: After clicking "CREATE", a dialog window will appear where you can monitor the VM creation process: security group creation, virtual machine deployment, template tags copying, etc. These procedures are fulfilled one by one. A procedure in progress is marked with a spinner in the message. In case of an error occurring at any VM creation step, a user can understand at what step it has happened.
ru: После нажатия "Создать" появится диалоговое окно, где Вы можете наблюдать процесс создания и установки ВМ: создание группы безопасности, установку ВМ, копирование тегов шаблонов, др. Эти процессы выполняются последовательно. Выполняемый в данный момент процесс отмечен индикатором выполняемого процесса. В случае возникновения ошибки на каком-либо шаге создания ВМ, пользователь сможет понять, в каком именно процессе произошла ошибка.

source: Once the VM creation process finishes, the success message will inform you of that.
ru: По окончании создания ВМ появится сообщение об успешном создании ВМ.

source: The message will show the list of all creation steps and the virtual machine information:
ru: В сообщении будет указан список всех шагов создания ВМ и информация о ней:

source: VM name and IP (if it is available),
ru: Имя ВМ и IP (если он доступен),

source: VM Password - This field appears after the VM creation if a password is enabled for the template used for creating this machine. A password is autogenerated. Click "SAVE" next to it in the dialog window if you want to save it for this VM. The password will be saved to the VM tags. You can see the saved password later by clicking "Access VM" in the Actions box for this machine.
ru: Пароль ВМ — Пароль создается автоматически после создания ВМ, если пароль задан для шаблона, используемого для создания этой машины. Нажмите "СОХРАНИТЬ" рядом с паролем в диалоговом окне, если Вы хотите сохранить пароль для данной ВМ. Пароль будет сохранен в теги виртуальной машины. Просмотр сохраненного пароля возможен при нажатии "Доступ к ВМ" в списке Действий для данной машины.

source: The system will ask you if you wish to save passwords to VM tags by default for the virtual machines created in the future. Click "Yes" and the "Save VM password by default" option will be activated in the account settings:
ru: При сохранении пароля система спросит, хотите ли Вы сохранять пароли в теги для будущих ВМ по умолчанию. Нажмите "Да", и в настройках учетной записи будет активирована опция "Сохранять пароль ВМ по умолчанию":

source: It means the password will be saved to tags automatically for all created virtual machines.
ru: Это означает, что пароли для всех созданных виртуальных машин будут сохраняться в теги ВМ автоматически.

source: From this window, you can access the VM opening VNC console.
ru: Также, из окна сообщения Вы можете открыть консоль для работы с ВМ, нажав "Доступ к ВМ".

source: Close the dialog window and make sure the newly created VM is in the list of virtual machines.
ru: Закройте диалоговое окно и удостоверьтесь, что недавно созданная ВМ находится в списке виртуальных машин.

source: Click "CANCEL" to drop the VM creation.
ru: Нажмите "ОТМЕНИТЬ", чтобы закрыть окно создания ВМ без сохранения новой ВМ.

source: Below, we have summarized possible issues that may take place at VM creation.
ru: Ниже представлены некоторые ошибки, которые могут возникнуть при создании виртуальной машины.

source: Possible Issues When Creating a Virtual Machine
ru: Возможные трудности при создании ВМ

source: You can face the following issues when creating a virtual machine:
ru: При создании виртуальной машины Вы можете столкнуться со следующими проблемами:

source: Lack of resources.
ru: Недостаток ресурсов.

source: An important thing in CloudStack-UI is that the system immediately checks that a user has the amount of resources required to create a virtual machine. It does not allow launching the creation of a VM which will fail for sure because of the resource lack.
ru: Важный аспект в CloudStack-UI заключается в том, что система немедленно проверяет, есть ли у пользователя ресурсы, требуемые для создания виртуальной машины. Система не позволяет начинать создание ВМ, для запуска которой не хватит ресурсов.

source: If you lack the required amount of resources, the message will appear when clicking "Create Virtual Machine":
ru: Если необходимого количества ресурсов не достаточно, при нажатии на кнопку создания ВМ появится сообщение:

source: "Insufficient resources. You ran out of Primary storage."
ru: "Недостаточно ресурсов. Нет места в Основном хранилище."

source: No VM creation form is available.
ru: В этом случае форма создания ВМ будет не доступна.

source: VM host name you specified is not unique.
ru: Имя хоста ВМ не уникально в пределах выбранной зоны.

source: If the name specified for the virtual machine is not unique within a zone, the dialog window after VM creation will show an error. The VM will not be created. The creation form will be closed. You will have to open the VM creation form and fill it in again. You will have to specify another host name for your VM or leave it empty to let the system autogenerate a correct unique host name in the form of ``vm-<UID>``.
ru: Если имя, определенное для виртуальной машины, не уникально в пределах выбранной зоны, в диалоговом окне после создания ВМ появится ошибка, ВМ не будет создана, форма создания ВМ закроется. Вам придется открыть форму создания ВМ и заполнить ее снова. Вы должны будете ввести другое имя хоcта для ВМ или оставить ее пустой, тогда система автоматически создаст имя хоста ВМ в формате ``vm-<UID>``.

source: View API logs at VM creation failures
ru: Просмотр логов API при ошибках в создании ВМ

source: In case an error occurs at VM creation, the dialog box shows the text of the error. Next to it, there is the “Details” button. By clicking it you can open a list of raw logs including JSON requests to the server with their statuses. They can be easily copied by clicking the copy icon below.
ru: В случае возникновения ошибки при создании виртуальной машины текст ошибки отображается в диалоговом окне. Ниже расположено ниспадающее окно "Детали". Кликом на него открывается окно, в котором можно просмотреть необработанные запросы к серверу и ответы на них. Детали ошибки можно скопировать кликом на |copy icon| ниже.

source: We implemented this feature to provide access to raw API logs and allow you to copy them and address the support service to get assistance in solving the problem in the shortest time.
ru: Мы реализовали просмотр логов API, чтобы дать вам возможность скопировать их и, например, обратиться в службу технической поддержки для более быстрого решения проблемы.

source: VM Action Box
ru: Список действий с ВМ

source: Once a VM instance is created, you can stop, restart, or delete it as needed. These actions are available under the "Actions" button |actions icon| to the right from each virtual machine in the list.
ru: Как только ВМ создана, ее можно остановить, перезапустить или удалить по мере необходимости. Эти действия доступны под кнопкой "Действия" |actions icon| справа для каждой виртуальной машины в списке.

source: It allows performing the following actions with the VM:
ru: Вы можете совершать следующие действия с ВМ:

source: **Start VM** - Allows a user to launch a VM,
ru: **Запустить ВМ** — позволяет пользователю запустить ВМ,

source: **Stop VM** - Allows a user to stop a running VM,
ru: **Остановить ВМ** — позволяет пользователю остановить запущенную ВМ,

source: **Reboot VM** - Allows a user to restart a VM,
ru: **Перезапустить ВМ** — позволяет пользователю перезапустить ВМ,

source: **Reinstall VM** - Allows a user to reinstall a VM,
ru: **Переустановить ВМ** — позволяет пользователю заново переустановить ВМ,

source: **Destroy VM** - Allows a user to delete a VM. After deleting the virtual machine will remain in the system. It will look faded in the list and can be recovered later.
ru: **Удалить ВМ** — позволяет пользователю удалить ВМ. После удаления машина еще остается в системе, но в списке она выделена серым цветом. Позднее машину можно восстановить.

source: To recover a destroyed VM (which is not expunged) open the Actions list and click "Recover".
ru: Чтобы восстановить удаленную машину (которая еще не уничтожена), откройте список действий и кликните "Восстановить".

source: Click "Expunge" to completely destroy the VM. The VM will not be available for recovering anymore.
ru: Нажмите "Уничтожить" для полного удаления ВМ из системы без возможности последующего восстановления.

source: When deleting a virtual machine, if the machine has data disks attached, the system will ask you in a dialog window whether these disks should be deleted. If data disks have snapshots, you will be offered to delete the snapshots as well by activating a "Delete snapshots" option in the dialog.
ru: Если у машины есть диски, система спросит в диалоговом окне, следует ли удалить диски машины. Если у дисков есть снимки, система также предложит удалить снимки, активировав опцию "Удалить снимки".

source: Confirm your intention to delete disks (and snapshots) by clicking "Yes". Click "No" to cancel the disk (and snapshots) deleting.
ru: Подтвердите свое желание удалить диски (и снимки), нажав "Да". Нажмите "Нет" для отмены удаления дисков (и снимков).

source: **Reset password** - Allows a user to change the password for VM (available for started VMs only in case a VM requires a password). The VM will be rebooted if you reset the password.
ru: **Изменить пароль** — позволяет пользователю изменить пароль ВМ (доступно только для запущенных ВМ в случае, если пароль необходим для данной ВМ).

source: After clicking "Yes" the VM will be rebooted and a new password will be autogenerated for it. You will see the new password in the dialog window.
ru: После нажатия "Да" в диалоговом окне ВМ будет перезапущена, и для нее будет сгенерирован новый пароль, который появится в диалоговом окне.

source: Click "Save" to save the password for this VM. It will activate the "Save VM passwords by default" option in the *Settings* section (see :ref:`Settings_VMPass`). In the future the password will be saved automatically right at VM creation. Click "OK" to close the dialog window.
ru: Нажмите "Сохранить", чтобы сохранить пароль для ВМ. При этом включится опция "Сохранять пароли ВМ по умолчанию" в разделе "Настройки" (см. подробнее :ref:`Settings_VMPass`). Позднее, пароли для ВМ будет автоматически сохраняться при создании машин. Нажмите "ОК", чтобы закрыть диалоговое окно.

source: **Access VM** - Opens an "Access VM" dialog window which allows to view VM name and IP, view and save a password for the VM and access the VM via the VNC console.
ru: **Доступ к ВМ** — открывает диалоговое окно "Доступ к ВМ", которое позволяет просматривать имя ВМ и IP, а также сохраненный пароль ВМ, и дает доступ к ВМ через VNC консоль, по SSH или HTTP, в зависимости от настроек машины.

source: In the :ref:`VM_Access` section you can find more information on accessing a VM.
ru: В разделе :ref:`VM_Access` подробно описаны возможные варианты доступа к ВМ.

source: **System Logs** - This option is available if the Log View plugin is activated via the configuration file. It allows creating and managing a secret token required for secure publishing of VM logs (see more details in `the plugin documentation <https://github.com/bwsw/cloud-plugin-vm-logs#filebeat-63>`_).
ru: **Cистемные журналы** — данная опция доступна в меню, если плагин Log View подключен через конфигурационный файл. Она позволяет создать и управлять секретным токеном, необходимым для безопасной публикации журналов ВМ (подробнее читайте в `документации плагина <https://github.com/bwsw/cloud-plugin-vm-logs#filebeat-63>`_).

source: Under the System Logs submenu of the Action box a user can select between two actions:
ru: В дополнительном меню "Системные журналы" можно выбрать одно из действий:

source: Create token - Allows creating a token. When selected, it asks to confirm the action and opens a modal window with the newly created token:
ru: Создать токен — позволяет создать новый токен. Выберите данное действие и подтвердите его в диалоговом окне. Появится модальное окно, в котором отображается созданный токен:

source: The created token can be copied by clicking COPY.
ru: Созданный токен легко скопировать в буфер обмена, кликнув КОПИРОВАТЬ.
