Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-VirtualMachines.po
Languages: ru

source: The three access modes can be used at the same time for one machine.
ru: Все три режима доступа могут использоваться для одной ВМ одновременно.

source: You can find more information on how to enable a necessary access mode at the `wiki-page <https://github.com/bwsw/cloudstack-ui/wiki/Access-VM:-Supported-Modes>`_.
ru: Подробная информация о настройке помощников доступа к ВМ представлена на странице `wiki <https://github.com/bwsw/cloudstack-ui/wiki/Access-VM:-Supported-Modes>`_ в репозитории проекта.

source: Selecting "Access VM" in the VM action list, you open a modal window with three tabs. The view and contents of the modal window are determined by the defined tags. Some tabs in the window can be inactive. That means these access modes are not enabled for the machine. In active tab(s) you can view detailed access information for the machine: login, password, port, path and other.
ru: Выбирая действие "Доступ к ВМ" в контекстном меню машины, вы открываете модальное окно с тремя вкладками. Заданные теги определяют доступность информации во вкладках и ее содержание. Некоторые вкладки могут быть недоступны. Это значит, что для машины данный режим доступа отключен. В активных вкладках можно просматривать реквизиты доступа к ВМ: логин, пароль, порт, путь и другие.

source: In each tab you can click on a corresponding link to open a console or a window to access the VM.
ru: В каждой вкладке предоставлена соответствующая ссылка, кликом на которую можно открыть консоль/окно доступа по SSH/окно доступа по URL.

source: Below you will find more information on each access mode.
ru: Ниже более подробно описан каждый помощник доступа к ВМ.

source: VNC console
ru: Доступ через VNC консоль

source: This tab contains the following details:
ru: В данной вкладке содержится следующая информация:

source: Login;
ru: Логин;

source: Password (if available);
ru: Пароль (если он доступен);

source: Open VNC console link that opens a console to access the VM.
ru: Ссылка, чтобы открыть VNC консоль для доступа к ВМ.

source: SSH
ru: Доступ по SSH

source: This tab is active if the access via SSH is enabled. It is determined by the following template tags::
ru: Данная вкладка активна, если для машины включен доступ по SSH. Включить его можно через следующие теги в шаблоне ВМ::

source: This tab displays the following details:
ru: Данная вкладка отображает следующую информацию:

source: Connection String (IPv4), that can be copied by clicking on |copy icon|.
ru: Строка подключения (IPv4), которую можно скопировать кликом на |copy icon|.

source: Connection String (IPv6), that can be copied by clicking on |copy icon|.
ru: Строка подключения (IPv6), которую можно скопировать кликом на |copy icon|.

source: Port
ru: Порт

source: Login
ru: Логин

source: Password
ru: Пароль

source: SSH Key
ru: SSH ключ

source: Open WebShell - a clickable link to open a WebShell console.
ru: Открыть WebShell — активная ссылка, чтобы открыть консоль WebShell.

source: In case the WebShell plugin is enabled, a user can SSH to VM in browser. To find more information on deployment and using the WebShell plugin, please, refer to the `page <https://github.com/bwsw/cloudstack-ui/wiki/WebShell-Plugin>`_.
ru: При включенном расширении WebShell пользователь может подключиться к машине по SSH через браузер. Подробнее об установке и использовании плагине WebShell см. `страницу плагина <https://github.com/bwsw/cloudstack-ui/wiki/WebShell-Plugin>`_.

source: HTTP
ru: Доступ по HTTP

source: Under this tab you can access a VM via HTTP/HTTPS URL. This mode is defined by the tags::
ru: Из данной вкладки можно получить доступ к ВМ через HTTP/HTTPS URL. Данный режим доступа включается при определении следующих тегов для ВМ::

source: If no ``csui.vm.http.port`` is defined, then default values are used:
ru: Если ``csui.vm.http.port`` не определен, используются значения по умолчанию:

source: for HTTPS protocol: 443
ru: для протокола HTTPS: 443

source: for HTTP protocol: 80
ru: для протокола HTTP: 80

source: This tab displays the following information:
ru: В данной вкладке доступна следующая информация:

source: Open URL with a clickable URL.
ru: Активная ссылка URL, чтобы открыть консоль.

source: To configure VM access via HTTP/HTTPS, please, refer to `page <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_.
ru: Подробнее о конфигурировании доступа к ВМ через HTTP см. на `странице <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_.

source: To close the modal window click "CLOSE".
ru: Чтобы закрыть модальное окно, нажмите "ЗАКРЫТЬ".
