Repository: bwsw/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/CSUI-Settings.po
Languages: ru

source: Settings
ru: Настройки

source: In the *Accounts* -> *Settings* section a user can modify the interface by changing settings. The interface settings are presented in separate sections: *Security, API configurations, VM preferences, Look and Feel, Account tags, User tags*. Moving between sections is possible using the switcher above.
ru: В разделе *Аккаунты -> Настройки* пользователь может менять настройки интерфейса. Все настройки разделены по разделам: *"Настройки безопасности", "Конфигурации API", "Настройки ВМ", "Настройки интерфейса", "Теги аккаунта", "Теги пользователя".* Для перемещения между разделами используется переключатель вверху.

source: Security
ru: Безопасность

source: In this section a user can manage the following security settings:
ru: В этом подразделе пользователь может управлять следующими настройками безопасности:

source: Change password;
ru: Изменение пароля;

source: Set the session timeout interval;
ru: Лимит времени сеанса;

source: the "Save VM passwords by default" option.
ru: Опция "Сохранять пароли ВМ по умолчанию"

source: Change Password
ru: Изменение пароля

source: Here you can change the password provided by your Administrator to the one you like. This will improve the account security.
ru: В данной секции можно изменить пароль, предоставленный Администратором, на желаемый пароль, что может улучшить безопасность аккаунта.

source: Enter a new password and re-enter it in the next field to confirm it:
ru: Введите новый пароль и подтвердите его во втором поле:

source: Click "UPDATE" to save the new password.
ru: Нажмите "ОБНОВИТЬ" и сохраните новый пароль.

source: In case you have lost or forgotten your password, contact your Administrator.
ru: Если Вы забыли или потеряли пароль, обратитесь к Администратору.

source: Session Timeout
ru: Лимит времени сеанса

source: Here you can specify the maximum amount of time that an active session can be idle (without user activity) before it automatically closes. The default interval is 30 minutes.
ru: В данной секции можно установить максимальное количество времени в минутах, в течение которого сессия будет оставаться активной в отсутствие действий пользователя. По истечение установленного времени сессия будет автоматически завершена. По умолчанию установлен интервал 30 минут.

source: Set the desired time limit in minutes using the switch button |switch icon| to the right or typing it just into the field. Then click "UPDATE" to save the changes.
ru: Установите желаемый лимит вермени в минутах, используя переключатель |switch icon| справа или посредством ввода значения в поле. Затем нажмите "ОБНОВИТЬ", чтобы сохранить изменения.

source: The value is stored in user’s tags.
ru: Установленное значение сохраняется в теги пользователя.

source: The maximum allowed value is 300 minutes. Please, note that a long time period of an idle session decreases the account security.
ru: Максимальное разрешенное значение - 300 минут. Обратите внимание, что более длительный период сессии снижает безопасность аккаунта.

source: The session timeout can be set in the configuration file. You will find more information in the `configuration guide <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#session-timeout>`_.
ru: Лимит времени сеанса можно установить в конфигурационном файле. См. подробнее `руководство по конфигурациям <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#session-timeout>`_.

source: Save VM passwords by default
ru: Сохранять пароли ВМ по умолчанию

source: This checkbox allows saving passwords to VM tags automatically for all created virtual machines requiring passwords.
ru: Данная опция позволяет автоматически сохранять пароли в теги ВМ при создании машин, для которых необходимы пароли.

source: Tick this option here. The passwords will be saved to VM tags right at the moment VMs are created. You will see a password (if it is required for the VM) is marked as saved in a dialog window after the new VM is deployed:
ru: Активируйте опцию в данной секции. При создании машины пароли сразу будут сохранятся в теги ВМ. В диалоговом окне создания ВМ пароль (если он требуется для данной ВМ) будет отмечен как сохраненный:

source: If this option is not activated, every time when creating a machine the system will ask you to save the password by clicking "SAVE" next to it:
ru: Если данная опция не активирована, каждый раз при создании ВМ система будет спрашивать о необходимости сохранить пароль, нажав "СОХРАНИТЬ" рядом с паролем:

source: Then the system will ask you if you wish to save passwords to VM tags automatically. If you click "Yes", the "Save VM passwords by default" option will be activated in *Settings*. You will find more information about VM creation in the :ref:`Create_VM` section.
ru: Затем система спросит, нужно ли автоматически сохранять пароли ВМ. Кликнув "Да", Вы активируете опцию "Сохранять пароли ВМ по умолчанию" в разделе *Настройки*. См.подробнее о создании ВМ в разделе :ref:`Create_VM`.

source: API Configuration
ru: Конфигурация API

source: In this block of settings you can see and manage the API configurations: regenerate API keys, see the connection URL, get the link to the Apache CloudStack API documentation.
ru: В данном блоке настроек можно просматривать и управлять настройками API: создать новые ключи API, просматривать URL подключения, перейти к официальной документации по API Apache CloudStack.

source: For users with no API keys, the system autogenerates the keys when a user logs in if this option is enabled in the configuration file. Find more information in `the configuration guide <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#automatically-generate-secret-key-and-api-key-for-users>`_.
ru: Для автоматического создания ключей API для пользователей, не имеющих ключей, можно через конфигурационный файл включить опцию, которая позволяет автоматически создавать ключ API и секретный ключ при входе пользователя в систему . Подробнее об этой настройке можно прочитать в `руководстве по конфигурациям <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#automatically-generate-secret-key-and-api-key-for-users>`_.

source: You can see an API key and a Secret key in corresponding fields. You can copy any of them clicking |copy icon| to the right.
ru: Ключ API и Секретный ключ отображаются в соответствующих полях. Их можно скопировать нажатием на |copy icon| справа.

source: Regenerate the keys by clicking |refresh icon| above the fields. New keys will be generated.
ru: Для генерации нового ключа нажмите |refresh icon| вверху блока. В соответствующих полях появятся новые открытый и закрытый ключи.

source: Below you can view a connection URL which is used to send requests to CloudStack API. All requests are listed in the Apache CloudStack documentation available by the link.
ru: В поле ниже отображается URL подключения, используемая для отправки запросов в CloudStack API. С полным перечнем используемых запросов можно ознакомиться в официальной документации Apache CloudStack, доступной по предоставленной ссылке.

source: VM preferences
ru: Настройки ВМ

source: In this block you may set up the keyboard layout.
ru: В данном блоке настроек можно задать раскладку клавиатуры для ВМ.

source: Keyboard layout
ru: Раскладка клавиатуры

source: Select a keyboard layout in the drop-down list.
ru: Выберите подходящий вариант раскладки клавиатуры из ниспадающего списка.

source: The following options are available:
ru: Доступные варианты:

source: Standard US keyboard (default value)
ru: Стандартная раскладка (США) (выбран по умолчанию)

source: UK keyboard
ru: Английская раскладка (UK)

source: Japanese keyboard
ru: Японская раскладка

source: Simplified Chinese keyboard.
ru: Упрощенная китайская раскладка

source: The selected option will appear in the VNC console kayboard layout parameter when accessing a VM via concole. The selected option is also saved to user tags.
ru: Выбранная опция появится в параметрах раскладки клавиатуры в консоли VNC при доступе к ВМ через консоль. Заданные настройки сохраняются в теги пользователя.

source: Account tags
ru: Теги аккаунта

source: In this section, you can view and manage account tags.
ru: В этом разделе можно просматривать и управлять тегами аккаунта.

source: Tags can be system or non-system. System tags are used to provide the functionality from the user interface perspective. Changing these tags affects the functionality of the application. The “Show system tags” checkbox allows to view or hide system tags of an account. Hiding system tags helps to avoid accidental unwanted changes. If a user has disabled displaying of such tags, the system will remember it and next time tags will also be hidden. Uncheck the “Show system tags” checkbox to hide system tags from the list.
ru: Теги могут быть системными и несистемными. Системные теги обеспечивают дополнительную функциональность с точки зрения пользовательского интерфейса. Изменение этих тегов может затронуть работу всего приложения. Можно включить или выключить отображение системных тегов с помощью опции «Показывать системные теги». При выключении данной опции системные теги будут скрыты из списка, что поможет избежать случайных нежелательных изменений в них. Система запомнит, что отображение системных тегов отключено, и в дальнейшем системные теги не будут отображаться в списке.

source: The following system tags can be used for accounts:
ru: Для аккаунтов используются следующие системные теги:

source: ``csui.account.ssh-description`` - Used to provide an SSH description.
ru: ``csui.account.ssh-description`` - используется для сохранения описания для ключа SSH.

source: To find the tag you are interested in, please, use the search tool above the tag list. You can enter a name or a part of the tag name to distinguish it in the list.
ru: Для быстрого поиска тега в списке воспользуйтесь инструментом поиска вверху. Введите название или часть названия тега, и оно будет выделено в списке.

source: To add an account tag click “Create” |create icon|. In the appeared form enter:
ru: Для добавления тега аккаунта нажмите «Создать» |create icon|. В появившейся форме введите:

source: Key *
ru: Ключ *

source: Value *
ru: Значение *

source: Required fields are marked with an asterisk (*). The values in the fields cannot start with a space.
ru: Обязательные поля отмечены «звездочкой» (*). Значения в полях не могут начинаться с пробела.

source: Click “Create” to assign a new tag to the account.
ru: Нажмите «СОЗДАТЬ» для добавления нового тега к аккаунту.

source: User tags
ru: Теги пользователя

source: In this section, you can view and manage user tags.
ru: В данном подразделе можно просматривать и управлять тегами пользователя.

source: Tags can be system or non-system. System tags are used to provide the functionality from the user interface perspective. Changing these tags affects the functionality of the application. The “Show system tags” checkbox allows to view or hide system tags of a user. Hiding system tags helps to avoid accidental unwanted changes. If a user has disabled displaying of such tags, the system will remember it and next time tags will also be hidden. Uncheck the “Show system tags” checkbox to hide system tags from the list.
ru: Теги могут быть системными и несистемными. Системные теги обеспечивают дополнительную функциональность с точки зрения пользовательского интерфейса. Изменение этих тегов может затронуть работу всего приложения. Можно включить или выключить отображение системных тегов с помощью опции «Показывать системные теги». При выключении данной опции системные теги будут скрыты из списка, что поможет избежать случайных нежелательных изменений в них. Система запомнит, что отображение системных тегов отключено, и в дальнейшем системные теги не будут отображаться в списке.

source: User system tags has the format of ``csui.user.<tag_name>``. You can view a full list of user tags at the `wiki-page <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_.
ru: Системные теги пользователя имеют формат ``csui.user.<tag_name>``. Просмотреть полный список тегов пользователя можно на `странице wiki <https://github.com/bwsw/cloudstack-ui/wiki/Tags>`_.

source: To add a user tag click “Create” |create icon|. In the appeared form enter:
ru: Для добавления тега пользователя нажмите «Создать» |create icon|. В появившейся форме введите:

source: Click “Create” to assign a new tag to the user.
ru: Нажмите «СОЗДАТЬ» для добавления нового тега пользователя.

source: Look and Feel
ru: Настройки интерфейса

source: In this section, you can adjust the interface look.
ru: В данном подразделе можно настроить вид интерфейса.

source: Interface Language
ru: Язык интерфейса

source: Select the language of your interface. Currently two options are available in the drop-down list: Russian and English.
ru: Выберите язык интерфейса из представленных в списке вариантов: русский или английский.

source: First Day of Week
ru: Первый день недели

source: In this block, you have the opportunity to choose between two types of weeks: Sunday - Saturday or Monday - Sunday.
ru: В данном блоке можно выбрать один из типов недели: воскресенье - суббота или понедельник - воскресенье.

source: From the drop-down list select the day when a week starts: Monday or Sanday.
ru: Выберите из ниспадающего списка день, с которого будет начинаться неделя: понедельник или воскресенье.

source: Time Format
ru: Формат времени

source: Here you have the opportunity to switch the time format from AM/PM to 24H. You can set it to "Auto" and the time format will be set in correspondence to the interface language: AM/PM if you select English and 24H if you select Russian.
ru: В данном блоке можно переключить формат времени с 12-часового на 24-часовой. При выборе варианта "Автоматически" формат времени будет установлен в зависимости от выбранного языка интерфейса: если язык интерфейса английский - 12-часовой формат; если язык интерфейса русский - 24-часовой формат.

source: Theme Color
ru: Цвет темы

source: Select a preferred theme color. Currently two options are available: "blue-red" and "indigo-pink". The blue-red one is used by default.
ru: Выберите желаемый цвет темы. В текущей реализации доступны два варианта: сине-красный или индиго-розовый. Сине-красный цвет темы используется по умолчанию.

source: Click the field and select another color if you wish.
ru: Кликните на поле и выберите желаемый цвет.

source: A theme color can be set in the configuration JSON file. You will find more information in the `configuration guide <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-theme-name>`_.
ru: Цвет темы можно установить в конфигурационном файле JSON. См.подробнее `руководство по конфигурациям <https://github.com/bwsw/cloudstack-ui/blob/master/config-guide.md#default-theme-name>`_.

source: System Logs (real-time mode)
ru: Просмотр журналов в режиме реального времени

source: This section is available if the LogView UI-plugin is activated. See the `plugin page <https://github.com/bwsw/cloudstack-ui/wiki/Log-View-Plugin>`_ for installation instructions.
ru: Данный раздел доступен, если подключен плагин Log View. Инструкцию по установке плагина можно найти на `странице плагина <https://github.com/bwsw/cloudstack-ui/wiki/Log-View-Plugin>`_.

source: In this settings block you can configure viewing VM logs in a real-time mode. The following parameters can be set:
ru: В данном разделе настроек можно задать параметра просмотра журналов ВМ в режиме реального времени. Можно задать следующие параметры:

source: Show last (minutes) - allows viewing logs for the last set period. You can set the number of minutes from 1 (default) to 10.
ru: Показывать за последние (минуты) - время, за которое вы желаете видеть записи; допустимые значения - от 1 (по умолчанию) до 10 минут.

source: Show last (messages) - allows setting a maximum amount of logs to display. You can set from 1 to any number of log records. By default, 1000 messages are shown.
ru: Максимальное количество отображаемых записей - позволяет задать максимальное число записей для показа; допустимые значения - от 1 до бесконечности. По умолчанию, показываются 1000 записей.

source: Click "Update" to apply the set parameters.
ru: Нажмите «Обновить» для применения заданных значений.
